{
    "actilife": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 24.0,
            "calcium": 0,
            "coenzym Q10": 0,
            "energy": 2.0,
            "guarana": 0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 0,
            "others": "L-Carnitine (200mg)",
            "panthenol acid": 0,
            "sodium": 0.1,
            "sugar": 0.0,
            "taurine": 400.0,
            "vitamin B1": 0,
            "vitamin B12": 0,
            "vitamin B2": 0,
            "vitamin B6": 0,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "TODO: Somewhere in Switzerland",
        "date": "2010-12-06",
        "look": "The can has a yellow and red look on a white background with a womans shilouette in green. The can looks quite stylish and is vaguely reminiscient of some coke commercials. The logo is a little running white stickfigure. The can also bears the slogan \"Be You\" which is just silly.",
        "name": "actilife Be you",
        "overall": "Looks good, smells bad, tastes worse. The marketing strategy seems to be to hide the disgusting contents in a pretty container. Why can they not put a normal energy drink into this can. It could still be for women, but not taste so shitty. Of course the artificial sweetener is noticeable, as it makes all energy drinks worse.",
        "paid": 1.3,
        "rating": 2.1,
        "taste": "WTF...How can anyone like this? Again a drink for women and again it is freakin disgusting... This one is incredibly sour and in the aftertaste that replacement sugar taste rapes your mouth. After swallowing it gets really bitter... but why??? Do the producer think that women believe if it tastes disgusting it must be healthy? There is no other chance they still produce and sell this stuff.",
        "tribute": "Thanks goes to Thorsten Schoog, but this energy drink still sucks.",
        "url": "www.actilife.ch",
        "volume": 250.0
    },
    "action_energy_drink": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 31.5,
            "calcium": 0,
            "coenzym Q10": 0,
            "energy": 48.0,
            "guarana": 0,
            "inositol": 10,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 7.92,
            "others": "",
            "panthenol acid": 1.98,
            "sodium": 0.1,
            "sugar": 11.0,
            "taurine": 380.0,
            "vitamin B1": 0,
            "vitamin B12": 2.0,
            "vitamin B2": 0,
            "vitamin B6": 2.0,
            "vitamin C": 0,
            "whey": 51
        },
        "bought from": "Beverage Dispenser Stuttgart Schwabstrasse",
        "date": "2010-12-11",
        "look": "The drink comes in a silver can with orange and black label. The \"ACTION\" logo goes from bottom to top. At the back you have 3 pictograms, one a jumping person, second a fucking molecule(wtf?!?) and third a head with gears inside. I have no idea what they want to point out with that. There is another label which says \"get your fire\" which makes even less sense. Overall i kinda like the style and probably i am only nitpicking.",
        "name": "ACTION Energy Drink",
        "overall": "Actually this drink is not too bad, besides the film created on the tongue. I am really a fan of these whey drink anyway. It could need some more CO2 as well.",
        "paid": 1.0,
        "rating": 7.6,
        "taste": "It smells a lot like the \"average\" energy drink. At first it really tastes not too bad, but the after taste is really really sweet and tastes a lot like gummy bear taste. It is a bit sour, but still does not have enough CO2. The whey inside the drink makes a weird taste on the tongue and teeth. My friends say it taste like red bull just with bad after taste. In my oppinion the first taste is not as sweet as red bull.",
        "tribute": "Big thanks goes to Momo for providing me with the source. His comment on the energy drink is \"Hoden Reiben\". Earlier Melissa bought me this drink from Mueller Stuttgart for which i am really grateful for.",
        "url": "www.tsi.de",
        "volume": 250.0
    },
    "action_tabs": {
        "CO2": false,
        "Nutritions": {
            "biotin": 0,
            "caffein": 32.0,
            "calcium": 0,
            "coenzym Q1": 0,
            "energy": 3.75,
            "glucuronolacton": 0,
            "guarana": 0,
            "inositol": 10.0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 3.0,
            "others": 0,
            "panthenol acid": 1.0,
            "sodium": 0.2,
            "sugar": 0.25,
            "taurine": 1000.0,
            "vitamin B1": 0,
            "vitamin B12": 0.17,
            "vitamin B2": 0,
            "vitamin B6": 0.3,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "TEDi Stuttgart Ludwigsburg",
        "look": "The packaging looks very familiar, in fact it totally is the same design and packaging as Action Energy Drink in a can.\n\nThe instruction says \"add 200ml cold water\" and then it is done. The tablet dissolves kinda quickly in the water.\n\nAfter the tablet is disappeared you get a greeny-brown drink without any bubbles. The drink does not really look that delicous. Actually the drink you get does look pretty similar to the canned version of Action Energy besides the fact there is no CO2 inside.",
        "name": "Action Energy Drink Tabs",
        "overall": "I wanted to do this \"drink\" for a long time but just haven't found the time to do a full-fledged review about it. These Action Tabs are a great example for (ab)using an already existing brand for something really different. Still the tablets  are not too far away from the canned version. \n\nIf you need a quick caffeine kick, try adding just a tiny bit of water to the tablet and swallow it down. It will be somewhat disgusting and be sure to drink lots of water after it, but it is better than adding the water to the drink i first place. This is pretty similar to the energy shots you can buy from different brands.\n\nThe Action Energy Drink fizzy tablets have great experimenting value, be sure not to overplay it. Still, i like the canned version of Action, and prettty much every other sparkling energy drink better than this stuff.\nThe tablets contain much of the \"good stuff\" and are pretty cheap, because it includes 20 tablets for 200ml each instead of just one drink. The tablets surely have some advantages over 'ready to drink' energy drinks, but do not taste that \"great\". \nBe sure to check them out if you have the chance, it is quite something different and has great mixing potential.\n\nP.S.\nThe nutritions are calculated for one tablet in 200 ml water (similar to a 200ml energy drink). To get the ingredients for one tablet, just multiply by two.",
        "paid": 1.5,
        "rating": 7.7,
        "taste": "Now THAT is something different. Normally i only review drinks which are already in the fluid state when i buy them. Action Energy Drink Tabs come in small fizzy tablets. \"Just add Water\" and you get your delicious beverage. It does not have any smell and the first sip is ... not that great. Even though the tablet was sparkling and everying when adding water, it does not contain any CO2 at the end. These Action Tabs are very sweet and have a kinda weird after taste. I cannot really describe what it is, but it surely does not taste great, it probably comes from the fake sugar. When i bought these they might actually taste like the original Action Energy Drink and therefore i bought the can as a reference in taste. In fact, the \"real\" action drink tastes much much better, much due to the fact that it contains CO2 and probably because they added real sugar instead of the replacement sweetening stuff. The original drink is much more sour and less sweet than the tabs(even though it has 11g sugar in it). The after taste is also not that disgusting. \nI tried a lot in order to make the tablets taste better. The first thing i tried out was to add the tablets to a tiny bit of water and after it dissolved adding sparking water. Still, after 10 seconds all the CO2 disappeared from the beverage, which is kinda sad because i think these tables may taste better with added CO2. \nI also tried to add just a small bit of water and then add the tablet. The smell of this mixture is incredibly strong, nearly as strong as inhalating the pulver from the tablets itself. I actually have some hassle to drink it...my god...it is like pure sugar in water. My mouth is somewhat glued together and the taste won't disappear. I had to drink some of the original drink to make it go away....\nWell it probably was not the best idea to all these test at the same time, i can already feel the caffeine kicking in, i feel kinda shaky.",
        "tribute": "",
        "url": "tedi-discount.com",
        "volume": 200.0
    },
    "afri_cola": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 25.0,
            "calcium": 0,
            "coenzym Q10": 0,
            "energy": 42.5,
            "guarana": 0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 0,
            "others": "",
            "panthenol acid": 0,
            "sodium": 0,
            "sugar": 10.5,
            "taurine": 0,
            "vitamin B1": 0,
            "vitamin B12": 0,
            "vitamin B2": 0,
            "vitamin B6": 0,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "Mueller Drogerie Stuttgart",
        "date": "2011-02-21",
        "look": "Afri Cola comes in a black(surprise) can with the white logo at the front. The logo is some kind of stylized palm tree i guess. All in all the can is really minimmalistic. In addition to that there is the 25mg caffein icon. This was actually because i bought this drink, because of it's massive amount of caffeine inside this innocent looking beverage.",
        "name": "Afri Cola",
        "overall": "Yes, this is one of the drinks i am not really sure again if it fits inside the \"energydb\", but i found it all right because of the exceptionally high amount of caffeine. Afri Cola tastes like Coke with a great amount of CO2, looks pretty neat and packs a great punch. I would always prefer this drink over original coke or pepsi. You will most likely find this drink only here in Germany or via export and in my oppinion it is really worth a try!",
        "paid": 0.69,
        "rating": 8.7,
        "taste": "As this is no ordinary energy drink i do not expect something out of ordinary bad or weird taste some exotic drinks have. Aaaand ... yep, it's coke. As i said, i  haven't expected anything less. Pretty sweet when swallowing it down and it has a whole bunch of Sparking CO2 inside, which i definitly like! If i would have to guess which is which between Coca Cola and Afri Cola i most likely would fail with a 50 percent chance. I really hope for the \"kick\" in half an hour!",
        "tribute": "",
        "url": "www.afri.de",
        "volume": 250.0
    },
    "angel_pomegranate": {
        "CO2": false,
        "Nutritions": {
            "caffein": 32,
            "energy": 45,
            "others": "Guarana Extract",
            "sodium": 0.03,
            "sugar": 11.2,
            "taurine": 0
        },
        "bought from": "Rewe Berlin Grünau",
        "look": "It comes in a white plastic bag, with a red ANGEL on at the front. Like most of the non-CO2 energy drinks, the packaging is somewhat similar to the capri sun packagings.",
        "name": "ANGEL Natural energy Pomegranate",
        "overall": "Even though i never drank a CO2 free energy drink which tasted good i though i would give this one a shot.Bad idea, now i got some serious head ache.I give 1 point for the packaging, which is kinda cool and the average caffein content",
        "paid": 1.65,
        "rating": 2,
        "taste": "Oh my god this is so sweet.It tastes incredibly disgusting like drinking pure syrup.",
        "url": "www.angel-drink.com",
        "volume": 330
    },
    "bawls_cherry": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 41.6,
            "calcium": 0,
            "coenzym Q10": 0,
            "energy": 90.0,
            "guarana": 0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 0,
            "others": "",
            "panthenol acid": 0,
            "sodium": 0.01,
            "sugar": 10.4,
            "taurine": 0,
            "vitamin B1": 0,
            "vitamin B12": 0,
            "vitamin B2": 0,
            "vitamin B6": 0,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "Internet trade shop importladen.de",
        "date": "2011-01-14",
        "look": "BAWLS comes in a red can with white \"balls\" all over. There is no real logo, just the text \"BAWLS Guarana Cherry\". ",
        "name": "BAWLS Guarana Cherry",
        "overall": "The first sip was really, really bad but if you drink on, it is not really too bad. When you wait a bit too long and drink again, the taste will be far too intense to really enjoy the drink. It was a \"different\" experience, but definitly a worth one.",
        "paid": 3.99,
        "rating": 7.1,
        "taste": "It smells like cherry BAWLS! Oh my god, it is so cherry and sweet. It is somewhat like coke cherry, but different. I really must say the first sip is much worse than the next ones. It got a lot of CO2 and the aftertaste is a bit sour. It probably kills everything in your mouth and you do not taste anything afterwards. The cherry taste is then not that bad anymore.",
        "tribute": "Thanks for this drinks goes to Christopher (Wooki) who bought me this drink for christmas, among other drinks i will review later on.",
        "url": "www.bawls.com",
        "volume": 473.0
    },
    "big_energy_shock": {
        "CO2": true,
        "Nutritions": {
            "caffein": 32.0,
            "calcium": 0,
            "energy": 60.0,
            "glucuronolacton": 0,
            "guarana": 0,
            "inositol": 0,
            "isomaltose": 0,
            "niacin": 5.4,
            "others": 0,
            "panthenol acid": 1.8,
            "sodium": 0,
            "sugar": 14.5,
            "taurine": 400.0,
            "vitamin B1": 0,
            "vitamin B12": 0,
            "vitamin B2": 0.48,
            "vitamin B6": 0.6,
            "vitamin C": 18.0,
            "whey": 0
        },
        "bought from": "CAP Markt, Stuttgart Untertuerkheim",
        "look": "The 500ml can of big energy shock is golden with black and a red comic explosion at the front. All letters of the logo are bold and in caps, but i do not like to shout on the internet. The can looks really nice to me, it seems like some high quality energy drink. Again, big shock looks really similar to Monster Energy or the Rockstar Energy Drink line because of the top banner with all the good things listed.",
        "name": "Big Energy Shock",
        "overall": "To me the Big Energy Shock series is a real surprise, the cans look cool and the drink itself tastes pretty awesome. If you get the chance, be sure to check it out. I can highly recommend both classic and juicy orange flavours.",
        "paid": 1.49,
        "rating": 8.3,
        "taste": "Well, Big Energy Shock smells like some ordinary energy drink... but the taste is kinda different from the other me-too energy drinks. It really has some unique taste, it is a bit tart, not that sweet but actually pretty neat. The drink is really refreshing, somewhat similar to the orange flavour one. ",
        "tribute": "",
        "url": "www.shockenergy.eu",
        "volume": 500.0
    },
    "big_energy_shock_orange": {
        "CO2": true,
        "Nutritions": {
            "caffein": 32.0,
            "calcium": 0,
            "energy": 61.0,
            "glucuronolacton": 0,
            "guarana": 0,
            "inositol": 0,
            "isomaltose": 0,
            "niacin": 2.4,
            "others": 0,
            "panthenol acid": 0.9,
            "sodium": 0,
            "sugar": 14.7,
            "taurine": 400.0,
            "vitamin B1": 0,
            "vitamin B12": 0,
            "vitamin B2": 0.21,
            "vitamin B6": 0.21,
            "vitamin C": 12.0,
            "whey": 0
        },
        "bought from": "CAP Markt, Stuttgart Untertuerkheim",
        "look": "The can of big shock orange looks pretty nice, quite possibly influenced by Monster or Rockstar energy drink. The 500ml can has an orange ribbon at the top, the logo in big letters and at the lower half of the can a stylish logo. The logo is a disco bowl with headphones on(?) and the lower ribbon is made of cheering people. I must say the design is pretty neat.",
        "name": "Big Energy Shock Orange juicy",
        "overall": "Big Shock seems to be a Czech energy drink based on the czech url and because it is the primary language on the contents description. This might even be the czech counterpart to the big Energy drinks Brands available like Monster or Rockstar. The \"Orange\" Big Shock is really tasty and in my oppinion tastes better than most of the big brands' flavours. It also has quite a bunch of the good stuff mixed in like a bunch of vitamins and caffeine maxed out. I can highly recommend this one if you have the chance to drink it.",
        "paid": 1.49,
        "rating": 8.5,
        "taste": "Wow, big shock orange really smells like orange juice. It smells even more orangy like Fanta. Hell, it even tastes like Miranda or Fanta. It is a bit more sour though.There is pretty much no `energy` taste in it whatsoever. It does not have a damn lot CO2 but it is not really necessary. This drink is really delicious! Even people who hate the energy drink taste quite possibly like this drink.",
        "tribute": "",
        "url": "www.bigshock.cz",
        "volume": 500.0
    },
    "big_pump": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 24.0,
            "calcium": 0,
            "coenzym Q10": 0,
            "energy": 45.0,
            "guarana": 0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 5.4,
            "others": "",
            "panthenol acid": 1.8,
            "sodium": 0.001,
            "sugar": 10.8,
            "taurine": 400.0,
            "vitamin B1": 0,
            "vitamin B12": 0,
            "vitamin B2": 0.48,
            "vitamin B6": 0.6,
            "vitamin C": 12.0,
            "whey": 0
        },
        "bought from": "Edeka Center Stuttgart Zuffenhausen",
        "look": "I bought the small 500ml see through bottle (there is also a 1.5 l variant). It got a striped blue/white label with the red and blue big pump logo in the front. It says \"filled with big pump original recipe\". The bottle got a plastic seal which is reclosable. Well you can close it but it sure as hell is not sealed after that again (there now is energy drink all over the floor...)",
        "name": "Big Pump Energy Drink",
        "overall": "The overall idea to start an energy drink database started with big pump, because it was the first energy drink which taste didn't sucked. I really like the taste and the price is fine too. One of my personal favorite drinks.",
        "paid": 0.49,
        "rating": 9.0,
        "taste": "This was the first energy drink i drank which actually tasted kinda good. It is not incredibly sweet, the gummy bear taste is not that dominant. It is a little bit sour and the after taste is ok.",
        "url": "www.bigpump.de",
        "volume": 500.0
    },
    "black_cat": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 30.0,
            "calcium": 0,
            "coenzym Q10": 0,
            "energy": 44.0,
            "guarana": 0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 7.9,
            "others": "",
            "panthenol acid": 2.0,
            "sodium": 0.07,
            "sugar": 10.4,
            "taurine": 380.0,
            "vitamin B1": 0,
            "vitamin B12": 2.0,
            "vitamin B2": 0,
            "vitamin B6": 2.0,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "Netto Stuttgart",
        "look": "Silver bottle with some real cheap label with a panther or something as a logo. This stuff looks real cheap, and well... it is, actually. Some people say it looks like a bottle for car oil...",
        "name": "Black Cat Energy Drink",
        "overall": "It tastes ok, it looks cheap and it definitly is some cheap stuff. The ingredients are what most of those discounter drinks are and it totally tastes like one.  In my oppinion, it is some fairly solid energy drink. Try it out, you will not regret it.",
        "paid": 0.49,
        "rating": 7.9,
        "taste": "It is very sparkling at the tongue. The gummy taste is at first very strong, but fades fast. It is like most drinks very sweet. It is totally drinkable.",
        "url": "Netto Marken-Discount AG, 93142 Maxhuetten-Haidorf -901390-",
        "volume": 500.0
    },
    "black_cat_exotic": {
        "CO2": true,
        "Nutritions": {
            "caffein": 30.0,
            "calcium": 0,
            "energy": 48.0,
            "glucuronolacton": 230.0,
            "guarana": 0,
            "inositol": 0,
            "isomaltose": 0,
            "niacin": 7.9,
            "others": 0,
            "panthenol acid": 2.0,
            "sodium": 0.01,
            "sugar": 11.4,
            "taurine": 380.0,
            "vitamin B1": 0,
            "vitamin B12": 2.0,
            "vitamin B2": 0,
            "vitamin B6": 2.0,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "Netto Stuttgart Zuffenhausen",
        "look": "The drink comes in a purple and pink can with a black panther as the logo. The design looks reaaaaaly cheap to me, especially because \"Juicy\" is written in a yellow wannabe stylish looking font which really bites with the rest of the design. The \"explosion\" behind the panther logo also looks totally shitty.",
        "name": "Black Cat Juicy Energy Drink Exotic",
        "overall": "Black Cat Exotic is a spin-off from the Black Cat energy drink. Being sold in a can instead of a cheap plastic bottle it really is somewhat different to the original drink.  The can itself is pretty big though (330ml)! For being a discounter energy this one is really not too bad just as good than the original black cat energy drink.",
        "paid": 0,
        "rating": 7.9,
        "taste": "Black Cat Exotic really smells like the Relentless Juicy energy drink. It does not taste like it though. The drink is pretty sour and does not taste like an normal energy drink. It is sweet, a bit like the Fanta soft drink. It surely is quite drinkable. The best thing is simply that it does not suck taste-wise compared to other \"Exotic\" Energy drinks.",
        "tribute": "",
        "url": "Netto Marken-Discount AG, 93142 Maxhuetten-Haidorf -901390-",
        "volume": 330.0
    },
    "blitz_energy": {
        "CO2": true,
        "Nutritions": {
            "caffein": 30,
            "energy": 46,
            "niacin": 7.2,
            "panthenol acid": 2,
            "sodium": 0,
            "sugar": 10.5,
            "taurine": 400,
            "vitamin B12": 0.4,
            "vitamin B6": 0.8
        },
        "bought from": "Unes Maxi, Milano, Via E.De Marchi",
        "look": "isilver with hurricane on it TODO",
        "name": "Blitz! Energy Drink",
        "overall": "cheap and solid, probably tastes better chilled.",
        "paid": 0.7,
        "rating": 6.7,
        "taste": "really sweet which tastes a lot like the standard gummy bear flavour. Not much CO2.(haven't drunk chilled though)",
        "url": "www.atlantesrl.it",
        "volume": 250
    },
    "blitz_start": {
        "CO2": false,
        "Nutritions": {
            "caffein": 416,
            "calcium": 480,
            "energy": 276,
            "guarana": 800,
            "niacin": 16,
            "others": "magnesium,(224mg),biotin(50mg),Mateextract(200mg)",
            "panthenol acid": 6,
            "sodium": 0,
            "sugar": 40,
            "taurine": 0,
            "vitamin B1": 1.12,
            "vitamin B2": 1.4,
            "vitamin B6": 1.4
        },
        "bought from": "Kaufland Berlin Karlshorst",
        "look": "Small red bottle or vial with Michael Schumacher on it.  Looks similar to other shots like Red Bull Shot.",
        "name": "Blitz Start",
        "overall": "Well what can i say, this was my first SHOT and i cannot really say i like the taste. It contains a vast amount of added vitamins and stuff, so it has to be good. The vial is very small and perfect to-go for the quick energy shot. It costs a lot less like the Red Bull Shots here. At least try it once.",
        "paid": 1.25,
        "rating": 6.7,
        "taste": "Smells really intense like multi vitamin drinks. The first sip is extremely sour, i guess you have to drink it at once. Oh my god it tastes so weird... Like very sour syrup or something. I dont know.",
        "url": "www.schneekoppe.de",
        "volume": 25
    },
    "blue_bastard": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 32.0,
            "calcium": 0,
            "coenzym Q10": 0,
            "energy": 46.0,
            "guarana": 0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 7.92,
            "others": "",
            "panthenol acid": 1.98,
            "sodium": 0.1,
            "sugar": 10.5,
            "taurine": 400.0,
            "vitamin B1": 0,
            "vitamin B12": 0.4,
            "vitamin B2": 0,
            "vitamin B6": 0.8,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "Deka Markt,Zaanse Schaan Netherlands",
        "look": "This drinks comes right from Holland, therefore most texts are dutch. It comes in a black can with a \"Blue Bastard\" dog at the cover. The can says it got \"an awfully 'cool' taste\" but i am not quite convinced yet. At first sight i haven't spotted the text it got CO2 but i hope for the best. O.k lets give it a shot",
        "name": "Blue Bastard Energy Drink",
        "overall": "All in all, this drink tastes pretty good. In respect to the price, it is really neat. I probably won't have the chance to drink it again, but if you live in Holland, you might be lucky to find it in your local supermarket.",
        "paid": 0.35,
        "rating": 8.1,
        "taste": "It is a bit sour and got very few CO2 inside. Still, it does not taste too bad. The drink is sweet, but not too sweet and it is quite drinkable. This taste is relevant to my interest.",
        "tribute": "I want to thank Melissa for buying me this drink on her trip to Holland.I will always remember the time we drank and reviewed the \"Blue Bastard\" in Hamburg.",
        "url": "Blue Bastard Postbus 80, 4153 ZH BEESD",
        "volume": 250.0
    },
    "boost": {
        "CO2": false,
        "Nutritions": {
            "biotin": 0,
            "caffein": 30.0,
            "calcium": 0,
            "coenzym Q1": 0,
            "energy": 47.0,
            "glucuronolacton": 0,
            "guarana": 0,
            "inositol": 1.0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 7.2,
            "others": 0,
            "panthenol acid": 2.0,
            "sodium": 0.08,
            "sugar": 10.9,
            "taurine": 400.0,
            "vitamin B1": 0,
            "vitamin B12": 0.2,
            "vitamin B2": 0,
            "vitamin B6": 0.8,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "UK Shop Stuttgart Stadtmitte",
        "look": "The Boost energy drink comes in a silver plastic bottle  with a black and dark blue label. One might confuse it with an oil bottle you can buy at the gas station. Because of that i want to warn you about the fact that one of these drinks might taste considerably worse and may harm your health. Boost itself looks, when drunken out of a glass like wee-wee with tiny little bubbles inside. I do not really know where these come from as the drink itself is still.",
        "name": "Boost Energy",
        "overall": "I bought this drink from an UK Shop in Stuttgart, therefore i guess it must be from Great Britain. This means it must be better than other drinks! ... OR IS IT? The Boost Energy drink does not contain any CO2 (as mentioned in 'Taste') which means for me it cannot possibly be as good as an ordinary energy drink. And yes, it does suck. It surely is not the worst but also not the best still energy drink. The ingredients are pretty average, high amounts of caffein, lots of taurine and some vitamins are added to the drink. It might give you the kick but it does not taste really great, therefore I cannot really recommend it.",
        "paid": 1.2,
        "rating": 4.7,
        "taste": "Boost smells at first a tiny bit like Mad Bat but the plastic smell is far less strong, luckily i must say. I really expected this drink to have at least a bit of CO2 but not be still... Boost, why you failed me? I mean, it is not horribly bad, i kinda like the pricking of the citric acid. There is a small bit plastic taste in this drink, similar to Mad Bat but as the smell, it is not that strong. Be sure to drink it cold because otherwise you might experience a new level of disgust (considering you haven't drunk MB before). Besides that it got this typical gummy bear taste.Boost does not really have a 'good' taste i must say...",
        "tribute": "",
        "url": "www.boostdrinks.com",
        "volume": 500
    },
    "booster_edeka": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 32.0,
            "calcium": 0,
            "coenzym Q10": 0,
            "energy": 44.0,
            "guarana": 0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 8.0,
            "panthenol acid": 2.0,
            "sodium": 0.07,
            "sugar": 10.4,
            "taurine": 400.0,
            "vitamin B1": 0,
            "vitamin B12": 2.0,
            "vitamin B2": 0,
            "vitamin B6": 2.0,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "Edeka Berlin Alexanderplatz(Alexa)",
        "look": "Silver can with Blue BOOSTER at the front. Looks pretty cheap to me.",
        "name": "Booster Energy Drink",
        "overall": "It is incredibly cheap so at least give it a try. The taste is weird and i o not really like it much, it just feels wrong. Maybe it is just today where i triedit.. Maybe it is just me.",
        "paid": 0.49,
        "rating": 6.2,
        "taste": "It actually does not have a strong gummy bear taste, more like something else.. chemical. I do not really know what it is but it definitly tastes different. Of curse again it is very sweet and all but it is different. It is a really weird feelin when i gulp it and my head starts to feel weird. A sour aftertaste enhances this feling.",
        "url": "EUCO GmbH, D-22291 Hamburg, 5150683",
        "volume": 330.0
    },
    "bullit": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 32.0,
            "calcium": 0,
            "coenzym Q10": 0,
            "energy": 47.3,
            "guarana": 0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 6.0,
            "others": "folacin(66.6ug)",
            "panthenol acid": 2.0,
            "sodium": 0.005,
            "sugar": 11.1,
            "taurine": 30.0,
            "vitamin B1": 0,
            "vitamin B12": 0,
            "vitamin B2": 0,
            "vitamin B6": 0.666,
            "vitamin C": 20.0,
            "whey": 0
        },
        "bought from": "Penny Hamburg",
        "look": "It looks like magic man bottle only with blue instead of purple. It even got the davinci Man on the front. The Name is different though.",
        "name": "Bullit Get It! Energydrink",
        "overall": "It is 100 percent Magic Man. Period. This actually is the first drink where i am totally sure it is from the same producer. ",
        "paid": 0.49,
        "rating": 4.1,
        "taste": "OH MY GOD, this totally tastes like Magic Man (which taste sucks balls). This IS Magic Man",
        "url": "GEDIMA Erfrischungsgetraenke GmbH, D-41836 Hueckelhoven",
        "volume": 500.0
    },
    "burn_energy": {
        "CO2": true,
        "Nutritions": {
            "caffein": 32,
            "energy": 57,
            "glucuronolacton": 140,
            "inositol": 12,
            "niacin": 6,
            "others": "",
            "panthenol acid": 1.7,
            "sodium": 0.02,
            "sugar": 13.3,
            "taurine": 400,
            "vitamin B12": 0.3,
            "vitamin B6": 0.7
        },
        "bought from": "Supermarked PAM, Milano, Viale Olona",
        "look": "Black can with a flame at the front. Does more look like chili drink than energy drink.",
        "name": "Burn Energy Drink",
        "overall": "It is from the Coca Cola Company, and they did everything right when mixing this drink. It is one of my favorite energy drinks, even though i only have drank it once in Milan. Only downer is the pretty costy price tag.",
        "paid": 0.99,
        "rating": 8.9,
        "taste": "It tastes like every energydrink very sweet. Instead of having an overwhelming gummy bear taste, this stuff is more like a berry drink. It is somewhat sour, has lots of CO2 and is very sparking, which is, in this case, a good thing. I really like it, this can be considered a `premium` energy drink! I really like the berry aftertaste.",
        "url": "www.burnenergydrink.it",
        "volume": 250
    },
    "clickz": {
        "CO2": false,
        "Nutritions": {
            "biotin": 0,
            "caffein": 15.2,
            "calcium": 0,
            "coenzym Q10": 0,
            "energy": 0,
            "guarana": 0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 0,
            "others": "ginseng(180ug)",
            "panthenol acid": 0,
            "sodium": 0,
            "sugar": 0,
            "taurine": 36.4,
            "vitamin B1": 0,
            "vitamin B12": 0,
            "vitamin B2": 0,
            "vitamin B6": 0,
            "vitamin C": 3.0,
            "whey": 0
        },
        "bought from": "Indomaret Bali, Indonesia",
        "date": "2011-01-09",
        "look": "The energy drink comes in a small see-through plastic bottle with a red and yellow label. The Clickz(r) logo is at the front. The drink itself has a somewhat yellowy color and does not look too promising.",
        "name": "Clickz Suplemen Makanan",
        "overall": "It looks like the first sight is not always right. Actually this is the best non-CO2 drink i ever drank. It is just so much better than every comparable drink. It is juicy and fruity and first of all it is not too sweet and not too sour! Why cannot other producer do as well here in Germany? This is some first class still energy drink.",
        "paid": 0.28,
        "rating": 8.1,
        "taste": "It does not smell weird or something, just a lot like gummy bear flavor from ordinary drinks just much more intense. The first sip was like... whew, this does not taste too bad. Actually it is really good for a drink without CO2. The flavor is similar to some fruit juice, has an undefined \"fruity\" taste but is much sweeter than normal juices just not as sweet as most energy drinks. The after taste is a bit sour. I somewhat like it. EDIT: I arbitrarily changed the score because i still have to drink such a good still energy drink (besides Mad Bat BIO which tastes like apple juice, but not energy).",
        "tribute": "Lots of Thanks goes to Melissa, who brought me the first delicious still energy drink i ever drank!",
        "url": "PT. Sariguna Primatirta Pandaan, Indonesia",
        "volume": 330.0
    },
    "denner_e-zero": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 32.0,
            "calcium": 0,
            "coenzym Q10": 0,
            "energy": 3.0,
            "guarana": 0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 8.0,
            "others": "Glucoronolacton(240mg)",
            "panthenol acid": 2.0,
            "sodium": 0.0,
            "sugar": 0.0,
            "taurine": 380.0,
            "vitamin B1": 0,
            "vitamin B12": 2.0,
            "vitamin B2": 0,
            "vitamin B6": 2.0,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "Denner Swizerland",
        "date": "2010-12-10",
        "look": "The drink comes in a all-silver can with the red e-zero logo at the front. The can looks kinda cheap but not nearly as cheap as the last drink i had from swizerland (M Budget). In fact, the can looks pretty cool and minimalistic.",
        "name": "Denner E-ZERO energy-taste",
        "overall": "This is one of the drinks from swizerland, again sugar-free and from a super market chain (Denner). Still this drinks sucks less than the one from M Budget. Again it not really helps the drink has no sugar (taste-wise) but it is not too bad either. It is actually produced in the Netherlands, where a lot of energy drinks come from. Seems the people there have it with stuff to stimulate body and mind. It surely is not the greatest energy drink i ever had, but i am pretty optimistic it helps me over my after lunch grogginess.",
        "paid": 0.69,
        "rating": 7.3,
        "taste": "OK, lets give it shot. Based on the label i prepare myself for another shitty zero-sugar drink. The smell is like an ordinary energy drink. Wow the first sip was not nearly as bad as i expected a low-cal energy drink. In fact i kinda like the taste. It is a bit sweeter than the \"average\" energy drink and the taste is something between gummy bears and chewing gum. The after taste is a bit bitter but it does not necessarily suck like most of these drinks.",
        "tribute": "Thanks goes to Thorsten Schoog. You are awesome!",
        "url": "www.denner.ch",
        "volume": 250.0
    },
    "denner_energy": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 30.0,
            "calcium": 0,
            "coenzym Q10": 0,
            "energy": 43.0,
            "guarana": 0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 8.0,
            "others": "",
            "panthenol acid": 2.0,
            "sodium": 0.0,
            "sugar": 10.0,
            "taurine": 380.0,
            "vitamin B1": 0,
            "vitamin B12": 2.0,
            "vitamin B2": 0,
            "vitamin B6": 2.0,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "Denner Swiss",
        "date": "2011-02-06",
        "look": "The can is really basic, a red and silver can with ENERGY vertically typed on the can. As this is a super market drink from denner they do not have to worry about  a fancy outside, as long the drink itself tastes ok.",
        "name": "Denner Energy Drink",
        "overall": "Denner is a Super Market in Swizerland, a quite big one as well. Luckily they decided not to create \"something new\" but a rock-solid energy drink worth buying. It is really really basic, the taste is good (e.g. it does not suck) and the packaging is basic. I would buy this drink a lot if i would live in swizerland. Great stuff, it does not happen often that super markets buy \"the right\" drinks for their sortiment instead of buy drinks that suck, but are dirt cheap and are getting bought because of that instead of actually tasting good. I am drinking this one at 12:45 pm here in germany and i hope for a great kick for my productivity when working on my projects this night. I am really confident in the power of this drink. I really must say the price is absolutely great for a canned energy drink. Here in Germany you will normally not find so cheap canned drinks that do not suck.",
        "paid": 0.28,
        "rating": 8.7,
        "taste": "OK, up for another one. It does not taste like anything out of the ordinary, expecting a pretty generic energy drink. Well what can i say, at the beginning it is really fizzly but this stops quite fast. The taste is what you expect and like from an energy drink, gummy bear taste, pretty sweet, not too sour. This one is quite drinkable i must say. Of course, like for all other energy drinks it has to be chilled in order to \"not suck\", same surely goes for this drink.",
        "tribute": "Thanks goes to Thorsten who bought this drink in Swizerland for me!",
        "url": "www.denner.ch",
        "volume": 250.0
    },
    "ed_hardy": {
        "CO2": true,
        "Nutritions": {
            "caffein": 34,
            "energy": 45,
            "niacin": 8,
            "others": "",
            "panthenol acid": 2,
            "sodium": 0,
            "sugar": 10.7,
            "taurine": 400,
            "vitamin B12": 2,
            "vitamin B6": 2
        },
        "bought from": "Netto Bohnsdorf",
        "look": "It is a black can with a drawn tiger on the front (most likely a well known tattoo by ed hardy). For me it looks somewhat stupid. I do not like the style of these tattoos at all.",
        "name": "Ed Hardy Energy Drink",
        "overall": "It is not my taste and i do not really like the style.  The price is above average, but it surely packs a punch with all the added stuff in it. My guess is you pay a lot for the name, not the good taste.",
        "paid": 0.99,
        "rating": 4,
        "taste": "It tastes a lot like some very sweet berry juice.  The taste is very intense, it actually is too sweet in my opinion.  It got a below average CO2 contents or maybe it is because it fell down when i bought it.",
        "url": "www.edhardyenergydrink.eu",
        "volume": 250
    },
    "effect": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 32.0,
            "calcium": 0,
            "coenzym Q10": 0,
            "energy": 45.0,
            "guarana": 0,
            "inositol": 20,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 7.0,
            "others": "",
            "panthenol acid": 2.0,
            "sodium": 0.07,
            "sugar": 11.0,
            "taurine": 400.0,
            "vitamin B1": 0,
            "vitamin B12": 2.0,
            "vitamin B2": 0.6,
            "vitamin B6": 2.0,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "Rewe Berlin Bohnsdorf",
        "look": "It is a white and siver can with red dots. They seem to go for simplicity. I kinda like the look though.",
        "name": "effect",
        "overall": "I like the look, the taste and the price. This is one rock solid energy drink, one of my favorites. Do not hesistate to buy it when you see it. Sure there quite some other energy drinks which are a lot cheaper, but this stuff surely tastes good.",
        "paid": 0.99,
        "rating": 8.9,
        "taste": "It really tastes like a great energy drink. It is not too sour or sweet, well actually it is really sweet but that is fine for me. The gummy bear taste is not really strong which is a good thing. That is the stuff i really like to drink. I really would consider it premium (they actually tasted it before selling it).",
        "url": "www.effect-energy.com",
        "volume": 330.0
    },
    "ena_o": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 21.0,
            "calcium": 0,
            "coenzym Q10": 0,
            "energy": 53.4,
            "guarana": 0,
            "inositol": 21,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 7.6,
            "others": "Honey(840mg)",
            "panthenol acid": 0,
            "sodium": 0,
            "sugar": 12.5,
            "taurine": 420.0,
            "vitamin B1": 1.1,
            "vitamin B12": 0,
            "vitamin B2": 1.2,
            "vitamin B6": 2.1,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "Supermarket The Foodhall Senayan City, Jakarta,Indonesia",
        "date": "2011-01-07",
        "look": "It comes in an orange and yellow can with a blue Writing \"Ena'O\" at the front. A label says \"+ Honey\" and well, it tastes somewhat close to honey i must say.",
        "name": "Ena'O Energy Drink",
        "overall": "All in all i can say it tastes pretty bad, but not too bad. I am pretty disappointed that it does not contain any CO2 even though it comes in a can. The drink might be a lot better if it would contain sparking water. If you like honey juice with a bit of can packaging taste, you will love this drink. The energy drink is right from indonesia and there are 2 more to go. I have really no idea why they would sell an energy drink without CO2... but well, there might be people around which love this kind of drink.",
        "paid": 0.28,
        "rating": 2.2,
        "taste": "It smells like... energy drink? The drink tastes incredibly sweet without any CO2. It is just like when you add honey to water. In addition to that it tastes like plastic, somewhat colse to the taste of Mad Bat energy drink. I cannot really say i like it, but at least it is not as bad as Mad Bat!",
        "tribute": "Lots of thanks to Melissa who brought me this drink from her visit to Indonesia.",
        "url": "PT. SINDE BUDI SENTOSA, BEKASI 17510 Indonesia",
        "volume": 238.0
    },
    "ener-g_shot": {
        "CO2": false,
        "Nutritions": {
            "biotin": 0,
            "caffein": 160.0,
            "calcium": 0,
            "coenzym Q10": 0,
            "energy": 69.5,
            "guarana": 0,
            "inositol": 12,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 18.0,
            "others": "",
            "panthenol acid": 6.0,
            "sodium": 0.1,
            "sugar": 16.9,
            "taurine": 400.0,
            "vitamin B1": 0,
            "vitamin B12": 2.0,
            "vitamin B2": 0,
            "vitamin B6": 2.0,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "Reichelt Berlin Alexa",
        "date": "2010-12-28",
        "look": "It comes in a small plastic bottle with a red cap and a blue label. The shot has a flashy-like silver logo with the red ENER-G text at the front. The shot looks kinda cheap compared to otre shots, but because of being so small the shot drink will not stay on the table for long.",
        "name": "Ener-G Shot",
        "overall": "This is another of these \"shot\" drinks and what can i say... the taste was naturally really really bad. I must say i drank that one \"not\" cold but these shot drinks normally do not have to be cold (according to the commercials). I really hope there is one of these shot drinks which is actually drinkable, but i guess shots taste bad by design...",
        "paid": 0.99,
        "rating": 4.1,
        "taste": "Why cannot they produce a shot drink which actually tastes not like shit? It is ultra sweet at the beginning and then tastes like some kind of medicine against coughing. It really really tastes crappy and your face will go like DX when you drink it. I really hope for this drink to provide some of the good stuff to outdo the incredibly bad taste.",
        "tribute": "",
        "url": "Gedima ",
        "volume": 65.0
    },
    "ener_g": {
        "CO2": true,
        "Nutritions": {
            "caffein": 24,
            "energy": 50.2,
            "niacin": 6,
            "others": "",
            "panthenol acid": 2,
            "sodium": 0.1,
            "sugar": 12.1,
            "taurine": 30,
            "vitamin B6": 0.66,
            "vitamin C": 35
        },
        "bought from": "Edeka Berlin Alexanderplatz(Alexa)",
        "look": "Has a pretty standard, oldschool looking red can with blue and silver typeface",
        "name": "Ener-G",
        "overall": "It tastes better than the ener-g black stuff but not too much. It simply is not my taste. The price and the can is cool though. Can also be found in NP-Market Berlin",
        "paid": 0.69,
        "rating": 6.6,
        "taste": "Really sweet, with a very similar after taste to the ener-g black stuff. Gummy bear taste is pretty dominant. Also tastes a bit like berry but without the cola taste. In my oppinion it tastes better than the ener-g black.",
        "url": "GEDIMA Erfrischungsgetraenke GMBH",
        "volume": 250
    },
    "ener_g_black": {
        "CO2": true,
        "Nutritions": {
            "caffein": 25.6,
            "energy": 44,
            "niacin": 5.04,
            "others": "",
            "panthenol acid": 1.68,
            "sodium": 0.02,
            "sugar": 10.6,
            "taurine": 26,
            "vitamin B6": 0.56,
            "vitamin C": 16.8
        },
        "bought from": "Edeka Berlin Alexanderplatz(Alexa)",
        "look": "Black Can with red and bronze face. It says High energy and Cola Drink at the front.",
        "name": "Ener-G Black",
        "overall": "Besides being too frickin sweet for my taste it is not really bad. It has a below average caffein content and far below average taurine content. It is not really my taste, check it out anyway if you get the chance, because the price is actually really cheap.",
        "paid": 0.69,
        "rating": 5.5,
        "taste": "At first, it is really really sweet. It should taste like Cola but it sure tastes like everything BUT cola. The taste is something between berry juice,citrus and Gummy bear taste. It somewhat reminds me of the Coke of Red bull, which does not taste good either.",
        "url": "GEDIMA Erfrischungsgetraenke GMBH",
        "volume": 250
    },
    "energetica": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 15.0,
            "calcium": 0,
            "coenzym Q10": 0,
            "energy": 46.7,
            "guarana": 0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 8.0,
            "others": "",
            "panthenol acid": 2.0,
            "sodium": 0.1,
            "sugar": 10.7,
            "taurine": 400.0,
            "vitamin B1": 0,
            "vitamin B12": 0.2,
            "vitamin B2": 0.6,
            "vitamin B6": 2.0,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "Supermarket Valencia",
        "date": "2011-01-30",
        "look": "Energetica comes in a silver can with an orange spiral with the Energetica Logo at the middle. For having orange stripes i would have guessed this drinks is more... citrus tasting but it seems that is not really true. Purple stripes probably would have fit better.",
        "name": "Bebida Energetica",
        "overall": "This energy drink totally blew my mouth. I never would have expected this innocent looking drink is so frickin' sour (nearly as sour as She Energy...). If you totally want to kill your taste buds, try this drink. Energetica is a drink you will probably only find in spain as it smees pretty local and native to buy.",
        "paid": 0.35,
        "rating": 5.5,
        "taste": "Energetica smells horribly strong like gummy bear taste, probably berry taste...Oh my god energetica??? Why do you hurt so much? It is so so so sweet at the beginning and becomes so damn sour my mouth nearly imploded. I guess the taste is something between red berry and grape, probably? I cannot really tell as this drink is so so so sour....",
        "tribute": "Thanks goes to Carolin who bought this drink on her vacations in Valencia,Spain.",
        "url": "FONT SALEM, S.L. Partida el Fronto s/n, 46843-SALEM (Valencia)",
        "volume": 250.0
    },
    "energy_boost": {
        "CO2": true,
        "Nutritions": {
            "caffein": 32,
            "energy": 52,
            "niacin": 7.92,
            "others": "",
            "panthenol acid": 1.98,
            "sodium": 0.1,
            "sugar": 11.8,
            "taurine": 400,
            "vitamin B12": 2,
            "vitamin B6": 2
        },
        "bought from": "Lombardini Discont Milano",
        "look": "A silver and white can with a red bulldog as cover.  Actually looks really cheap.",
        "name": "Energy Boost Power Drink",
        "overall": "IMHO this is one of the below average cheap energy drink you stumble upon in different Super Markets. No difference here as i bought it in LD Market which is kinda like the ALDI market here in Germany. It does not really hits my taste, but it is actually really cheap. I am sure this is similar stuff to other cheap supermarket energt drinks and most likely the same stuff from the same producer",
        "paid": 0.59,
        "rating": 6.6,
        "taste": "It is really really sweet and the typical gummy bear taste is very dominant. For my taste there is not enough CO2 in it. The first taste is somewhat sour but not in a good way.",
        "url": "Lockwoods Italiana(pfanner italia),MD Getraenke GmbH",
        "volume": 250
    },
    "energy_rocket": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 32.0,
            "calcium": 0,
            "coenzym Q10": 0,
            "energy": 44.0,
            "guarana": 0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 7.92,
            "others": "",
            "panthenol acid": 1.92,
            "sodium": 0.1,
            "sugar": 10.0,
            "taurine": 380.0,
            "vitamin B1": 0,
            "vitamin B12": 2.0,
            "vitamin B2": 0,
            "vitamin B6": 2.0,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "Kaufland Stuttgart",
        "look": "The energy Drink comes in a blue plastic bottle with a silver label. At the front there is a (*surprise*) rocket with a red background on it. It does not look expensive (spoiler, it isn't) but the artist surely haven't put much effort in designing the packaging. It surely should not attract energy drink connoisseurs like me, but party people who want to pimp their cheap vodka to make it 'kick' more.",
        "name": "Energy Rocket",
        "overall": "Ok, here is a 'very late' review of the Energy Rocket. I bought this drink the first time last year but never had the vigor to review if completely. Energy Rocket is one of the 'cheapo' energy drinks you can buy at big market centers. The drink does not taste great, like most cheap drinks, but you at least have the chance to get your caffeine kick. The bottle looks cheap, the etiquette label too, but one will most likely not buy this drink because it is something special. ",
        "paid": 0.5,
        "rating": 6.0,
        "taste": "Energy Rocket smells somewhat like plastic and gummy bears. The really sweet odor is not really the greatest thing i ever smelt. The taste is, as expected, not good but average in terms of energy drinks. Energy Rocket has this plastic after taste combined with a very sugary taste. You can drink it very fast because this drink does not have an awful lot of CO2 inside. This drink might work as a mix-in but not pure, at least not for me. I changed the rating from 8 to 6 after retrying this drink. It seems my scale has changed after drink energy drinks like the 'schwarze dose' or 'relentless energy'.",
        "url": "Radlberger Getraenke A-3105 Unterradlberg",
        "volume": 500.0
    },
    "energy_slammers": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 32,
            "calcium": 0,
            "coenzym Q10": 0,
            "energy": 0,
            "guarana": 0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 7.92,
            "others": "",
            "panthenol acid": 1.98,
            "sodium": 0.08,
            "sugar": 11.4,
            "taurine": 0,
            "vitamin B1": 0,
            "vitamin B12": 0.5,
            "vitamin B2": 0.6,
            "vitamin B6": 1,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "Deka Markt,Zaanse Schaan Netherlands",
        "look": "It comes in a silver can with red and black printing. The full text at the front is \"Energy Slammers refreshing powerdrink with the 'unique energy taste'\". Well, lets see how unique it is. The can does not look too expensive (well it isn't :P ). But i must admit, it really looks like an average energy drink.",
        "name": "Energy Slammers Refreshing Powerdrink",
        "overall": "This is another energy drink from the Netherlands. It promotes its 'unique' taste and i must say the taste is somewhat unique, but not really in a good way. Most of the time breweries try out new tastes for their energy drinks they fail, this time it is not really the case. It is O.K. but surely not the best drink i ever drank. Give it a shot, you might like it. P.S. i was a bit ill the time, so i might not have described the taste 100 percent accurate.",
        "paid": 0.28,
        "rating": 6.3,
        "taste": "The first sip was like... mh it tastes like nothing (i thought it is because of the cold i had), but the after taste is ... \"unique\", really. It tastes like hubba bubba chewing gum. It is incredibly sweet and i really do not like this after taste. It does not have too much CO2 inside though, it is quite drinkable in this way.",
        "tribute": "Thank you so much, Melissa, for buying me this drink in the Netherlands!",
        "url": "Slammers Postbus 80 4153 ZH BEESD Nederland",
        "volume": 250
    },
    "energy_xxl": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 32.0,
            "calcium": 0,
            "coenzym Q10": 0,
            "energy": 48.0,
            "guarana": 0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 8.0,
            "others": "",
            "panthenol acid": 2.0,
            "sodium": 0.1,
            "sugar": 11.2,
            "taurine": 400.0,
            "vitamin B1": 0,
            "vitamin B12": 2.0,
            "vitamin B2": 0,
            "vitamin B6": 2.0,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "Internet trade shop importladen.de",
        "date": "2011-02-04",
        "look": "It comes in a black and orange can with a silver stripe. On this line there is the text \"get the power\", well i really hope i get the power from this drink. The can is slightly bigger than normal cans (330ml instead of 250ml).",
        "name": "Energy XXL",
        "overall": "I must say Energy XXL is not too bad of a drink. It is too sour for my taste but besides that flavor pretty solid. The can looks somewhat cool. Not a must buy but not to bad either.",
        "paid": 1.5,
        "rating": 7.7,
        "taste": "Energy XXL really smells like an ordinary energy drink. It really tastes like some ordinary drink, besides it is really really sour. It got the this gummy bear taste and the arbitrary sweetness. After a few sips the sour taste is not that bad anymore.",
        "tribute": "Thanks goes to Wooki for this drink.",
        "url": "www.energy-xxl.de",
        "volume": 330.0
    },
    "flying_power": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 32.0,
            "calcium": 0,
            "coenzym Q10": 0,
            "energy": 48.0,
            "guarana": 0,
            "inositol": 10,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 8.0,
            "others": "",
            "panthenol acid": 2.0,
            "sodium": 0.06,
            "sugar": 11.0,
            "taurine": 400.0,
            "vitamin B1": 0,
            "vitamin B12": 2.0,
            "vitamin B2": 0,
            "vitamin B6": 2.0,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "Aldi Sued Stuttgart Zuffenhausen",
        "look": "A brown see-through bottle with a silver and red label. The label has an eagle at the front.",
        "name": "Flying Power Energy Drink",
        "overall": "I am a bit disappointed by the drink because it provides not the usual quality expected from Aldi. Its incredibly cheap though.At least give it a try if you see it. It has a too intense taste and not enough CO2 for what i like.",
        "paid": 0.34,
        "rating": 5.2,
        "taste": "Smells really intense. Very few CO2, and a very strong gummy bear taste. It also is very sweet. After taste is somewhat sour.",
        "url": "S.Spitz GmbH A-4800 Attnang-Puchheim, Austria (powered by topstar)",
        "volume": 330.0
    },
    "fritz-kaffee": {
        "CO2": true,
        "Nutritions": {
            "caffein": 25,
            "energy": 43,
            "others": "",
            "sodium": 0.002,
            "sugar": 10.6
        },
        "bought from": "Kaisers Berlin Potsdamer Platz",
        "look": "Same as fritz cola, it has a simplified bottle with a now brown etiquette.",
        "name": "fritz Kola-Kaffee-Brause",
        "overall": "Weird and somewhat funny stuff. Just try it when you see it.",
        "paid": 0.79,
        "rating": 7.3,
        "taste": "It tastes like cola and ... well coffee. It is a really weird taste but i kinda like it. You have to try it out",
        "url": "fritz-kola.de",
        "volume": 330
    },
    "fritz_cola": {
        "CO2": true,
        "Nutritions": {
            "caffein": 25,
            "energy": 42,
            "others": "",
            "sodium": 0.002,
            "sugar": 10.5
        },
        "bought from": "Kaufland Berlin Schöneweide",
        "look": "It is a pretty simple bottle with a black sticker with two heads on it. I kinda like the look, it makes the Coke _cool_.",
        "name": "fritz-cola",
        "overall": "Even though at first i did not thought it is a real ENERGY DRINK but when i looked at the caffein contents my mind changed. The taste is really nice and smooth and got 25mg of the good stuff. For me it is a real go-go, check it out. I mean it.",
        "paid": 0.75,
        "rating": 8.4,
        "taste": "It tastes like normal coke with a tiny bit of citrus. It is really refreshening and is really similar to stuff like Vita Cola. In addition it got LOTS of caffein in it.",
        "url": "fritz-kola.de",
        "volume": 330
    },
    "gipsy_energy_cola": {
        "CO2": true,
        "Nutritions": {
            "caffein": 28,
            "energy": 51,
            "niacin": 8,
            "others": "",
            "panthenol acid": 2,
            "sodium": 0.05,
            "sugar": 12.7,
            "taurine": 10,
            "vitamin B12": 2,
            "vitamin B6": 2
        },
        "bought from": "Lombardini Discont Milano",
        "look": "A silver and red can with the Gipsy energy cola logo on it. It really looks cheap to me. But one cannot imagine that some can like that tastes like shit!",
        "name": "Gipsy Energy Cola",
        "overall": "This is the WORST! Never try it, just trust me. Never EVER buy this stuff. Even though it costs onl 59 cent, you will regret it!",
        "paid": 0.59,
        "rating": 1.0,
        "taste": "The first sip is like... mh ... 1 second later UAAARGHHHH!!!! Wtf seriously? what were they thinking? This is BY far the worst cola stuff i ever drank. It tastes so much like some weird chemical experiment. Thats how i would imagine toilet cleaner tastes like. Have they ever tasted it before?",
        "url": "Lockwoods Italiana",
        "volume": 250
    },
    "go_fast": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 32.0,
            "calcium": 0,
            "coenzym Q1": 0,
            "energy": 43.0,
            "glucuronolacton": 0,
            "guarana": 30.0,
            "inositol": 10.0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 7.2,
            "others": 0,
            "panthenol acid": 0,
            "sodium": 0,
            "sugar": 10.8,
            "taurine": 400.0,
            "vitamin B1": 0,
            "vitamin B12": 0.4,
            "vitamin B2": 0,
            "vitamin B6": 0.8,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "Vomar Supermarket, Netherlands",
        "look": "The drink comes in a Red and Black can with the White \"GO FAST!\" logo. At the front all the goodness is listed (see Overall). The fluid itself has a yellowy color. The can design does not look cheap to me, but it surely is not \"premium\" or anywhere near the given price tag (for the Netherlands).",
        "name": "Go Fast! Energy",
        "overall": "\"Go Fast!\" is another of the famous (and infamous) dutch energy drinks. This one 'has' to be good because it contains all goodness possible. Go Fast combines honey,taurine,niacin,ginseng,guarana,riboflavin,vitamin b6 and 12 AND Ginkgo Biloba. This surely is a premium energy drink ,not only price wise as it is more expensive than red bull! But i must say the taste is not like all the powers combined, more like a berry energy drink. \nWhen you wait too long to drink it the CO2 fades and the taste gets worse. That is probably why the drink is called \"Go Fast!\" because you better drink it up fast before it starts to suck. There are quite a few energy drinks which behave that way, probably because it is a slight violation of rule number 1: \"Never drink a warm energy drink\".\nThe drink is quite different in taste from ordinary drinks but not that different from juicy and berry energy drinks. Conclusion: It is drinkable but not great deal.",
        "paid": 1.29,
        "rating": 5.9,
        "taste": "Man this smells like yoghurt gummy.  It is really intriguing and the light sparkling is actually pretty audible. It tastes... weird, but not necessarily bad. It somewhat tastes like yoghurt. The taste stays really long inside your mouth and it is somewhat gooey. It surely does not taste like an ordinary energy drink. Go fast leaves a sugary sweet on my tongue and my teeth. I do not know but something is wrong with the after taste but i cannot tell what. This drink gives me a slight head ache. When the drink gets warmer the taste becomes more intense, slightly sour, but definitly not better... ",
        "tribute": "Many thanks goes to Misa how bought this drink on her trip to the Netherlands.",
        "url": "gofastsports.com",
        "volume": 250.0
    },
    "hot_blood": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 32.0,
            "calcium": 0,
            "coenzym Q1": 0,
            "energy": 45.0,
            "glucuronolacton": 0,
            "guarana": 0,
            "inositol": 3.0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 7.2,
            "others": 0,
            "panthenol acid": 2.4,
            "sodium": 0.08,
            "sugar": 10.5,
            "taurine": 400.0,
            "vitamin B1": 0,
            "vitamin B12": 0.4,
            "vitamin B2": 0,
            "vitamin B6": 0.8,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "Migros  Breuningerland Ludwigsburg",
        "look": "The can itself looks really really cool i must say. It is golden with the black text and the red \"heart\". The heart is actually a cut-out of the two \"o\"'s in the name, pretty neat. Hot Blood looks \"special\", like some canned prosecco drink. When filled in a glass the fluid looks whitey greenish, like some ISO drink.",
        "name": "hot blood",
        "overall": "This is a whey-energy drink, meaning it contains at least 51% whey. This makes the drink no-desposit here in Germany. The taste is not great, the looks are great. I might not buy this drink again for myself but\nI would buy it  just for the looks for a friend as present. Really too bad the can is pretty small for the price.",
        "paid": 1.49,
        "rating": 6.6,
        "taste": "Most whey energy drinks i drank were pretty decent, i hope the best for this one as well. It smells at least like an ordinary drink, typical sweet gummy smell. The taste itself decent i must say, not especially great. It tastes like most decent energy drinks, has a \"special\" flavor which does not really fit to the energy drink taste, probably this is the whey taste i cannot really tell. Besides that the taste is not more than \"o.k.\"",
        "tribute": "",
        "url": "www.hotbloodenergy.de",
        "volume": 250.0
    },
    "ice-x": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 0,
            "calcium": 0,
            "coenzym Q10": 0,
            "energy": 32.0,
            "guarana": 0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 0,
            "others": "Hemp-flower Extract(50mg)",
            "panthenol acid": 0,
            "sodium": 0,
            "sugar": 7.6,
            "taurine": 0,
            "vitamin B1": 0,
            "vitamin B12": 0,
            "vitamin B2": 0,
            "vitamin B6": 0,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "Internet trade shop importladen.de",
        "date": "2010-12-21",
        "look": "It comes in a green can with dark green stripes and a hemp-leaf as logo. The name 'ICE-X' is at the front with red font. As slogan the can has \"I FEEL GOOD!\" which i will come to in the Overall review. Besides that, the can obviously tries to sell it's \"special\" ingredient Hemp-flower (a.k.a. Cannabis).",
        "name": "ICE-X Cannabis Ice Tea",
        "overall": "I really thought a lot about whether i should include this drink in my energydb because it has no added caffein inside (besides the black tea extract which might contain a tiny small bit of caffein) and eventually i chose to just add it because... well better one more than one less drink. This time the special ingredient is cannabis extract which sells(mostly illegally) for it's stimulating and also relaxing effect on the human body. This drink is surely something special, tastes a lot like mate tea (see for example leet mate) and has a good amount of CO2 inside, which i really approve. This can contains the absolute maximum amount of THC, which is a good thing i guess? When drinking this drink and playing some games afterwards i cannot really tell if everyhing was funnier, but i think it was a little bit, yes. So i guess, the slogan does match at some point, even though the effect was not enormous. For that you surely must drink more than one can ;P. So if you ever see this drink somewhere and it is not too freakin' expensive, give it a shot!",
        "paid": 1.14,
        "rating": 7.7,
        "taste": "It somewhat tastes like Club Mate (not yet reviewed in this Database), actually it is kinda nice. The drink is not really sweet but a somewhat tart. The aftertaste is... well weird ...? I do not really know how to describe the taste, it was when rough when swallowing it down and left a weird \"hemp-like\" taste in the throat. I really have problems to describe this one. I mean it is not bad and all,actually surprisingly good but there is somewhat, which is just different i guess.",
        "tribute": "Lots of thanks goes to Chris Gregorian who bought me this (and other drinks, which i will review in near future) for christmas. Still, why do you bought 20 MAD BAT energy drinks?????",
        "url": "www.ice-x.eu",
        "volume": 250.0
    },
    "jack_jones": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 33.0,
            "calcium": 0,
            "coenzym Q10": 0,
            "energy": 47.0,
            "guarana": 0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 5.4,
            "others": "Folic acid(60ug)",
            "panthenol acid": 1.8,
            "sodium": 0.001,
            "sugar": 11.3,
            "taurine": 30.0,
            "vitamin B1": 0,
            "vitamin B12": 0,
            "vitamin B2": 0.48,
            "vitamin B6": 0.6,
            "vitamin C": 18.0,
            "whey": 0
        },
        "bought from": "Jack/Jones jeans shop",
        "date": "2011-01-10",
        "look": "The drink comes in a black can  with white lines and text. The lines form the back of a jeans, did i really drank from that? My god...",
        "name": "Jack Jones Energy Drink",
        "overall": "I must say i somewhat like it. It does not taste bad and everything, but it is really nothing special. One problem is the price tag which is really above average. This is one of these promotional drinks labeled by the companies. I hope to find the \"original\" energy drink with the data collected.",
        "paid": 1.5,
        "rating": 8.1,
        "taste": "Yep, it's an Energy Drink. It is not that sweet, tastes somewhat like ... well energy drink, you cannot really expect less? This is \"the\" definitive average,generic energy drink. I mean it is not \"extreme\" in any way, but this is definitly a pro. I like it!",
        "tribute": "",
        "url": "www.uid.ag",
        "volume": 250.0
    },
    "kee_pex": {
        "CO2": true,
        "Nutritions": {
            "caffein": 32,
            "energy": 48,
            "niacin": 6.12,
            "others": "Maca",
            "panthenol acid": 2,
            "sodium": 0.02,
            "sugar": 11,
            "taurine": 400,
            "vitamin B6": 0.68
        },
        "bought from": "Hit Discounter Berlin Zoo",
        "look": "It is a red can with a bird in the front. I think it should be an eagle or something in front of three pyramids but it looks more like an angry seagul to me (which is even worse!). It says Energy Drink Maca Power, stating that they included something extraordinary into the drink.  The drink itself is pink, which was kinda surprising only knowing either ordinary energy drinks with this yellow-greenish color or the berry offsprings being pink.",
        "name": "Kee Pex",
        "overall": "This stuff is actually not bad, even though i do not really like the bubble gum taste in my energy drink. Be sure to check this one out if you get the chance. I mean it contains Maca and stuff!",
        "paid": 0.99,
        "rating": 6.7,
        "taste": "Given the fact Maca is in this stuff it does not really taste any different from all the other energy drinks. It somewhat tastes more like bubble gum (like HubbaBubba) than Gummy bears and it is, like most of these drinks, very sweet. It does not taste bad or anything, but i expected more of Maca(whatever this stuff is anyway).",
        "url": "www.kee-pex.de",
        "volume": 250
    },
    "leetmate": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 18.0,
            "calcium": 0,
            "coenzym Q10": 0,
            "energy": 0,
            "guarana": 0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 0,
            "others": "mate-extract(0.40g)",
            "panthenol acid": 0,
            "sodium": 0,
            "sugar": 0,
            "taurine": 0,
            "vitamin B1": 0,
            "vitamin B12": 0,
            "vitamin B2": 0,
            "vitamin B6": 0,
            "whey": 0
        },
        "bought from": "leetmate.de",
        "look": "It is a small see-through bottle with a printed black and green label. They got a ASCII-happy smiley in the front. At the inside of the label they got a QR-Code and \"1337 is awesome\".",
        "name": "1337mate",
        "overall": "This scene drink is driven under the concept of CC-BY-NC-SA. The guys behind 1337mate aim to be the open alternative to club mate. The drink as is tastes somewhat good, much more like mate tea.",
        "paid": 1.5,
        "rating": 8.4,
        "taste": "It tastes like Mate-tea with CO2 and sugar. There is another drink, well known in the hacker scene, Club Mate. It tastes much more like the original Mate tea, much more aromatic and tangy. It got few CO2 but tastes pretty good.",
        "url": "www.leetmate.de",
        "volume": 330
    },
    "lions": {
        "CO2": true,
        "Nutritions": {
            "caffein": 31.5,
            "energy": 48.8,
            "niacin": 7.92,
            "others": "",
            "panthenol acid": 1.98,
            "sodium": 0.1,
            "sugar": 11.3,
            "taurine": 380,
            "vitamin B12": 2,
            "vitamin B6": 2
        },
        "bought from": "Getränke Hoffmann Bohnsdorf",
        "look": "It comes in a somewhat cheap looking can with a female lion on it(wtf).The can is silver with red graphics on it.",
        "name": "Lions Energizer",
        "overall": "I can highly recommend it for its taste AND its price.  This is really really nice stuff which gives you lots of energy for the day or the night.",
        "paid": 0.49,
        "rating": 9.1,
        "taste": "I really like the taste of this stuff. It is not incredible sweet and the gummy bear taste is not too intrusive.",
        "url": "www.lions-energizer.de",
        "volume": 250
    },
    "m_budget_energy": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 32.0,
            "calcium": 0,
            "coenzym Q10": 0,
            "energy": 45.0,
            "guarana": 0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 8.0,
            "others": "",
            "panthenol acid": 2.0,
            "sodium": 0,
            "sugar": 11.0,
            "taurine": 400.0,
            "vitamin B1": 0,
            "vitamin B12": 2.0,
            "vitamin B2": 0,
            "vitamin B6": 2.0,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "Migros Swizerland",
        "date": "2010-12-11",
        "look": "It comes in a cheap looking green can. The can is the same as the sugar free variant of this energy drink, just without the sugarfree label. You would not expect this drink to appear in some clubs, but that is no problem for me.",
        "name": "M Budget Energy Drink",
        "overall": "This is some pretty good drink for its price. You may want to drink this one with your friends. The price is really really good for swizerland and o.k. for a drink here in Germany. If you have the chance and you are thirsty for ENERGY, be sure to check it out at least.",
        "paid": 0.66,
        "rating": 8.2,
        "taste": "Well, actually this drink does not really tastes too bad. It got the typical gummy bear taste, the after taste is a bit sour but quite ok. I would say this is the \"average\" energy drink. It does not taste like anything special. This is how you probably would expect an energy drink would taste like.",
        "tribute": "Thanks goes to Thorsten Schoog. Thank you for this delicious drink!",
        "url": "migros.ch",
        "volume": 250.0
    },
    "m_budget_sugarfree": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 32.0,
            "calcium": 0,
            "coenzym Q10": 0,
            "energy": 3.0,
            "guarana": 0,
            "inositol": 10,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 8.0,
            "others": "glucolacetone(240mg)",
            "panthenol acid": 2.0,
            "sodium": 0.0,
            "sugar": 0.0,
            "taurine": 400.0,
            "vitamin B1": 0,
            "vitamin B12": 2.0,
            "vitamin B2": 0,
            "vitamin B6": 2.0,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "Migros Swizerland",
        "date": "2010-12-09",
        "look": "It comes in a very cheap looking white and green can with the word \"migros\" all over it. The \"sugarfree\" inferer badge is light blue to make it look more \"light\". It has the Budget M logo at the front and even has the price at the front (swiss Fr. 0.85).",
        "name": "M Budget DRINK Sugarfree",
        "overall": "The sugarfree (aka replacement sugar) taste really kills my mood. Without it the drink might even taste better (or simply more like an ordinary energy drink). Good news, there is the pure-sugar version still in my fridge waiting to be reviewed. Even though this drink is sugar free and does not have any calories, it is also lacking of the main ingredient necessary to provide you with the energy you actually expect. Considering it is bought in swizerland it is not really expensive,. Thats why my expectations weren't too high either. I hope the real sugar version tastes better.",
        "paid": 0.66,
        "rating": 6.5,
        "taste": "Smells like every other energy drink. The inital taste is a lot like every drink, but the after taste is very bitter. At the end the replacement sugar taste tortures your taste buds. I really really hate that taste. Even though it will have no  calories, it really kills the joy of drinking. Without that it might tastes better (or more like every energy drink).",
        "tribute": "Thanks goes to Thorsten Schoog who provided me with all these great (*cough* or not so great*cough*) energy drinks directly from Swizerland.",
        "url": "www.migros.ch",
        "volume": 250.0
    },
    "m_classic_energy_cola": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 26.0,
            "calcium": 0,
            "coenzym Q10": 0,
            "energy": 44.0,
            "guarana": 0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 0,
            "others": "",
            "panthenol acid": 0,
            "sodium": 0,
            "sugar": 11.0,
            "taurine": 400.0,
            "vitamin B1": 0,
            "vitamin B12": 0,
            "vitamin B2": 0,
            "vitamin B6": 0,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "Migros Swizerland",
        "date": "2010-12-11",
        "look": "It comes in a silver can with red label and text. It is the same can as the other M Classic drinks just a different color. Again the can is slightly bigger than the normal cans, which is kinda cool in my opinion.",
        "name": "M Classig Energy Cola",
        "overall": "I am on the quest for the reasonably good tasting cola and energy drink. After this drink, i still am... How is it even possible to fuck up the taste that badly with every cola and energy drink? In the near future i will try it myself, to mix cola and energy. Maybe it is not even possible to mix these two without producing a bad taste? In my next cola/energy drink review i will write my results.",
        "paid": 0.77,
        "rating": 5.0,
        "taste": "UARGH this smells so weird... EWWW, why do all energy cola mix drinks taste so bad??? It tastes like there are some weird \"spices\" in this drink, i do not really know why. The after taste is just plain BAD, like cola syrup and energy and spices. In addition, the drink does not have enough CO2, which really sucks.",
        "tribute": "Tribute again goes to Thorsten Schoog!",
        "url": "www.migros.ch",
        "volume": 296.0
    },
    "m_classic_energy_fruity": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 32.0,
            "calcium": 0,
            "coenzym Q10": 0,
            "energy": 61.0,
            "guarana": 0,
            "inositol": 10,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 3.6,
            "others": "Guarana Extract, Ginseng Extract",
            "panthenol acid": 1.2,
            "sodium": 0.01,
            "sugar": 14.0,
            "taurine": 400.0,
            "vitamin B1": 0,
            "vitamin B12": 0.2,
            "vitamin B2": 0,
            "vitamin B6": 0.4,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "Migros Swizerland",
        "date": "2010-12-11",
        "look": "The drink comes in a silver bottle with an orange Banner at the front. It got the Energy Fruity logo at the front, which is barely recognizable because the orange cannot be distinguished from the silver can. The can is slightly bigger than average, nearly 50 ml more inside.",
        "name": "M Classic Energy Fruity",
        "overall": "This is another of the drinks from the M Classic series out of swizerland. I actually like these jucy drinks, but most of the drinks fail at not putting too much sweetener inside. And so is this drink, sadly. Actually it has all kinds of fruit juices inside (like apple,pear,mango), but it really tastes nothing like any of these fruits.",
        "paid": 0.77,
        "rating": 7.0,
        "taste": "Yet another drink which tastes so much like Monster Ripper. This one is so fickin' sweet my mouth nearly exploded. The after taste is just more sweet, which is NOT a good thing.. It really seems like most of these \"fruity\" drinks taste nearly the same, just more or less sweet. The smell is something between maracuya and pineapple. I mean it really would be great if it would not be so damn sweet. CURSE YOU ENERGY DRINK FACTORIES, why do you disappoint me so often???",
        "tribute": "Thanks goes to Thorsten Schoog for all the drink i am currently reviewing.",
        "url": "migros.ch",
        "volume": 296.0
    },
    "mad_bat": {
        "CO2": false,
        "Nutritions": {
            "biotin": 0,
            "caffein": 32.0,
            "calcium": 0,
            "coenzym Q10": 0,
            "energy": 48.0,
            "guarana": 0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 7.1,
            "others": "",
            "panthenol acid": 2.0,
            "sodium": 0.07,
            "sugar": 10.8,
            "taurine": 400.0,
            "vitamin B1": 0,
            "vitamin B12": 0.5,
            "vitamin B2": 0,
            "vitamin B6": 1.4,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "Edeka Supercenter Stuttgart Zuffenhausen",
        "date": "2010-11-27",
        "look": "It is a light-red and silver PAPER can with a small \"mb\" logo at the front. The can is made similar to the Tetra Pack packaging but in cylinder form. The opener is a small tin foil piece which you pull off to drink. On the can there is a \"since 1999\" and my only question is HOW did they survive for 11 years with such disgusting drink? But read more below.",
        "name": "Mad Bat Energy Drink",
        "overall": "I must say, this drink is really special. But special in a way you probably do not want your product be. This drink is, for now a really long time, the WORST energy drink i drank. Why, Mad Bat?  Why so disgusting?  The can says \"be awake\", well i am now awake but not because of the caffein but because of rage! Even if the drink would be free it would not be worth the price. My guess is that this drink is currently used for torture in afghanistan or korea. I HATE YOU bat beverages , i want my money AND the time back i needed to write this rant!",
        "paid": 0.89,
        "rating": "0.1",
        "taste": "EWWWW... wtf seriously? This drink is just disgusting. It tastes something between gummy and plastic.  Has someone from the producer ever tasted it before selling? obviously NOT! It just tastes WRONG, probably something between toilet cleaner and dish soap.",
        "tribute": "What the fuck were you thinking Christopher when you bought me 20(!) of these AFTER i reviewed this drink? Thank you very much...",
        "url": "www.madbat.net",
        "volume": 250.0
    },
    "mad_bat-bio": {
        "CO2": false,
        "Nutritions": {
            "biotin": 0,
            "caffein": 12.0,
            "calcium": 0,
            "coenzym Q10": 0,
            "energy": 48.0,
            "guarana": 0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 0,
            "others": "",
            "panthenol acid": 0,
            "sodium": 0,
            "sugar": 11.9,
            "taurine": 0,
            "vitamin B1": 0,
            "vitamin B12": 0,
            "vitamin B2": 0,
            "vitamin B6": 0,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "Mueller Stuttgart City",
        "date": "2011-03-01",
        "look": "As the original Mad Bat, it comes in a paper package can. But this time the can is green, because it is BIO (organic). There are all kinds of bio ingredients in this drink. Plus it got all kinds of stickers on which tell the stuff is super healthy and everything is good for you inside this drink. Still, this is the MAD BAT, by definition this drink cannot be that great, right?",
        "name": "Mad Bat BIO Energy",
        "overall": "What can i say, the revenge of Mad Bat was quite disappointing. I thought this drink sucks even more than the original one and that my current measure scale is not enough to describe this drink... but this drink is far too good to be in the league of the original mad bat... It is pretty mediocre, and if you do not like energy drinks, this one might even be for you. It is apple juice, with energy! After a closer look at the ingredients i found out there is nearly none of the good stuff in it (just one third of the \"normal\" caffeine inside, no taurine, no other vitamins...)",
        "paid": 0.89,
        "rating": 6.6,
        "taste": "Ok, this will be one of my greatest challenges... Mad Bat BIO Energy, the revenge of Mad Bat. Well, it smells like apple, not nearly as bad as mad bat. Ok... the first sip is not too bad i must say. Mad Bad BIO tastes like apple concentrate. Just pretty sweet apple juice. There is no real typical energy drink taste, not even the typical mad bat taste. I cannot really hate this drink, even though it IS  mad bat and is still. If i would not know it better it would say it is cheap discounter apple juice.",
        "tribute": "",
        "url": "www.madbat.net",
        "volume": 250.0
    },
    "mad_bat_shot": {
        "CO2": false,
        "Nutritions": {
            "biotin": 0,
            "caffein": 133.0,
            "calcium": 0,
            "coenzym Q1": 0,
            "energy": 54.0,
            "glucuronolacton": 0,
            "guarana": 0,
            "inositol": 0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 27.0,
            "others": 0,
            "panthenol acid": 10.0,
            "sodium": 0.1,
            "sugar": 10.8,
            "taurine": 1667.0,
            "vitamin B1": 0,
            "vitamin B12": 4.2,
            "vitamin B2": 0,
            "vitamin B6": 2.3,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "Drogerie Budni Hamburg",
        "look": "Mad bat shot comes in a silver and metallic red 60ml shot bottle with a red cap. In the front there is the mad bat logo so you can prepare yourself for what is to come. You probably even find a way to reuse the bottle for other fluids or spices or something, that is pretty neat.The drink itself kinda looks like pee or apple juice. I would compare it to the first one. ",
        "name": "mad bat Energy Shot",
        "overall": "OK, according to my experiences with the original mad bat energy drink, this one cannot be much worse.... or can it? I mean this is an energy shot and that is something i normally do not like too much. At least it is finished quickly because of the small size. Oh man, after drinking this i do not really feel energized, more like all my power rushed out of me, i got head ache from the taste. This sure as hell cannot be good for you. You can probably compare it with other energy drinks from china, the ones without CO2 but the consistency really killed me. Again, have they ever even tested what they have brewed together? Seriously mad bat team... A pro is, that it got all the ingredients for a balanced breakfast, even though it is not overly much inside. I was hoping for a pretty decent mat bat drink like the mad bat bio energy drink but i kinda expected it to as bad as the original. It is not THE worst drink but it is really really bad.",
        "paid": 0.99,
        "rating": 1.5,
        "taste": "Let's get on with it. I dare you, I double dare you mad bat, do not kill my taste buds again! Well, it does not smell too promising somewhat like plastic turned into an energy drink... It is a shot so i better drink it up in one rush. Mh i am kinda scared by that one. Oh my god... wtf... who would really want to drink that??? My eyes, i cannot see shit.. WHYYYY???? I remember the taste of mad bat, everything comes back. All the bad memories... Mad bat shot has a very similar taste besides it does not taste THAT much like plastic. It is also incredibly mind crubling sweet. Even worse is the drink is not really fluid but kinda like syrup or honey you are trying to swallow down. Holy shit man, i hope i do not have to drink this stuff ever again.",
        "tribute": "Thanks you Melissa for buying this shot for me in Hamburg.",
        "url": "www.madbat.net",
        "volume": 60.0
    },
    "magic_man": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 32.0,
            "calcium": 0,
            "coenzym Q10": 0,
            "energy": 47.3,
            "guarana": 0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 6.0,
            "others": "folacin(66.6ug)",
            "panthenol acid": 2.0,
            "sodium": 0.005,
            "sugar": 11.1,
            "taurine": 30.0,
            "vitamin B1": 0,
            "vitamin B12": 0,
            "vitamin B2": 0,
            "vitamin B6": 0.666,
            "vitamin C": 20,
            "whey": 0
        },
        "bought from": "Rewe Stuttgart",
        "look": "It is a see-through plastic bottle with a silver/purple label and the Magic Man logo. The \"Magic Man\" is the drawing of men by Leonardo Da Vinci. It actually looks pretty cheap.",
        "name": "Magic Man Energydrink",
        "overall": "I bought this the first time because it was really cheap. Well, bad luck with that one. It tastes really bad. If you drink it anyway, don't say i haven't warened you!",
        "paid": 0.49,
        "rating": 4.1,
        "taste": "It tastes incredibly sweet and has a very strong berry taste. It tastes somewhat different from the ordinary gummy taste. This tastes worse than most of the cheap energy drinks. It is drinkable when cold, don't drink it warm!",
        "url": "GEDIMA Erfrischungsgetraenke GmbH, D-41836 Hueckelhoven",
        "volume": 500.0
    },
    "mask_energy": {
        "CO2": true,
        "Nutritions": {
            "caffein": 0,
            "calcium": 0,
            "coenzym Q1": 0,
            "energy": 45.0,
            "glucuronolacton": 0,
            "guarana": 0,
            "inositol": 20.0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 8.0,
            "others": "biotin(4mg)",
            "panthenol acid": 2.0,
            "sodium": 0.0,
            "sugar": 11.3,
            "taurine": 400.0,
            "vitamin B1": 0,
            "vitamin B12": 2.0,
            "vitamin B2": 0,
            "vitamin B6": 2.0,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "Yorma's Stuttgart Hauptbahnhof",
        "look": "When the drink itself tastes so standard the only thing which may stand out is the can or bottle it comes in. Mask Wanted comes in a blue can with a stylized bandits mask at the front. The opener itself is red, which you do not see often these days. It got a label \"made in Austria\" which means it one of the better energy drinks, i guess?\nAll in all the can looks neat but is nothing out of ordinary, also pretty generic.",
        "name": "Mask Wanted Energydrink",
        "overall": "Well, one of THESE drinks, there are no real cons with that one. Taste is ok, can looks ok, this surely is nothing really special.\nIf you need the caffeine and sugar kick, and this drink is cheap where you are you probably cannot do anything wrong when buying this drink when you like the typical energy drink taste. Everyone else who hates the energy drink taste and is looking for some fruity flavor might want to check out Masks Fruity, but i haven't yet tried out that one. The can is pretty small (but normal size for energy drinks) and it might not contain enough caffeine for a very very long night (see 500ml cans like Relentless) if you are already used to consume large amounts of caffeine.\nFor an energy drink this one was not too expensive for buying it at a 24/7 shop. After doing some research i found that you can probably buy this drink in Germany in some EDEKA supermarket (which is a franchise in Germany) for half the price.\nThe drink is good, i can recommend it.",
        "paid": 1.0,
        "rating": 7.5,
        "taste": "It got the smell of the genericore energy drink...And i guess it will taste genericore as well. And yep, totally generic. Of course this is not a bad thing, Mask Energy tastes like every other drink. I really like that it got a high amount of CO2 as well as the acidic taste! I must say i really prefer a standard taste before some fucked up own creation of an energy drink!",
        "tribute": "Tribute goes to Momo who brought me this and the Mask Energy Fruity drink i still have to review. Thanks!",
        "url": "Provisioned: MATADOR GmbH 703472 Stuttgart Germany",
        "volume": 250.0
    },
    "mask_fruit": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 32.0,
            "calcium": 0,
            "coenzym Q1": 0,
            "energy": 49.0,
            "glucuronolacton": 0,
            "guarana": 0,
            "inositol": 10.0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 3.6,
            "others": 0,
            "panthenol acid": 1.2,
            "sodium": 0.02,
            "sugar": 11.7,
            "taurine": 400.0,
            "vitamin B1": 0,
            "vitamin B12": 0.2,
            "vitamin B2": 0,
            "vitamin B6": 0.5,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "Yorma's Stuttgart Hauptbahnhof",
        "look": "Mask fruit comes with the same design as the original Mask drink, only with a yellow background. It looks like a special drink to me, something you probably won't find in your super market around the corner.",
        "name": "Mask Wanted Energy Fruit",
        "overall": "The can itself is cool, the taste is \"meh..\" for me but there might be a lot of people liking this one because of the lack of ordinary energy drink taste (see mask_energy if you are looking for that). If you are looking for a fruity experience, try that one if you got the chance. It contains lots of caffeine, but has below average vitamin contents. The price is pretty good even though the can is quite small. It is pretty uncommon here in Germany even though it is sold in some Edeka Markets and 24/7 shops.",
        "paid": 0.99,
        "rating": 7.5,
        "taste": "It really smells fruity, like Multi Vitamin with lots of mango. I must say i do not really like the taste, it is something weird between mango and orange and some undefined \"fruit\". It tastes really really sweet, even for a fruity drink. It does not contain CO2 for my taste. A pro is that mask fruit does not taste like energy drink in any way, still contains the maximum caffeine allowed here in Germany.",
        "tribute": "Big Thanks goes to Momo at Shackspace , who bought this drink for me.",
        "url": "www.mask-energy.com",
        "volume": 250.0
    },
    "mixxed_up": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 30.0,
            "calcium": 0,
            "coenzym Q10": 0,
            "energy": 45.0,
            "guarana": 0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 7.92,
            "others": "",
            "panthenol acid": 1.98,
            "sodium": 0.1,
            "sugar": 10.4,
            "taurine": 380.0,
            "vitamin B1": 0,
            "vitamin B12": 2.0,
            "vitamin B2": 0,
            "vitamin B6": 2.0,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "Lidl Stuttgart",
        "look": "It comes in a light-brown see-through bottle. The bottle has a green label with a light-green X at the front.",
        "name": "mixxed up energy drink",
        "overall": "The drink is downright average. The price is cheap here in germany, the bottle is small and the taste is somewhat average. There really are better ones out there but if you got no alternatives try it.",
        "paid": 0.35,
        "rating": 6.6,
        "taste": "Mixxed up tastes like some ordinary energy drink. It is really sweet, got the ordinary gummy bear taste. But that is not necessarily a bad thing. ",
        "url": "Mitteldeutsche Erfrischungsgetraenke GmbH & Co. KG Langendorfer Strasse 23 D-06667 Weissenfels, www.lidl.de",
        "volume": 330.0
    },
    "mixxed_up_light": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 30.0,
            "calcium": 0,
            "coenzym Q10": 0,
            "energy": 4.0,
            "guarana": 0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 7.92,
            "others": "",
            "panthenol acid": 1.98,
            "sodium": 0.1,
            "sugar": 0.1,
            "taurine": 400.0,
            "vitamin B1": 0,
            "vitamin B12": 2.0,
            "vitamin B2": 0,
            "vitamin B6": 2.0,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "Lidl Hamburg",
        "date": "2011-01-13",
        "look": "It comes, just like the original in a small ockre colored bottle, just instead of the label being green, this one is blue (probably to strenghen it's lightness\". Everything else is quite the same.",
        "name": "miXXed up light",
        "overall": "This is not a bad drink. Even though it does not contain any real sugar the taste is quite similar to the no-light variant. I must say at the time of this review i just caught a cold and therfore my taste sense might be somewhat unreliable. I will drink this energy drink in the near future again and if i am wrong now with my review i will re-review this one. Also, this drink is acutally quite cheap to buy here. Mixxed up is pretty nice to put in your bag for a quick energy infusion (even if you have to watch for your waistline, girls).",
        "paid": 0.35,
        "rating": 7.1,
        "taste": "Ok before i drink it, i guess it will taste like miXXed up just bad. Most \"light\" drinks suck compared to their sugary counter parts. Ok it smells just like the original ... and pretty much tastes like the original as well. The sweetness is a tiny bit different , more like this replacement sugar stuff but this taste is actually not too strong. It is actually quite drinkable.",
        "tribute": "Thanks you Melissa for pointing me to this drink as it was off the shelfs for quite some time and came back just now.",
        "url": "Mitteldeutsche Erfrischungsgetraenke GmbH & Co. KG Langendorfer Strasse 23 D-06667 Weissenfels, www.lidl.de",
        "volume": 330.0
    },
    "monster_assault": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 30,
            "calcium": 0,
            "coenzym Q10": 0,
            "energy": 48,
            "guarana": 0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 0,
            "others": "Ginseng (80mg),L-Carnitina(40mg)",
            "panthenol acid": 0,
            "sodium": 0,
            "sugar": 11.3,
            "taurine": 400,
            "vitamin B1": 0,
            "vitamin B12": 2.5,
            "vitamin B2": 0.7,
            "vitamin B6": 0.84,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "",
        "date": "2011-01-26",
        "look": "Quote: 'We put the \"camo\" pattern on our new Monster Assault because we think it looks cool.Plus it helps fire us up to fight the big multi-national companies who dominate the beverage business.'. The drink has a grey and black camo pattern and a red M aka. the Monster Logo in front of the can. \"Assault\" is written in army type face.",
        "name": "Monster Assault Energy",
        "overall": "Monster Assault is a pretty neat drink which does not really suck as bad as all the other Monster drinks i drank until today. The cherry taste is somewhat different towards all the ordinary energy drinks. It sure is special, in taste AND look. Check it out",
        "paid": 2.99,
        "rating": 8.2,
        "taste": "This time it is Monster Assault, i really hope it does not want to assault my mouth with bad taste. Actually i do not really have high hopes for this one as Monster Ripper failed horribly. Ok it smells a bit like cherry ... Well i must say Monster Assault tastes like Cherry Coke for some matter. Actually the taste is not that bad, which is surprising for that matter. Most \"fruity\" energy drinks suck big times but this one is pretty neat. The cherry taste is a bit too sweet for my taste but not too dominant. It got this weird Ginseng after taste like all Monster Energy Drinks, but it is not too strong. I guess the coke taste comes from the phosphor acid inside.",
        "tribute": "Thanks goes to Christopher Gregorian who bought me this drink as my christmas gift.",
        "url": "www.monsterenergy.com",
        "volume": 500.0
    },
    "monster_energy": {
        "CO2": true,
        "Nutritions": {
            "caffein": 30,
            "energy": 48,
            "niacin": 8.54,
            "others": "Ginseng (80mg),L-Carnitina(40mg)",
            "sodium": 0.08,
            "sugar": 12,
            "taurine": 400,
            "vitamin B12": 2.5,
            "vitamin B2": 0.74,
            "vitamin B6": 0.84
        },
        "also from": [
            {
                "shop": "Edeka Supercenter Stuttgart Zuffenhausen"
            }
        ],
        "bought from": "Supermarked PAM, Milano, Viale Olona. ",
        "last_reviewed": "17.12.2010",
        "look": "black can, green M. One of the more common energy drinks",
        "name": "Monster Energy",
        "overall": "drank this before in the US. enough for a long night.  Must drink chilled, otherwise it will taste really bad. UPDATE: I must say it does not taste too got even when it is cold.. After this Re-Review i must cut down the score by 0.8 (why you might ask 0.8? well i dunno really, i guess a bit arbitrariness cannot be wrong).",
        "paid": 1.69,
        "rating": 4.7,
        "taste": "Its somewhat tastes like soap and flowers when warm.Besides that the drink really sweet (haven't drunk it chilled though).There is  not enough CO2 in it, which makes the drink not sour at all. When cold it tastes much better, more like lychie and not as sweet. Not the typical gummy bear taste... UPDATE: Today(17.12.2010) i tried the drink again and i must say, it still sucks. It still got this soapy after taste and is far too sweet.",
        "url": "www.monsterenergy.com",
        "volume": 500
    },
    "monster_ripper": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 30.0,
            "calcium": 0,
            "coenzym Q10": 0,
            "energy": 47.0,
            "guarana": 2.0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 8.5,
            "others": "L-Carnitin-l-Tartrat(4mg)",
            "panthenol acid": 0,
            "sodium": 0.009,
            "sugar": 10.0,
            "taurine": 400.0,
            "vitamin B1": 0,
            "vitamin B12": 2.5,
            "vitamin B2": 0.7,
            "vitamin B6": 0.8,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "Edeka Center Stuttgart Zuffenhausen",
        "look": "It comes in a black/grey can with a yellow M like the whole Monster series. The slogan is Energy+Saft.",
        "name": "Monster Ripper Energy+Saft",
        "overall": "This drink is a real disappointment for me. I hoped for something which really tastes like juice and energy but this stuff is just sweet as hell. I sure as hell can NOT recommend this stuff. Go buy something which tastes better AND is cheaper than this from your local discounter.",
        "paid": 1.79,
        "rating": 3.2,
        "taste": "The first taste is like WTF? The second taste is BAAAAWWWHHH! I guess the taste should be something like pineapple but the after taste is incredibly intense. I cannot really describe what it tastes like, but it does NOT taste good. It is so sweet my jaw almost fell off. I hoped for something which reall",
        "url": "www.monsterenergy.com",
        "volume": 500
    },
    "naturell_energy_citrus": {
        "CO2": true,
        "Nutritions": {
            "caffein": 32,
            "energy": 45.9,
            "others": "Guarana extract",
            "sodium": 0.01,
            "sugar": 11.1,
            "taurine": 0
        },
        "bought from": "Kaufland Berlin Schoeneweide",
        "look": "It is an all white can with green an silver pattern.This actually looks pretty cool. It looks kinda expensive to me.",
        "name": "Naturell energy Citrus",
        "overall": "This stuff is really great for the price. Even though it does not have taurine in it, it gives you enough energy to move on on a lazy saturday. And for the price you at least have to try it once!",
        "paid": 0.39,
        "rating": 8,
        "taste": "It tasts somewhat like citrus juice with lots of sugar.  Actually this is really good and tasts well. For me it killed my thirst ( which is something special with energy drinks). Does not have this gummy bear taste or at least not really intense.",
        "url": "Taisentaler Getraenke GMBH",
        "volume": 330
    },
    "naturell_energy_red_berry": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 32.0,
            "calcium": 0,
            "coenzym Q1": 0,
            "energy": 45.2,
            "glucuronolacton": 0,
            "guarana": 0,
            "inositol": 0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 0,
            "others": 0,
            "panthenol acid": 0,
            "sodium": 0.01,
            "sugar": 11.0,
            "taurine": 0,
            "vitamin B1": 0,
            "vitamin B12": 0,
            "vitamin B2": 0,
            "vitamin B6": 0,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "Kaufland Bremen",
        "look": "Naturell Energy Red Berry comes in a red (surprise!) can with white and silver text. In addition to that the can has a darker, shining red relief to make it look \"cool\" and girls will buy it more often (my guess :P). The drink itself is light-red to pink color. It looks rather expensive, even though it isn't.",
        "name": "Naturell Energy Red Berry Acai",
        "overall": "As i stated before i had high hopes for this one and even though the drink is not too good in taste i like the drink as a whole. It looks rather nice and it is really cheap compared to other energy drinks. It does not contain any additional vitamins or taurine but 32mg pure caffeine and this is what you want! Check it out if you see it for the same price as i got it.",
        "paid": 0.39,
        "rating": 7.4,
        "taste": "I have high hopes in this one, as the citrus energy drink of naturell was actually pretty good. Like always you will need luck and hope they didn't fucked that one up. It smells kinda like the Relentless Berry Energy drink (tbd), very fruity, like strawberry. The smell is not too bad. Oh man, this drink has really really sour after taste. At the beginning it is kinda sweet, somewhat like an undefined red berry (not only strawberry). The CO2 is not too predominant, it creates very small bubbles not stressing your taste buds too much. This drink does not really taste like an ordinary energy drink, more like berry spritzer or flavoured water. It is not really my taste but i am sure some will like it.",
        "tribute": "Thanks to Melissa for buying this drink in Bremen!",
        "url": "Traisentaler Getraenke GmbH & Co. A-3105 Unterradlberg",
        "volume": 330.0
    },
    "nos": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 54.0,
            "calcium": 0,
            "coenzym Q10": 0,
            "energy": 45.8,
            "guarana": 0,
            "inositol": 41,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 0,
            "others": "ginseng (20.8mg), L-Carnitine (83.3mg)",
            "panthenol acid": 0,
            "sodium": 0.054,
            "sugar": 10.8,
            "taurine": 422.0,
            "vitamin B1": 0,
            "vitamin B12": 2.5,
            "vitamin B2": 0,
            "vitamin B6": 83.0,
            "vitamin C": 25.0,
            "whey": 0
        },
        "bought from": "Safeways SF U.S.A.",
        "date": "2010-12-05",
        "look": "It comes in a blue can with the white NOS logo at the front. I do not know it exactly, but the can seems awfully similar to the \"Monster\" and \"Rockstar\" drinks. II once drank this drink in U.S. which came in a silver plastic bottle which actually looks like a NOS bottle, i will provide a picture of it.",
        "name": "NOS",
        "overall": "Because it is so similar to the monster ripper drink (besides tasting like shit) i would guess it comes from the same factory. It is not my favorite drink, but is not too bad. Because it does not have this typical gummy taste it surely is a good alternative energy provider. They added a huge amount of caffeine inside the drink, which makes it even greater. ",
        "paid": 2.0,
        "rating": 7.7,
        "taste": "Ihe taste is similar to the Monster Ripper drink only not that disgusting. The taste is something between artificial pineapple and artifical grapefruit. It does not have the disgusting after taste like monster ripper. It surely does not taste like every ordinary energy drink. It really is not too bad.",
        "tribute": "A huge thanks goes to Moritz Bauer who brought this drink to Germany and sponsored me this can.",
        "url": "www.drinknos.com",
        "volume": 473.0
    },
    "onlimit": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 30.0,
            "calcium": 0,
            "coenzym Q10": 0,
            "energy": 44.0,
            "guarana": 0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 8.0,
            "others": "",
            "panthenol acid": 2.0,
            "sodium": 0.1,
            "sugar": 10.6,
            "taurine": 400.0,
            "vitamin B1": 0,
            "vitamin B12": 2.0,
            "vitamin B2": 0,
            "vitamin B6": 2.0,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "Spain",
        "date": "2011-02-01",
        "look": "The drink comes in a pretty cool looking silver/black can with the beasty typing 'onLimit' text in the front. It actually looks pretty neat i must say.",
        "name": "tonight onLimit",
        "overall": "I must say this drink really put me onLimit. This drink really really hurts bad. And i mean BAD. This weird chewing gum after taste is just so ... wrong... WProducers, have you ever tasted this drink??",
        "paid": 0.39,
        "rating": 2.3,
        "taste": "onLimit smells like your ordinary energy drink. Oh my god, i think this drink wants to kill me with it's taste... At first you do not think anything bad but then the taste hits your taste buds so hard you think your mouth is going to explode... My friend tried to scrape off its tongue after drinking it. The sour/weird taste impacts far behind in your mouth. The taste is somewhat plastic and alcoholic... seriously, what the fuck?",
        "tribute": "Thank you to Carolin who bought this drink on her vacations.",
        "url": "",
        "volume": 250.0
    },
    "p6_energy": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 30.0,
            "calcium": 0,
            "coenzym Q10": 0,
            "energy": 50.0,
            "guarana": 0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 7.9,
            "others": "",
            "panthenol acid": 2.0,
            "sodium": 0.068,
            "sugar": 11.1,
            "taurine": 400.0,
            "vitamin B1": 0,
            "vitamin B12": 2.0,
            "vitamin B2": 0,
            "vitamin B6": 2.0,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "Internet trade shop importladen.de",
        "date": "2011-01-18",
        "look": "P6 comes in a black can with silver and orange zigzags. A huge p6 is at the front, along with the orange 'energy' text underneath. And that's about it.",
        "name": "P6 Energy",
        "overall": "I must say, it was not 'really' bad, just weird in some way. P6 i guess should taste 'fruity' but, well not really. I cannot say i like it, but i sure as hell drank much worse drinks. It is not as bad as monster ripper at least.",
        "paid": 1.49,
        "rating": 4.4,
        "taste": "Goddamn, it smells like Monster Ripper. Let's hope it does not taste like it... It is just incredibly sweet, with far too less CO2. The after taste is really sour, somewhat like citrus (i guess?). I guess there should be a fruit taste somewhere, but it is not working for me.",
        "tribute": "Thanks goes to Christopher (Wooki)!",
        "url": "www.p6-energy.de",
        "volume": 250.0
    },
    "polos_power_lader": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 31.5,
            "calcium": 0,
            "coenzym Q1": 0,
            "energy": 48.0,
            "glucuronolacton": 0,
            "guarana": 0,
            "inositol": 0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 7.92,
            "others": 0,
            "panthenol acid": 1.98,
            "sodium": 0.1,
            "sugar": 11.0,
            "taurine": 380.0,
            "vitamin B1": 0,
            "vitamin B12": 2.0,
            "vitamin B2": 0,
            "vitamin B6": 2.0,
            "vitamin C": 0,
            "whey": 50.0
        },
        "bought from": "Polo Biker Shop Stuttgart",
        "look": "It is red bull for bikers. That's about it. At the front there is a Biker skull with a wrench instead of a second bone. The first bone has the polo logo on it. This drink is all product placement, pretty similar to the Jack Jones energy drink. The can is not printed but only has a plastic foil on top of the silver can which feels pretty cheap.",
        "name": "POLOs Power Lader Energy Drink",
        "overall": "The drink is not inherently bad but also not a good or even above-average energy drink. Polos Energy Drink is a 50 percent whey drink to make it no-desposit. I tried quite a lot whey drinks but no ordinary drink really convinced me to like these kind of drinks (besides a fruity whey drink like powerpoint juice). This drink is surely not a \"must drink\" as it is pretty expensive for its taste and ingredients, nothing special here. At least they haven't replaced the sugar...",
        "paid": 0.99,
        "rating": 5.9,
        "taste": "Smells like Energy Drink,i guess? It is a bit sweeter than the energy drink baseline, contains not that much CO2. Polos Energy drink is not that sour. It is at least as sweet as Red Bull Energy but contains 50 percent whey. When you drink it all the way to the bottom it gets really really sour for some reason. It does not really make the drink better...",
        "tribute": "Thanks goes to Christopher who bought this drink on a shopping tour through the polo biker shop.",
        "url": "http://www.polo-motorrad.de",
        "volume": 250.0
    },
    "power_horse": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 32.0,
            "calcium": 0,
            "coenzym Q1": 0,
            "energy": 48.0,
            "glucuronolacton": 200.0,
            "guarana": 0,
            "inositol": 12.0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 8.0,
            "others": 0,
            "panthenol acid": 2.0,
            "sodium": 0.06,
            "sugar": 11.0,
            "taurine": 400.0,
            "vitamin B1": 0,
            "vitamin B12": 2.0,
            "vitamin B2": 0,
            "vitamin B6": 2.0,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "Kaufland Stuttgart West",
        "look": "The can itself is silver with red and black imprint. The logo is a black horse(surprise!) standing on it's two rear hooves. The form factor is quite unusual for energy drinks and looks more like a beer can than an energy drink one. Even though the can looks pretty small it also contains 250ml, like most energy drinks.",
        "name": "Power Horse Energy Drink",
        "overall": "After doing some research (aka. googling power horse and taking the the third hit to wikipedia), i found out that the S. Spitz Company pioneered energy drinks in europe with Power Horse. This means i drink a tiny bit of Energy Drink history, which suddenly make the drink more delicious. The taste is ok, pretty similar to most drinks, but nothing special. A Power Horse reseller is even claiming the URL \"www.energydrinks.de\"",
        "paid": 0.99,
        "rating": 7.7,
        "taste": "Power Horse smells like chewing gum and tastes like sour gummy bears. I really cannot tell a difference between this drink and pretty much every other 'normal' energy drink. Anyway this is not necessary a bad thing. It is nothing special though.",
        "tribute": "",
        "url": "www.power-horse.com",
        "volume": 250.0
    },
    "power_point_juicy": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 32.0,
            "calcium": 0,
            "coenzym Q10": 0,
            "energy": 41.0,
            "guarana": 0,
            "inositol": 10,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 3.6,
            "others": "Guaranaextract",
            "panthenol acid": 1.2,
            "sodium": 0.1,
            "sugar": 9.5,
            "taurine": 400.0,
            "vitamin B1": 0,
            "vitamin B12": 0.2,
            "vitamin B2": 0,
            "vitamin B6": 0.4,
            "vitamin C": 0,
            "whey": 51.0
        },
        "bought from": "Edeka Supercenter Stuttgart Zuffenhausen",
        "look": "It is an orange and black can with the powerpoint logo at the front. It looks kinda stylish.",
        "name": "powerpoint euphoric energy Juicy",
        "overall": "This is some great energy drink with 25 percent fruit content. I really like the taste and the price is really ok, too. Overall a great juicy energy drink without can desposit here in Germany. I really can recommend it.",
        "paid": 0.69,
        "rating": 9.4,
        "taste": "It somewhat does not taste any like an ordinary energy drink, more like a multi vitamin drink with CO2. It is a bit sour, but very juicy. I really like the taste.",
        "url": "www.powerpoint-energy.de",
        "volume": 250.0
    },
    "power_up": {
        "CO2": true,
        "Nutritions": {
            "caffein": 30,
            "energy": 47,
            "niacin": 8,
            "others": "",
            "panthenol acid": 2,
            "sodium": 0.1,
            "sugar": 10.8,
            "taurine": 380,
            "vitamin B12": 2,
            "vitamin B6": 2
        },
        "bought from": "Real Berlin Neukölln",
        "look": "A silver can with the Power up logo on it.Really looks somewhat cheap. Re-Review: The can is Silver with blue and red labels. There is a stick-figure weigh lifter at the front next to the Power Up logo which is blue with white Text and in the background a dark blue star and the rutherford model symbol(⚛). In the bottom left corner there are two screw labels on the can. The designer probably though \"What looks cool and strong?\" and that is the outcome. And yeah, it still looks pretty cheap to me.",
        "name": "Power Up Energy Drink",
        "overall": "A Cheap, mediocre tasting drink.Re-Rewiev: It has been quite some time since i reviewed 'Power Up EXTRA STRONG ENERGY DRINK' (i really do not know what the designers of energy drinks have with all caps descriptions...). I am doing the review again because the old one is kind of bland and inexpressive. After retrying Power Up i think the rating i gave for power up was not wrong, probably a bit too low. I can recommend this drink if you want a quick and kind of inexpensive refreshment.",
        "paid": 0.49,
        "rating": 7.1,
        "taste": "It tastes really sweet with a very strong gummy taste. It surely is not the best E-drink i drank until now. Re-Review: Well i must say it still is really sweet, but actually it does not taste too bad. Power Up does not have a strong after taste (but still has the typical gummy bear taste), but quite a lot of CO2. I am drinking this one ice cold and i am pretty sure it is not great a bit warmer but that is fine for me. You can compare it to a 'not that good' version of Lions Energizer. ",
        "url": "SIG-Import GmbH",
        "volume": 250
    },
    "power_xxl": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 32.0,
            "calcium": 0,
            "coenzym Q1": 0,
            "energy": 47.0,
            "glucuronolacton": 0,
            "guarana": 0,
            "inositol": 0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 5.4,
            "others": 0,
            "panthenol acid": 1.8,
            "sodium": 0,
            "sugar": 11.3,
            "taurine": 30.0,
            "vitamin B1": 0,
            "vitamin B12": 0,
            "vitamin B2": 0.48,
            "vitamin B6": 0.6,
            "vitamin C": 18.0,
            "whey": 0
        },
        "bought from": "Edeka aktiv markt",
        "look": "The can of Power XXL looks reeeeally cheap. The logo is the \"POWER XXL\" text together with a pair of eyes staring at you pretty similar to the Jimmy Wales' Wikipedia campaign. Additionally all the \"cool\" slogans are on it  like \"TASTE THE BIG POWER\" and \"look into my eyes!\".This is really cheesy.",
        "name": "Power XXL Energy Drink",
        "overall": "POWER XLL taste pretty ok, the look is really stupid. The price is too expensive for an average 250ml energy drink.It also only contains a thenth (30mg) of taurine compared to other energy drinks. This drink is not \"great\" but also does not really disappoints.",
        "paid": 0.99,
        "rating": 6.3,
        "taste": "Power XXL smells pretty genericore but the first sip is... kinda different. It is pretty sour but also really sweet. It seems like the taste changes over the time of drinking. Of course it has the typical gummy bear taste and all but it got different nuances in the sweet and sour level. With enough CO2 i can honestly say that this drink does not disappoints.",
        "tribute": "",
        "url": "www.power-xxl.com",
        "volume": 250.0
    },
    "pure_cofain": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 69.9,
            "calcium": 0,
            "coenzym Q1": 0,
            "energy": 59.0,
            "glucuronolacton": 0,
            "guarana": 0,
            "inositol": 0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 0,
            "others": 0,
            "panthenol acid": 0,
            "sodium": 0,
            "sugar": 14.5,
            "taurine": 0,
            "vitamin B1": 0,
            "vitamin B12": 0,
            "vitamin B2": 0,
            "vitamin B6": 0,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "Edeka aktiv markt Grindelallee ",
        "look": "The can does not look that exciting. The drink comes in a all black can with the \"Pure Cofain\" logo at the front. Under that the number 699 (mg per 1000ml caffeine) is printed on. Under that number there is a warning label that this drink contains \"GRACIOUS AMOUNTS OF ENERGY\". At the back there is another warning label that this drink can create all kinds of side effects, pretty similar to real pharmaceuticals.",
        "name": "Pure Cofain 699",
        "overall": "This is pure cofain, the first energy drink i found here which has coffain contents far above the given limit of 32mg per 100ml here in Germany. The drink itself contains a massive 69.9mg caffeine per 100ml, no other added vitamins or taurine though. It has a warning banner similar to cigarrettes. It is produced in Austria and the warning banner at the back recommends one can per day as a maximum value. The can is pretty expensive, but hell, the taste is really unique and i think it would even make a good attached gift for a friend. If you ever get the chance, try it for yourself.",
        "paid": 1.69,
        "rating": 8.1,
        "taste": "I must say it smells like coffee, pretty neat i must say. Oh my god, this is so bitter. Totally like cold coffee with CO2. This can contains some weird shit. The first sip is really really weird but after that you get used to it and is a really unique drink. This one surely does not have the typical energy drink taste. If you want the coffee taste one might really want to drink this one. The after taste is like coffee and coke mixed together. Be sure to check this one out if you get the chance.",
        "tribute": "",
        "url": "www.cofain.at",
        "volume": 250.0
    },
    "quick_energy": {
        "CO2": false,
        "Nutritions": {
            "biotin": 0,
            "caffein": 297.0,
            "calcium": 0,
            "coenzym Q1": 0,
            "energy": 8.4,
            "glucuronolacton": 0,
            "guarana": 0,
            "inositol": 0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 33.6,
            "others": 0,
            "panthenol acid": 0,
            "sodium": 0.0,
            "sugar": 0.0,
            "taurine": 0,
            "vitamin B1": 0,
            "vitamin B12": 4.2,
            "vitamin B2": 0,
            "vitamin B6": 8.4,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "Rossmann Hamburg Hauptbahnhof",
        "look": "Quick energy comes in a small plastic bottle with an orange plastic label wrapped all over it. If you want to drink it you have to peel off the complete label (or at least i had to) in order to open the bottle. The cap is resealable which does not really make sense for me to reseal an energy shot... The fluid itself is translucent. I must say the packaging looks rather nice but it has to in order to lure you into buying this stuff once. ",
        "name": "Quick energy",
        "overall": "Good thing is it comes only in such a small bottle but because the bottle neck is so thin you have to take multiple gulps to finish it. After this drink the head ache kicked in immediately. As they state on the bottle there is no crash, but a downer from the beginning. Holy crap, again i am asking me if they actually tasted their drink before selling it. But i guess not. Quick energy is from the USA ... and i thought they know how to do energy drinks. Well, at least it contains massive amounts of caffeine (175mg per bottle) but still this not worth it.\nThe bottle is sold as nutritional supplement but i cannot think of one time where i would need THAT DRINK as supplement. I would rather eat a lemon as a whole than drinking this stuff.",
        "paid": 1.99,
        "rating": 1.7,
        "taste": "There are not many energy shots which actually taste really good but i have high hopes in this one because the flavour is \"orange\". After opening the drink smells like a decomposed Vitamin pill. Oh my god it tastes to bad..... i cannot really describe it... quick is  like slime crawling down your throat killing everything it the way. It feels somewhat like i am drinking a glass chemicals from a toilet cleaner factory.  I feel like i need to puke... I cannot really drink any further. Ok whatever, Oh god this is so bad, i feel kinda raped now. And the taste does not go away, it stays in your mouth and there is nothing you can do about it. This was probably the worst energy shot i ever drank.",
        "tribute": "",
        "url": "www.quickenergy.com",
        "volume": 59.0
    },
    "quixx": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 0,
            "calcium": 0,
            "coenzym Q1": 0,
            "energy": 47.0,
            "glucuronolacton": 0,
            "guarana": 0,
            "inositol": 20.0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 7.9,
            "others": 0,
            "panthenol acid": 2.0,
            "sodium": 0.08,
            "sugar": 10.8,
            "taurine": 400.0,
            "vitamin B1": 0,
            "vitamin B12": 2.0,
            "vitamin B2": 0,
            "vitamin B6": 2.0,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "Real Bremen",
        "look": "The drink comes in a 0.5l bottle with a black and pink label. The color has the color of urine which is pretty normal for energy drinks. Honestly i have no clue how they came up with this design and the name of this drink. The name probably comes from \"quick\" and ... i have no idea...  I cannot comprehend what these pink triangles on the front of the bottle mean. The bottle itself has a 'vivaris' imprint. ",
        "name": "quixx Energy Drink",
        "overall": "This time it is quixx energy drink. The design of the bottle is really bad imho. As the design of an energy drink is really important for reflex buyers, the producer 'vivaris' should rethink their energy drink as the taste is not too bad. The price is fine, too for a big a big bottle. All in all this is a pretty average energy drink. Be sure to drink it cold, follow the rule number one of energy drink degustation.",
        "paid": 0.79,
        "rating": 6.5,
        "taste": "quixx smells really really sweet and does not have really much CO2 (at least my bottle). Mh... i must say this one is really drinkable, even with very view CO2, i kinda like that. Like most of the drinks it is really sweet but it does not have a strong typical energy drink taste. It is kinda refreshing at first but then quixx becomes icky in your mouth. When swallowing the drink down it gets somewhat sour. When purping the last sour taste comes up again. This drink does not taste too bad i must say.",
        "tribute": "Big thanks goes to Misa who bought this drink in Bremen for me.",
        "url": "www.vivaris.net",
        "volume": 500.0
    },
    "recharge_redberry": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 2.5,
            "calcium": 0,
            "coenzym Q10": 0,
            "energy": 40.0,
            "guarana": 0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 0,
            "others": "",
            "panthenol acid": 0,
            "sodium": 0.32,
            "sugar": 9.5,
            "taurine": 0,
            "vitamin B1": 0,
            "vitamin B12": 0,
            "vitamin B2": 1.7,
            "vitamin B6": 0,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "Indomaret Bali, Indonesia",
        "date": "2011-01-29",
        "look": "Recharge energy comes in a Green to Yellow to Red can with the Green Sands Logo. I must say the drink does not look too bad and promises a \"refreshing\" energy drink.",
        "name": "Recharge energy soda Redberry",
        "overall": "No none would have guessed this drink sucks so bad. I already heard from two people that Green Sands is not best brand for \"good\" drinks. I mean it does not taste like the worst drink (a big pro is that it is not still) but it is just incredibly so so sweet and sticky.",
        "paid": 0.29,
        "rating": 4.0,
        "taste": "Recharge smells like all these red gummy bears. Lets give it a shot... HOLY SHI- IT IS SO SWEET AND STICKY... I cannot really describe this taste but it is definitly NOT GOOD... It really glues your mouth. My face when drinking looks like this D:",
        "tribute": "Thank you Melissa for buying this drink for me from indonesia",
        "url": "PT Multi Bintang Indonesia, Tbk",
        "volume": 250.0
    },
    "red_horse": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 30.0,
            "calcium": 0,
            "coenzym Q10": 0,
            "energy": 48.0,
            "guarana": 0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 8.0,
            "others": "",
            "panthenol acid": 2.0,
            "sodium": 0.03,
            "sugar": 11.3,
            "taurine": 400.0,
            "vitamin B1": 0,
            "vitamin B12": 2.0,
            "vitamin B2": 0,
            "vitamin B6": 2.0,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "Aldi Nord, Hamburg",
        "date": "2011-01-15",
        "look": "It comes in a generic blue bottle with a silver cap and silver label. At the front there is a blue drawn horse together with the big Red Horse writing. The drink looks like the many discounter bottles for non-still drinks. ",
        "name": "Red Horse Energydrink",
        "overall": "This is just another bad discounter energy drink. I do not know why but most of the drinks sold by discounters do not taste \"good\" or \"great\", most of them just plain suck. And so does this drink. Without the bad aftertaste it might be ok, but not this way. Refrain yourself from buying this drink, trust me even though it is pretty cheap!",
        "paid": 0.59,
        "rating": 4.4,
        "taste": "Well, this one smells pretty generic. Oh my god, wtf? Red Horse tastes like... citrus toilet cleaner?! I mean the taste is not really intese,but there is something that tastes just \"wrong\" when drinking this drink. It is pretty hard to describute the taste. The first sip is quite ok, but if you swallow it down this weird after taste kicks in. It does not have enough CO2 to make the drink taste any better. ",
        "tribute": "",
        "url": "Urstromquelle GmbH & Co.KG, 15837 Baruth/Mark",
        "volume": 500.0
    },
    "redbull": {
        "CO2": true,
        "Nutritions": {
            "caffein": 32,
            "energy": 45,
            "niacin": 8,
            "others": "",
            "panthenol acid": 2,
            "sodium": 0,
            "sugar": 11,
            "taurine": 400,
            "vitamin B12": 2,
            "vitamin B6": 2
        },
        "bought from": "Kaufland Berlin Schöneweide",
        "look": "Blue and silver Can with two bulls in the middle fighting against eachother. Most people know it.",
        "name": "Red Bull Energy Drink",
        "overall": "This drink can be concidered THE energydrink period.  You can buy it everywhere, its in the commercials. Anyway this does not mean it tastes incredibly awesome or packs a real punch, but the Public Relation Department did a great job pushing this drink.  For me it surely does not taste like the `best` drink and i think it is really overpriced but you can buy it nearly everywhere. I got mine really cheap from Kaufland as a special offer, otherwise i would not have bought it.It surely defines for most people what a energy drink is, anyway not for me as i can tell from its taste and from drinking quite a few energy drinks in my life. On my quest for drinking all the energy drinks in the world i will try to find which drinks are the same but have a different packaging.Reference will be this drink because i am really sure they sell their stuff under different names.",
        "paid": 1.49,
        "rating": 7.2,
        "taste": "It got that energy-type gummy bear taste, is pretty sweet and comes with quite a lot of CO2. For me it really is too sweet and the gummy taste is too intense. The after-taste is somewhat sour.It tastes ok but it surely is not GREAT.",
        "url": "www.redbull.de",
        "volume": 250
    },
    "relentless": {
        "CO2": true,
        "Nutritions": {
            "caffein": 32,
            "energy": 46,
            "inositol": 10,
            "niacin": 3.6,
            "others": "",
            "panthenol acid": 1.2,
            "sodium": 0.05,
            "sugar": 10.4,
            "taurine": 400,
            "vitamin B12": 0.2,
            "vitamin B6": 0.4
        },
        "bought from": "Kaisers Berlin Gropiuspassagen",
        "look": "The can looks really cool with its black front and its white/bronze text. At the bottom it says KEINE HALBEN SACHEN (\"No halve measures\") but actually is resealable. It is not really simple to drink from this, but the cap holds really tight! ",
        "name": "Relentless Origin",
        "overall": "I must say this is one of my favorite energy drinks.  It tastes not incredibly sweet. Got average taurine and caffein contents and comes in a big bottle. The only downside for me is the resealable cap, which is somewhat hard to drink from and the above average price.",
        "paid": 1.59,
        "rating": 8.5,
        "taste": "The taste is really smooth and not too sweet. It does not taste much like gummy bears, which is, at least for me, a good thing. I really like it. When drinking it you really feal empowered.",
        "url": "www.relentlessenergy.de",
        "volume": 485
    },
    "relentless_juiced": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 32.0,
            "calcium": 0,
            "coenzym Q10": 0,
            "energy": 47.0,
            "guarana": 0,
            "inositol": 10,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 3.2,
            "others": "",
            "panthenol acid": 1.0,
            "sodium": 0.02,
            "sugar": 10.6,
            "taurine": 400.0,
            "vitamin B1": 0,
            "vitamin B12": 0.4,
            "vitamin B2": 0,
            "vitamin B6": 0.2,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "Mueller Stuttgart Stadtmitte",
        "date": "2011-02-27",
        "look": "Relentless Juiced comes in the same oversized can as the original Relentless, but without the resealable top. The can is all red with grapes and \"Stuff\" i cannot really identify. There is a small quote at the back of the can, you can read all the slogans at the wikipedia page to Relentless_(drink).",
        "name": "Relentless Juiced Energy",
        "overall": "In my oppinion, Relentless is a nice brand created by Coca Cola where i actually have the feeling they pre-tasted the drink before selling it to everyone. I do not really understand why the resealable lock is left out for this drink, probably because it does not fit well to the slogan \"no half measures\" (hint) or it does not worked out well.",
        "paid": 1.79,
        "rating": 8.5,
        "taste": "This time it is an Relentless Origin offspring with berry flavour. This one smells really strong like berry syrup, hopefully it is not too sweet... Well it IS too sweet, the taste reminds me of overly sweet strawberry juice. I must say this is quite a novelty, i never drank a strawberry style energy drink. And it does not even suck bad. Relentless Juiced is a bit more sour than what you would expect of juice, this probably comes from the black currant flavor mixed inside. This definitly is one of the better juice drinks.",
        "tribute": "",
        "url": "www.relentlessenergy.com",
        "volume": 500.0
    },
    "relentless_shot": {
        "CO2": false,
        "Nutritions": {
            "biotin": 0,
            "caffein": 160.0,
            "calcium": 0,
            "coenzym Q10": 0,
            "energy": 48.0,
            "guarana": 0,
            "inositol": 12,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 18.0,
            "others": "Glucuronolacton(70mg)",
            "panthenol acid": 6.0,
            "sodium": 0,
            "sugar": 11.0,
            "taurine": 400.0,
            "vitamin B1": 0,
            "vitamin B12": 1.0,
            "vitamin B2": 0,
            "vitamin B6": 2.0,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "Widirent Olgastr.",
        "look": "The Shot comes in a all-black small bottle with a big R on the front. Coca Cola uses their new old-school energy drink brand for this shot.",
        "name": "Relentless Energy Shot",
        "overall": "This is one of those \"shot\" drinks. They probably thought no one will ever drink it for the taste. Well that is at least what i think. As most of the shot drinks, it is pretty expensive for what you get, both the nutritions and the overall volume. It might work for a longer night, but thats about it. Drink some real denergy drink instead of these shots because it tastes much better and kicks in more.",
        "paid": 2.0,
        "rating": 5.0,
        "taste": "It smells like some sweet syrup. The first sip is somewhat sour and becomes sweet after a second. The after taste is somewhat weirdly sour. The drink itself tastes a lot like Blitz Start and it got the same consistency (thick).",
        "tribute": "A big Thanks goes to Phil for donating this energy drink to me and the energy drink database",
        "url": "www.relentlessenergy.de",
        "volume": 50.0
    },
    "rhinos": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 31.5,
            "calcium": 0,
            "coenzym Q10": 0,
            "energy": 48.7,
            "guarana": 0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 7.92,
            "others": "",
            "panthenol acid": 1.9,
            "sodium": 0.1,
            "sugar": 11.3,
            "taurine": 380.0,
            "vitamin B1": 0,
            "vitamin B12": 2.0,
            "vitamin B2": 0,
            "vitamin B6": 2.0,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "Rewe Stuttgart Zuffenhausen",
        "look": "It is a silver and dark green can with an outlined rhinoceros at the front, presumably the logo of this energy drink. The new cans have all kinds of labels and stuff on it. The older cans had no such labels on it and therefore seemed more pure to me.",
        "name": "rhino's energy drink",
        "overall": "When i started with searching for good energy drinks, this was one of the first drinks i really thought of \"Wow, this actually tastes really really good!\". Too bad the price above average and with 4 euro per liter pretty expensive. Still i buy this drink when it comes in the ads with a capaign price of 66 cents per can. One of my favorites still.",
        "paid": 0.99,
        "rating": 8.6,
        "taste": "Rhino's energy drink is really delicious. It is not so sweet and the gummy bear taste is not strong. It got medium CO2 and is very drinkable. I really like it!",
        "url": "www.rhinos-energy.com",
        "volume": 250.0
    },
    "rockstar_apple": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 32.0,
            "calcium": 0,
            "coenzym Q10": 0,
            "energy": 58.0,
            "guarana": 10.0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 3.6,
            "others": "Ginseng(10mg)",
            "panthenol acid": 1.2,
            "sodium": 0.004,
            "sugar": 13.7,
            "taurine": 400.0,
            "vitamin B1": 0,
            "vitamin B12": 0.2,
            "vitamin B2": 0,
            "vitamin B6": 0.4,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "E-Center Stuttgart Zuffenhausen",
        "look": "It comes in a black and green can with the rock\"star\" on the front. The black can looks really cool to me.",
        "name": "Rockstar Punched Energy+Apple",
        "overall": "It is definitly one of the better rockstar drinks. Still it is not really that great. ",
        "paid": 1.79,
        "rating": 6.4,
        "taste": "If you know these sour apple gummies, this is how rockstar apple tastes like! It is bottled gummy. This also means it is incredibly sweet.",
        "url": "www.rockstarenergy.de",
        "volume": 500.0
    },
    "rockstar_energy": {
        "CO2": true,
        "Nutritions": {
            "caffein": 32,
            "coenzym Q10": 0,
            "energy": 60,
            "glucuronolacton": 0,
            "niacin": 3.6,
            "others": "",
            "panthenol acid": 1.2,
            "sodium": 0.054,
            "sugar": 13.1,
            "taurine": 400,
            "vitamin B12": 0,
            "vitamin B6": 0,
            "vitamin C": 0
        },
        "bought from": "Real Berlin Neukölln",
        "look": "Black can with golden star at the front. It actually looks pretty cool.",
        "name": "Rockstar Energy Drink",
        "overall": "This tastes no other than cheap energy drinks, has typical tastes and overall does not taste like anything special. There are better drinks out there. I just saw at the website that they have like a dozen other tastes, so there might be the chance one of them is really good.",
        "paid": 1.79,
        "rating": 7.3,
        "taste": "When taking the first sip it is very sparkling, then becomes a bit sour and starts the taste very sweet. The gummy bear taste starts far behind in the palate. The aftertaste is typically very sweet. ",
        "url": "www.rockstarenergy.com",
        "volume": 500
    },
    "rockstar_guava": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 32.0,
            "calcium": 0,
            "coenzym Q10": 0,
            "energy": 63.0,
            "guarana": 0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 3.6,
            "others": "Ginseng Extract(1g)",
            "panthenol acid": 1.2,
            "sodium": 0.1,
            "sugar": 15.0,
            "taurine": 400.0,
            "vitamin B1": 0,
            "vitamin B12": 0.2,
            "vitamin B2": 0,
            "vitamin B6": 0.4,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "E-Center Stuttgart Zuffenhausen",
        "look": "Like all Rockstar drinks it comes in a half liter can with a big golden star at the front. I really like this style. This can is purple with a golden top. Maybe because it should look somewhat tropical (thats at least what the name suggests).",
        "name": "Rockstar Punched Energy+Guava",
        "overall": "I like it much better than most of the Rockstar Energy Drinks because it is only sweet, not OMGWTF sweet.I can recommend this drink, even though it is not 100 percent my taste. Check it out.",
        "paid": 1.79,
        "rating": 7.6,
        "taste": "The taste is similar to the Monster Ripper, but it is both barely as sweet and disgusting as that drink. It tastes somewhat like pineapple but i am actually not really sure what it \"should\" be. I guess it is guava, but i never actually ate or drank this fruit. The taste is really not too sweet for my taste. I am really sure it is only drinkable when it is cold, otherwise the taste may fall over to MAXIMUM sweetness.",
        "url": "www.rockstarenergy.de",
        "volume": 500.0
    },
    "rockstar_juice": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 32.0,
            "calcium": 0,
            "coenzym Q10": 0,
            "energy": 65.0,
            "guarana": 10.0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 3.6,
            "others": "",
            "panthenol acid": 1.2,
            "sodium": 0.1,
            "sugar": 15.4,
            "taurine": 400.0,
            "vitamin B1": 0,
            "vitamin B12": 0.2,
            "vitamin B2": 0,
            "vitamin B6": 0.4,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "E-Center Stuttgart Zuffenhausen",
        "look": "This time it is an orange can with a golden star at the front. I guess they wanted to make it look extra juicy by taking bright colors. The front says it got the taste \"mango, orange, passion fruit\" but in the ingredients 9.4 percent out of the 10 percent juice is from apple and nowhere passion fruit is mentioned... ",
        "name": "Rockstar Juiced Energy+Juice",
        "overall": "This drink falls under the category \"FOR SCIENCE\" with it's taste. It really is ok for a juice drink and it got enough caffein to keep you awake. It really is worth a try.",
        "paid": 1.79,
        "rating": 7.0,
        "taste": "It really is incredible what the producer of those drinks can do with 9.4 percent of apple concentrate and some \"flavor\". Only the aftertaste is somewhat apple'y but at first it really tastes like orange and a little bit mango. Well, it is more like when you never ate orange and mango, how you THINK it might taste like. Because i never  ever tried passion fruit before, i cannot tell if it got any passion fruit flavor at all.Anyway this one is not too bad, i mean, it is sweet as shit, but just a bit sweeter than most energy drinks.",
        "url": "www.rockstarenergy.de",
        "volume": 500.0
    },
    "rockstar_recovery": {
        "CO2": false,
        "Nutritions": {
            "biotin": 0,
            "caffein": 32.0,
            "calcium": 120.0,
            "coenzym Q1": 0,
            "energy": 52.0,
            "glucuronolacton": 0,
            "guarana": 0,
            "inositol": 0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 3.2,
            "others": 0,
            "panthenol acid": 0,
            "sodium": 0.02,
            "sugar": 12.1,
            "taurine": 40.0,
            "vitamin B1": 0,
            "vitamin B12": 0.5,
            "vitamin B2": 0,
            "vitamin B6": 0.28,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "Edeka Berlin Alexanderplatz(Alexa)",
        "look": "Rockstar Recovery comes in a Yellow and black can with a red can opener. Of course it has the same style as all the other Rockstar drinks wit the big star at the front of the can and a red plus sign to advertise their 'high' amounts of caffeine and electrolytes.\nThe fluid itself does not look similar to piss(like most of the energy drinks) but more like a milky fluid. It is probably because of all the electrolytes in this drink. It can best be compared to a vitamin pill put into water and waited long enough to be non-carbonated. This is actually stated at the front of the can. It is like nobody likes CO2 anyway and this drink is better because it does not contain any of it.",
        "name": "Rockstar Recovery",
        "overall": "It is Rockstar Lemonade WITHOUT CO2? Wtf seriously, what were they thinking? I think that this drink could be one of the better Rockstar drinks if it was not non-carbonated. The can looks pretty neat and that was because i bought it in first place, of course i haven't paid attention to the \"non-carbonated\" label at the bottom of the can. Rockstar Recovery is a trap, you buy it because it looks nice and you will not pay attention to the important parts (small imprint: NO FRICKIn' CO2 INSIDE). It gets worse and worse the longer i have waited. Well, at least this drink does not have the stated \"ginseng\" taste...",
        "paid": 1.79,
        "rating": 3.6,
        "taste": "It smells like lemonade... nothing special here. Well the taste is like these iso drinks you can buy or like fanta without CO2. When you put it in your mouth it tastes pretty bad and when you swallow it down you think... well that was not too bad. BUT IT WAS. At least it is cold... This stuff ist just really really sweet. The after taste sucks big time and it stays in your mouth for another minute or two. When put into a glass you really can smell the electrolytes and it tastes even worse when drinking out of that glass. When you wait too long you cannot really drink any further, it is just too bad tasting. Rockstar Recovery is really nasty stuff you do not want to drink more than once. Even after drinking the whole bottle i have a sugary film on my lips and in my mouth.",
        "tribute": "",
        "url": "www.rockstarenergydrink.de",
        "volume": 500.0
    },
    "russian_power": {
        "CO2": true,
        "Nutritions": {
            "caffein": 32,
            "energy": 45,
            "niacin": 7.92,
            "others": "",
            "panthenol acid": 1.98,
            "sodium": 0.1,
            "sugar": 11.3,
            "taurine": 380,
            "vitamin B12": 2.0,
            "vitamin B6": 2.0,
            "whey": 51
        },
        "bought from": "Aljonka Russische Spezialitaeten Alexanderplatz",
        "look": "It's a black can with the russian flag and a warrior with a huge sword at the front. It really looks kinda cool, even though i am pretty sure this energy drink is not actually from Russia",
        "name": "Russian Power",
        "overall": "A great energy drink with no can disposit but an average price. I drank this one after the ANGEL Natural stuff and i felt much better afterwards.A small downer only is what i paid for it.",
        "paid": 1.29,
        "rating": 8.5,
        "taste": "This energy drink tasts really good. Its not too sweet, got this characteristic gummy bear taste and well, you really feel empowered! The whey in it does not have any taste, but that is really no problem,at least there is no can disposit for this here in germany.",
        "url": "www.russianpower.org",
        "volume": 250
    },
    "scenatic": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 32.0,
            "calcium": 0,
            "coenzym Q1": 0,
            "energy": 0,
            "glucuronolacton": 0,
            "guarana": 0,
            "inositol": 10.0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 7.92,
            "others": 0,
            "panthenol acid": 1.98,
            "sodium": 0.06,
            "sugar": 10.4,
            "taurine": 380.0,
            "vitamin B1": 0,
            "vitamin B12": 2.0,
            "vitamin B2": 0,
            "vitamin B6": 2.0,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "Edeka Bremen Hauptbahnhof",
        "look": "Scenatic Energy Drink comes in a white/blue can with red lines at the top with \"new recipe\" and at the bottom with \"THE ENERGIZER\". The can itself does not look special, pretty cheap.",
        "name": "Scenatic Energy drink",
        "overall": "Scenatic is a budget drink sold to Discounters in northern Germany.After drinkin this one I must say i feel pretty refreshed. Scenatic energy drink is actually not too bad for the price. It also contains all thte goodness of the expensive counterparts. When i would have the choice between this drink and Red Bull i would definitly buy Scenatic.\n",
        "paid": 0.49,
        "rating": 6.9,
        "taste": "Scenatic smells like an ordinary energy drink, i expect nothing special. Well, what can i say, it tastes... normal ? It is not too sweet but also does not provide any special twists. It is a bit more sour than other drinks, the typical gummy taste is not that strong in this one. The taste is not really bad but also nothing special. I like it.",
        "tribute": "",
        "url": "www.handelsmarken-gmbh.de",
        "volume": 250.0
    },
    "schwarze_dose": {
        "CO2": true,
        "Nutritions": {
            "caffein": 32,
            "energy": 58,
            "guarana": 100,
            "isomaltose": 5,
            "niacin": 7.9,
            "others": "Coenzym Q10(3mg)",
            "panthenol acid": 2,
            "sodium": 0.001,
            "sugar": 14.4,
            "taurine": 0,
            "vitamin B12": 2,
            "vitamin B6": 2,
            "vitamin C": 24
        },
        "bought from": "Real Berlin Neukölln",
        "look": "Black Can with golden phoenix.TODO",
        "name": "Schwarze Dose 28",
        "overall": "TODO",
        "paid": 1.49,
        "rating": 8.0,
        "taste": "Can writing says 'Acai taste'TODO",
        "url": "www.schwarzedose.de",
        "volume": 250
    },
    "sexergy": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 30.0,
            "calcium": 0,
            "coenzym Q10": 0,
            "energy": 47.4,
            "guarana": 0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 3.94,
            "others": "guarana-extract",
            "panthenol acid": 0.99,
            "sodium": 0.02,
            "sugar": 11.1,
            "taurine": 380.0,
            "vitamin B1": 0,
            "vitamin B12": 1.0,
            "vitamin B2": 0,
            "vitamin B6": 1.0,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "Rewe Stuttgart",
        "look": "It is a black can with the silver and red sexergy logo on it. They call it \"premium energy drink\" with cherry taste.",
        "name": "sexergy premium energy drink",
        "overall": "It sure is drinkable but it does not really taste \"premium\". It got a different taste than other drinks but this is not necessarily a good thing. Due to the intense cherry-syrup taste i cannot really enjoy this drink. In my oppinion it is not worth the pretty hefty price tag.",
        "paid": 1.59,
        "rating": 5.6,
        "taste": "It sure does taste like cherry. The taste is similar to the cheap 8 percent cherry drinks you can buy at the Doener Imbiss, just with added CO2. The cherry flavor is extremly dominant and it sure does not taste like an ordinary energy drink.",
        "url": "www.sexergy-energy.com",
        "volume": 250.0
    },
    "she_energy": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 30,
            "calcium": 0,
            "coenzym Q10": 0,
            "energy": 0,
            "guarana": 0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 1.6,
            "others": "",
            "panthenol acid": 0.8,
            "sodium": 0.02,
            "sugar": 0,
            "taurine": 0,
            "vitamin B1": 0,
            "vitamin B12": 0.9,
            "vitamin B2": 0,
            "vitamin B6": 4,
            "vitamin C": 25,
            "whey": 0
        },
        "bought from": "Deka Markt,Zaanse Schaan Netherlands",
        "look": "It comes in a pink can with a she-superman logo (or diamond) with a devils tail. As this is an netherland energy drink, everything text on the can is dutch language, which is a pain in the ass to decypher.",
        "name": "She Super Energy Drink",
        "overall": "I do not know if this really is a womens drink, maybe it tastes better when you are a girl. It tastes ... well different i guess. If you like incredibly sour drinks, this one is for you. If you ever tried center shock and liked it (or you like giving it to other people) this drink is a must. Check it out, it even has no sugar and calories, e.g. you do not get fat.",
        "paid": 0.99,
        "rating": 6.5,
        "taste": "It somewhat smells like synthetic peach at the first smell. When you drink it, the first sip is like... mhh this really smells like peach or something. Then you swallow it down, it tastes like apple or something, THEN it is like a punch in the face by SOUR. If you ever tried Center Shock chewing gum, this is the opposite of them, first somewhat delicious and then incredibly sour(painful). I never thought this is ever possible with an energy drink. Everything inside your mouth feels tingly, probably not made by human.",
        "tribute": "Thank you Melissa for buying me this drink from Holland.",
        "url": "she-energydrink.com",
        "volume": 250
    },
    "steinberg": {
        "CO2": true,
        "Nutritions": {
            "caffein": 32,
            "energy": 48,
            "others": "biotin(30mg)",
            "panthenol acid": 1.2,
            "sodium": 0.04,
            "sugar": 11.0,
            "taurine": 30,
            "vitamin B6": 0.4,
            "whey": 51
        },
        "bought from": "IFA Berlin at UNIMALL promition booth",
        "look": "Black can with some musician or something on it, very graphical",
        "name": "Power by Steinberg and Unimall",
        "overall": "I got this one from the IFA Berlin at the UNIMALL promotion booth, for that i had a small chatter what they do and stuff.In the end i got this delicios energy drink.This is the kind of energy drink i really like to drink. Tastes almost the same as the Russian Power stuff, at least check this stuff out or send unimall.de a mail you want one of these drinks. It was free for me, that definitly is a plus.",
        "paid": 0,
        "rating": 9.1,
        "taste": "I really really like this stuff with whey. It tastes not too soure, average CO2, not too sweet gummy bear taste. I like it",
        "url": "unimall.de(promo),suesswarenversand.de",
        "volume": 250
    },
    "t400_energy": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 30.0,
            "calcium": 0,
            "coenzym Q1": 0,
            "energy": 2.6,
            "glucuronolacton": 10.0,
            "guarana": 0,
            "inositol": 20.0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 1.8,
            "others": 0,
            "panthenol acid": 1.8,
            "sodium": 0.2,
            "sugar": 0.1,
            "taurine": 400.0,
            "vitamin B1": 0,
            "vitamin B12": 0.3,
            "vitamin B2": 0,
            "vitamin B6": 0,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "Edeka aktiv markt Grindelallee",
        "look": "The can looks pretty cheap, with the big T400 logo at the front and tiny \"T400\"s paving the background. There is a red \"30mg Caffeine + 400mg Taurine\" banner at the top as if they where really proud of their pretty much standard ingredients. The can itself is black and if it would not have the tiny T400s in the background it would actually look pretty decent.",
        "name": "T400 Energy",
        "overall": "T400 Energy is a pretty standard, but not solid energy drink. The taste is not really that great even when cooled down to 5 degrees. It is actually pretty cheap and widely available.The added Vitamins are pretty standard, no surprises here. Another Pro is that you can drink the can empty pretty fast due to its low CO2 contents. I drank this energydrink in the afternoon down-phase hoping for an energy boost to wake me up again, too bad caffeine slowly kicks in after roughly 30 minutes. Still i must say i am slowly feeling better after  20 minutes (the time i needed to write this review). Caffeine, it works bitches!",
        "paid": 0.79,
        "rating": 5.9,
        "taste": "OK T400, let me see what you have got! I must say it smells kinda familiar, obviously because most energy drinks smell pretty much the same. It is always about the gummy-sweet smell. It reminds me of Hubba Bubba Bubblegum. It contains really really few CO2 and therefore the arbitrary sweet and sourness of the is predominant. It tastes a bit like plastic, too. I cannot really say i like the taste. It surely is not better than other \"me-too\" energy drinks. I know now why the taste is not really good, i looked up the sugar contents of the drink and instead of normal sugar they used a replacement. Maybe that's where the headache comes from i now have.",
        "tribute": "",
        "url": "www.t400energy.de",
        "volume": 250.0
    },
    "taurine_force": {
        "CO2": true,
        "Nutritions": {
            "caffein": 32,
            "energy": 46.5,
            "glucuronolacton": 240,
            "niacin": 0,
            "others": "",
            "panthenol acid": 0,
            "sodium": 0.04,
            "sugar": 11,
            "taurine": 400,
            "vitamin B12": 2,
            "vitamin B2": 0.6,
            "vitamin B3": 8.7,
            "vitamin B5": 2,
            "vitamin B6": 2
        },
        "bought from": "Carrefour Milan",
        "look": "Somewhat cheap looking blue can with silver backdrop. In the front there is a exploding core or maybe a brain cell or i don't know.",
        "name": "Carrefour Taurine Force Energy Drink",
        "overall": "Tastes like an ordinary energy drink. Nothing special but rock solid. It also was not really expensive. Produced for Carrefour which is orginally located in France but i found that one in italy,milano",
        "paid": 0.69,
        "rating": 8,
        "taste": "Tastes actually really good. Typical Energy Drink taste, not too much CO2, really sweet.",
        "url": "carrefour supermarket",
        "volume": 250
    },
    "taurus_berry": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 30.0,
            "calcium": 0,
            "coenzym Q10": 0,
            "energy": 49.4,
            "guarana": 0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 0,
            "others": "",
            "panthenol acid": 0,
            "sodium": 0.1,
            "sugar": 12.1,
            "taurine": 30.0,
            "vitamin B1": 0,
            "vitamin B12": 0,
            "vitamin B2": 0,
            "vitamin B6": 0,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "E-Center Stuttgart Zuffenhausen",
        "look": "This time is not a can, but a see-through bottle with a silver-colored cap. The label has a bull with muscle arms(wtf?) and lightning on a red and black background. The drink itself is something between red and purple.",
        "name": "Taurus Energy Drink Berry",
        "overall": "It looks cheap, it tastes cheap, but the overall price is average. It is way too sweet to be enjoyable. It might not even be worth a try, but when you are a collector like me, it is still a must-drink :P.",
        "paid": 0.99,
        "rating": 5.0,
        "taste": "Oh my god, this is so... berry'... It smells so strong like these berry gummy bears. This is so sweet... geez. This that  same artificial berry taste you might know. It is just waaay too strong, i do not really like it.",
        "url": "taurusenergy.de",
        "volume": 500.0
    },
    "trojka_energy": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 32.0,
            "calcium": 0,
            "coenzym Q10": 0,
            "energy": 50.0,
            "guarana": 0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 7.92,
            "others": "",
            "panthenol acid": 1.98,
            "sodium": 0.0,
            "sugar": 11.3,
            "taurine": 400.0,
            "vitamin B1": 0,
            "vitamin B12": 2.0,
            "vitamin B2": 0,
            "vitamin B6": 2.0,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "TODO somewhere in Swizerland",
        "date": "2010-12-05",
        "look": "It comes in a blue and red can with a red and white star in the middle. It somewhat looks like what i think russian beer should look like. I drank the \"big can\" version with 440 ml, not that big after all.",
        "name": "Trojka energy",
        "overall": "As \"The Star of Energy\" its pretty mediocre. I mean it tastes O.K. but it is definitly not the greatest drink i ever drank in my life. As this is the first swiss energy drink i drank (8 more to come) i have high hopes for the remaining ones.",
        "paid": 1.35,
        "rating": 7.1,
        "taste": "When opened it smells like every other energy drink. Well, it actually tastes like most energy drinks, with more chewing gum and less gummy bear taste. The taste while drinking is actually pretty good, not too sweet. The after taste is really sweet, like most drinks. I kinda like it.",
        "tribute": "Thanks to Thorsten Schoog for this drink. You are awesome!",
        "url": "www.trojkaenergy.com",
        "volume": 440.0
    },
    "tunnel_energy": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 23.0,
            "calcium": 0,
            "coenzym Q1": 0,
            "energy": 49.0,
            "glucuronolacton": 0,
            "guarana": 0,
            "inositol": 0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 5.4,
            "others": 0,
            "panthenol acid": 1.8,
            "sodium": 0.001,
            "sugar": 11.2,
            "taurine": 29.0,
            "vitamin B1": 0,
            "vitamin B12": 0,
            "vitamin B2": 0.48,
            "vitamin B6": 0.6,
            "vitamin C": 18.0,
            "whey": 0
        },
        "bought from": "Edeka Hamburg Barmbek",
        "look": "Tunnel is sold in an transparent one liter PET bottle with a black and silver label. Besides the stylistic \"tunnel\" logo it contains a promotion for the film \"tne next three days\" (which was pretty mediocre by the way). I actually have never seen a real advertisement on an energy drink but i think this is a pretty good idea. Between the logo and the ad there are a number of icons i really cannot depict what they could possibly mean, for example a fishbone symbol or a \"star\". The bottle looks pretty neat to me.",
        "name": "Tunnel - Underground Rules",
        "overall": "Tunnel is one of the \"club\" drinks especially sold under the label of a well known club in Hamburg. You will probably not find it somewhere else in Germany or the rest of the world as it is extremely localized for Hamburg and surroundings. The drink itself tastes quite o.k. but i am a bit disappointed about the caffeine contents. It only contains 23mg caffeine, which is far below average for an energy drink. Keeping this in mind their subtitle \"Strong underground power drink\" sounds like a joke. Well, it comes in a 1l bottle therefore it should not be too much of a problem to ingest enough caffeine for a night.",
        "paid": 1.69,
        "rating": 7.6,
        "taste": "Ok, Tunnel what'cha'got? It smells like every other \"normal\" energy drink and the first taste is ... well like pretty much every other drink. The second sip is somewhat different. This drink actually tastes like it does not contain sugar, but the sugar replacement stuff. It is a bit sour because of the big amount of dissolved CO2, what i really like. When swallowing it down, tunnel has the typical gummy bear taste but it got close to no after taste. This is actually not too bad. \nAll in all Tunnel Energy is quite drinkable.",
        "tribute": "I thank Melissa from Hamburg buying this drink for me!",
        "url": "www.tunnelenergy.com",
        "volume": 1000.0
    },
    "turbo_tea": {
        "CO2": false,
        "Nutritions": {
            "caffein": 0,
            "calcium": 0,
            "energy": 0,
            "glucuronolacton": 0,
            "guarana": 0,
            "inositol": 0,
            "isomaltose": 0,
            "niacin": 0,
            "others": 0,
            "panthenol acid": 0,
            "sodium": 0,
            "sugar": 0,
            "taurine": 0,
            "vitamin B1": 0,
            "vitamin B12": 0,
            "vitamin B2": 0,
            "vitamin B6": 0,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "some belgian hotel",
        "look": "The wrapper looks really boring, with a red \"S budget\" logo at the top. \"TURBO TEA\" is written in fat letters at the front. The back side only contains the preparation manual. The green  background contains small logos made of an tree in a circle or something.",
        "name": "S Budget Turbo Tea",
        "overall": "Well, this is something unique. A tea with guarana and Ginseng added to refresh you harder than normal tea. I am not really sure if this is \"energydb\" worthy but what the hell, it is my db so i can do every damn thing with it. I really like the idea. Too bad there aren't any Nutritions printed on the wrapper of the tea bag. Normal black tea will only need to stay in the water for like 3 minutes but this turbo tea needs a whopping 8 minutes to unleash it's full potential (supposedly). To be honest, the tea sucks pretty big time, even with sugar it just does not has enough flavor.",
        "paid": 0.0,
        "rating": 4.4,
        "taste": "This tea smells really unique, somewhat like an energy drink mixed with black tea. I have high hopes for drinking an awesome tea. After waiting 8 long minutes .... bah, without sugar this tea is pretty bad. The initial taste is really somewhat like an energy drink, then it tastes watery and at the end turbo becomes really sour. With sugar the tea tastes better, but still not that good... I definitly prefer ordinary energy drinks or ordinary black tea above this 'turbo tea'.",
        "tribute": "Very special thanks go to Misas Dad who brought these tea bags from a business trip.",
        "url": "S budget",
        "volume": 3.0
    },
    "v_energy": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 31.0,
            "calcium": 0,
            "coenzym Q10": 0,
            "energy": 44.0,
            "guarana": 120.0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 1.1,
            "others": "",
            "panthenol acid": 0.36,
            "sodium": 1.3,
            "sugar": 11.0,
            "taurine": 0.0,
            "vitamin B1": 0,
            "vitamin B12": 0,
            "vitamin B2": 0,
            "vitamin B6": 1.12,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "Deka Markt,Zaanse Schaan Netherlands",
        "look": "It comes in a green can with the black \"V\" logo at the front. The V looks like the atom symbol. It looks kinda cool though.",
        "name": "V the afternoon wake-up call",
        "overall": "It was nice to have a really different taste from ordinary drink, but \"special\" does not always mean \"better\". Therefore i cannot really recommend it. The after taste is just weird.",
        "paid": 0.75,
        "rating": 5.8,
        "taste": "Tastes really... weird. It got a somewhat 'smokey', bitter after taste. I cannot really say i like it. There is not much CO2 in the drink, which, for me is definitly a minus. There is definitly not too much prickling on my tongue. It does not have the typical gummy bear taste like most energy drinks, this is probably because it does not contain any taurine.",
        "tribute": "Very special Thanks goes to Melissa for buying this drink for me in the Netherlands",
        "url": "Winters, Maarheeze NL",
        "volume": 250.0
    },
    "wild_dragon": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 32.0,
            "calcium": 0,
            "coenzym Q1": 0,
            "energy": 48.9,
            "glucuronolacton": 0,
            "guarana": 0,
            "inositol": 0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 8.0,
            "others": 0,
            "panthenol acid": 2.0,
            "sodium": 0,
            "sugar": 0,
            "taurine": 390.0,
            "vitamin B1": 0,
            "vitamin B12": 2.0,
            "vitamin B2": 0,
            "vitamin B6": 2.0,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "Baran Doener, Turmstrasse/Waldstrasse, Moabit, Berlin",
        "look": "Wild Dragon comes in a black and red can with a golden dragon crest. \"SERVE COOL\" in the front in case you forgot to drink your energy drinks cool. Besides that Wild Dragon(R) got a \"SUPERIOR TASTE AWARD\" emblem given out by the Institutional Taste and Quality Institute Brussels. The can also poses with \"Award winning smooth taste. Premium quality from Austria\". All that really arouses expectations. I hope for the best.",
        "name": "Wild Dragon Energy Drink",
        "overall": "Wild dragon got produced in Austria, awarded by the institute in Brussels and imported to Germany. Pretty multinational i must say. After drinking it i do not really know if they really earned their award but the drink surely does not suck bad. It feels like they tasted their own beverage before selling it (in contrast to Mad Bat). The can looks rather nice though. I bought it pretty expensive but if it would be cheaper (and available in my surrounding area) i would buy it again.",
        "paid": 1.49,
        "rating": 7.9,
        "taste": "So it got a superior taste award, that means it has to taste good... or not??? Well it smells rather nice, pretty sweet smell. Mh i must say the taste is pretty smooth. It is not as sour as most of the drinks and atop of that Wild Dragon does not taste like shit or weird or anything. It is still really sweet. When you wait too long the taste becomes rather sour again and it looses most of the CO2. Wild Dragon is not the best energy drink in terms of taste but it is above average.",
        "tribute": "",
        "url": "www.wilddragon.com",
        "volume": 250.0
    },
    "xl_cranberry": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 32.0,
            "calcium": 0,
            "coenzym Q1": 0,
            "energy": 47.0,
            "glucuronolacton": 0,
            "guarana": 0,
            "inositol": 0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 8.0,
            "others": 0,
            "panthenol acid": 2.0,
            "sodium": 0.7,
            "sugar": 11.0,
            "taurine": 400.0,
            "vitamin B1": 0,
            "vitamin B12": 1.87,
            "vitamin B2": 0,
            "vitamin B6": 2.0,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "Edeka Hamburg Barmbek",
        "look": "XL Cranberry comes in a red and black can, with the XL logo at the front. I like bigger cans better than the standard ones but most of the time you do not have a choice. Besides that there is nothing special with this can. ",
        "name": "XL Cranberry Energy",
        "overall": "This is the first one of the \"XL\" Series, they call it \"Cranberry\" taste... well, yes it actually does taste like cranberry. There are few energy drinks which do taste fruity and do not suck. This one is presumably one of them. But again, its all a matter of taste. There are 4 more \"XL\" drinks to go, let's see how these drinks perform. ",
        "paid": 0.99,
        "rating": 7.9,
        "taste": "XL Cranberry smells pretty fruity, and yes, it also tastes fruity as well. One letdown is that this drink is incredibly sweet, almost too sweet for me. The after taste is something between chewing gum and cranberries marinated in sugar.XL Cranberry does not have the typical energy drink taste, more like a fruit juice. It is actually a pretty good fruit energy drink.",
        "tribute": "Special Thanks goes to Melissa for buying these drink in Hamburg.",
        "url": "www.xl-energy.de",
        "volume": 250.0
    },
    "xl_energy": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 32.0,
            "calcium": 0,
            "coenzym Q1": 0,
            "energy": 47.0,
            "glucuronolacton": 0,
            "guarana": 0,
            "inositol": 0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 8.0,
            "others": 0,
            "panthenol acid": 2.0,
            "sodium": 0.1,
            "sugar": 11.3,
            "taurine": 400.0,
            "vitamin B1": 0,
            "vitamin B12": 0.2,
            "vitamin B2": 0.6,
            "vitamin B6": 2.0,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "Edeka Hamburg Barmbek",
        "look": "XL Energy is sold in a light and dark silver metallic blue can with a red cap. Of course it has the same CI as the other drinks, therefore no surprises here.",
        "name": "XL Energy Drink",
        "overall": "XL Energy is a pretty standard energy drink, which will probably do the job of keeping you awake while not tasting too horribly. It contains the allowed maximum of Caffeine and quite a lot of taurine which gives the drink the typical taste and even quite a lot of added Vitamins. It is ok, but really nothing special. Again the price is pretty high for a small can.",
        "paid": 0.99,
        "rating": 7.4,
        "taste": "Well, it tastes like an energy drink. For me the drink tastes pretty ordinary, it even is too sweet and with quite some carbon dioxide. The sugary and gummy after taste even comes close to the drinks with replacement sugar (this is not a good sign). XL Energy is a pretty standard energy drink.",
        "tribute": "Thanks goes to Melissa!",
        "url": "www.xl-energy.de",
        "volume": 250.0
    },
    "xl_lime": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 32.0,
            "calcium": 0,
            "coenzym Q1": 0,
            "energy": 44.0,
            "glucuronolacton": 0,
            "guarana": 0,
            "inositol": 0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 8.0,
            "others": 0,
            "panthenol acid": 2.0,
            "sodium": 0.1,
            "sugar": 10.5,
            "taurine": 400.0,
            "vitamin B1": 0,
            "vitamin B12": 0.2,
            "vitamin B2": 0,
            "vitamin B6": 2.0,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "Edeka Hamburg Barmbek",
        "look": "The can of XL lime is light and dark green with the red XL Logo.The liquid itself looks like Mountain Dew, probably even a bit greener. It probably makes a good mix with other, mostly transparent alcoholic fluids.",
        "name": "XL Lime&Lemon Energy",
        "overall": "OK, up for another one. The second drink of the XL Series is Lime&Lemon, another \"fruity\" energy drink. XL Lime and Lemon is sour and also a sweet, and most importantly, the taste does not suck. Too bad the CO2 fades away so fast. The price is not too cheap for a 250ml can. ",
        "paid": 0.99,
        "rating": 6.9,
        "taste": "XL Lime smells like \"lemon\" and \"weird\", probably because the can stood in the supermarket for a pretty long time. The second smell i really cannot make out, but it sure is weird, probably asia market and meat smell? The first sip is kinda sour and then becomes quite sweet. The drink really comes close the the promised \"lemon and lime\" taste. Too bad the carbon acid is volatized really fast when drinking, pretty much like the cranberry one.",
        "tribute": "Thanks again goes to Melissa from Hamburg",
        "url": "www.xl-energy.de",
        "volume": 250.0
    },
    "xl_sugarfree": {
        "CO2": true,
        "Nutritions": {
            "biotin": 0,
            "caffein": 32.0,
            "calcium": 0,
            "coenzym Q1": 0,
            "energy": 3.0,
            "glucuronolacton": 0,
            "guarana": 0,
            "inositol": 0,
            "isomaltose": 0,
            "magnesium": 0,
            "niacin": 8.0,
            "others": 0,
            "panthenol acid": 2.0,
            "sodium": 0.08,
            "sugar": 0.1,
            "taurine": 400.0,
            "vitamin B1": 0,
            "vitamin B12": 0.2,
            "vitamin B2": 0.6,
            "vitamin B6": 2.0,
            "vitamin C": 0,
            "whey": 0
        },
        "bought from": "Edeka Hamburg Barmbek",
        "look": "As the other XL drink, it comes with the same design, two colors glossy and matt silver with the XL Logo.The fluid itself looks somewhat like pee,has a darker yellow color. Other than that there is nothing special with this can.",
        "name": "XL SugarFree",
        "overall": "Ok, this is it, the last of XL drink, sugarfree this time. As i expected it, sugarfree probably is the worst of all of them in terms of taste. It really takes something to make a good sugarfree energy drink. But again, sugar is one of the main ingredients which wake you up and give you the power you expect from an energy drink. If you take that away, only Caffeine and the infused Vitamins remain. XL SugarFree is surely not the worst energy drink but also not the best sugarfree drink i've ever had. Again it is also pretty expensive for what you get here.",
        "paid": 0.99,
        "rating": 4.9,
        "taste": "For a sugarfree drink, XL Sugarfree smells pretty \"normal\" to me. The taste is as i would have expected it. First you only taste the sparkling bubbles, second the drink becomes really sour and in the end you taste the \"replacement\" sugar taste. The aftertaste is really sour as well. It only got a small bit of the typical energy drink taste, most of it is overlaid by the artificial sugar taste.",
        "tribute": "Tribute goes to Melissa who bought this drink along with all the other XL Energy Drinks.",
        "url": "www.xl-energy.de",
        "volume": 250.0
    }
}