{
    "actilife": {
        "CO2": true, 
        "Nutritions": {
            "biotin": 0, 
            "caffein": 24.0, 
            "calcium": 0, 
            "coenzym Q10": 0, 
            "energy": 2.0, 
            "guarana": 0, 
            "isomaltose": 0, 
            "magnesium": 0, 
            "niacin": 0, 
            "others": "L-Carnitine (200mg)", 
            "panthenol acid": 0, 
            "sodium": 0.1, 
            "sugar": 0.0, 
            "taurine": 400.0, 
            "vitamin B1": 0, 
            "vitamin B12": 0, 
            "vitamin B2": 0, 
            "vitamin B6": 0, 
            "vitamin C": 0, 
            "whey": 0
        }, 
        "bought from": "TODO: Somewhere in Switzerland", 
        "date": "2010-12-06", 
        "look": "The can has a yellow and red look on a white background with a womans shilouette in green. The can looks quite stylish and is vaguely reminiscient of some coke commercials. The logo is a little running white stickfigure. The can also bears the slogan \"Be You\" which is just silly.", 
        "name": "actilife Be you", 
        "overall": "Looks good, smells bad, tastes worse. The marketing strategy seems to be to hide the disgusting contents in a pretty container. Why can they not put a normal energy drink into this can. It could still be for women, but not taste so shitty. Of course the artificial sweetener is noticeable, as it makes all energy drinks worse.", 
        "paid": 1.3, 
        "rating": 2.1, 
        "taste": "WTF...How can anyone like this? Again a drink for women and again it is freakin disgusting... This one is incredibly sour and in the aftertaste that replacement sugar taste rapes your mouth. After swallowing it gets really bitter... but why??? Do the producer think that women believe if it tastes disgusting it must be healthy? There is no other chance they still produce and sell this stuff.", 
        "tribute": "Thanks goes to Thorsten Schoog, but this energy drink still sucks.", 
        "url": "www.actilife.ch", 
        "volume": 250.0
    }, 
    "action_energy_drink": {
        "CO2": true, 
        "Nutritions": {
            "biotin": 0, 
            "caffein": 31.5, 
            "calcium": 0, 
            "coenzym Q10": 0, 
            "energy": 48.0, 
            "guarana": 0, 
            "isomaltose": 0, 
            "magnesium": 0, 
            "niacin": 7.92, 
            "others": "Inositol", 
            "panthenol acid": 1.98, 
            "sodium": 0.1, 
            "sugar": 11.0, 
            "taurine": 380.0, 
            "vitamin B1": 0, 
            "vitamin B12": 2.0, 
            "vitamin B2": 0, 
            "vitamin B6": 2.0, 
            "vitamin C": 0, 
            "whey": 51
        }, 
        "bought from": "Beverage Dispenser Stuttgart Schwabstrasse", 
        "date": "2010-12-11", 
        "look": "The drink comes in a silver can with orange and black label. The \"ACTION\" logo goes from bottom to top. At the back you have 3 pictograms, one a jumping person, second a fucking molecule(wtf?!?) and third a head with gears inside. I have no idea what they want to point out with that. There is another label which says \"get your fire\" which makes even less sense. Overall i kinda like the style and probably i am only nitpicking.", 
        "name": "ACTION Energy Drink", 
        "overall": "Actually this drink is not too bad, besides the film created on the tongue. I am really a fan of these whey drink anyway. It could need some more CO2 as well.", 
        "paid": 1.0, 
        "rating": 7.6, 
        "taste": "It smells a lot like the \"average\" energy drink. At first it really tastes not too bad, but the after taste is really really sweet and tastes a lot like gummy bear taste. It is a bit sour, but still does not have enough CO2. The whey inside the drink makes a weird taste on the tongue and teeth. My friends say it taste like red bull just with bad after taste. In my oppinion the first taste is not as sweet as red bull.", 
        "tribute": "Big thanks goes to Momo for providing me with the source. His comment on the energy drink is \"Hoden Reiben\".", 
        "url": "www.tsi.de", 
        "volume": 250.0
    }, 
    "angel_pomegranate": {
        "CO2": false, 
        "Nutritions": {
            "caffein": 32, 
            "energy": 45, 
            "others": "Guarana Extract", 
            "sodium": 0.03, 
            "sugar": 11.2, 
            "taurine": 0
        }, 
        "bought from": "Rewe Berlin Grünau", 
        "look": "It comes in a white plastic bag, with a red ANGEL on at the front. Like most of the non-CO2 energy drinks, the packaging is somewhat similar to the capri sun packagings.", 
        "name": "ANGEL Natural energy Pomegranate", 
        "overall": "Even though i never drank a CO2 free energy drink which tasted good i though i would give this one a shot.Bad idea, now i got some serious head ache.I give 1 point for the packaging, which is kinda cool and the average caffein content", 
        "paid": 1.65, 
        "rating": 2, 
        "taste": "Oh my god this is so sweet.It tastes incredibly disgusting like drinking pure syrup.", 
        "url": "www.angel-drink.com", 
        "volume": 330
    }, 
    "big_pump": {
        "CO2": true, 
        "Nutritions": {
            "biotin": 0, 
            "caffein": 24.0, 
            "calcium": 0, 
            "coenzym Q10": 0, 
            "energy": 45.0, 
            "guarana": 0, 
            "isomaltose": 0, 
            "magnesium": 0, 
            "niacin": 5.4, 
            "others": "", 
            "panthenol acid": 1.8, 
            "sodium": 0.001, 
            "sugar": 10.8, 
            "taurine": 400.0, 
            "vitamin B1": 0, 
            "vitamin B12": 0, 
            "vitamin B2": 0.48, 
            "vitamin B6": 0.6, 
            "vitamin C": 12.0, 
            "whey": 0
        }, 
        "bought from": "Edeka Center Stuttgart Zuffenhausen", 
        "look": "I bought the small 500ml see through bottle (there is also a 1.5 l variant). It got a striped blue/white label with the red and blue big pump logo in the front. It says \"filled with big pump original recipe\". The bottle got a plastic seal which is reclosable. Well you can close it but it sure as hell is not sealed after that again (there now is energy drink all over the floor...)", 
        "name": "Big Pump Energy Drink", 
        "overall": "The overall idea to start an energy drink database started with big pump, because it was the first energy drink which taste didn't sucked. I really like the taste and the price is fine too. One of my personal favorite drinks.", 
        "paid": 0.49, 
        "rating": 9.0, 
        "taste": "This was the first energy drink i drank which actually tasted kinda good. It is not incredibly sweet, the gummy bear taste is not that dominant. It is a little bit sour and the after taste is ok.", 
        "url": "www.bigpump.de", 
        "volume": 500.0
    }, 
    "black_cat": {
        "CO2": true, 
        "Nutritions": {
            "biotin": 0, 
            "caffein": 30.0, 
            "calcium": 0, 
            "coenzym Q10": 0, 
            "energy": 44.0, 
            "guarana": 0, 
            "isomaltose": 0, 
            "magnesium": 0, 
            "niacin": 7.9, 
            "others": "", 
            "panthenol acid": 2.0, 
            "sodium": 0.07, 
            "sugar": 10.4, 
            "taurine": 380.0, 
            "vitamin B1": 0, 
            "vitamin B12": 2.0, 
            "vitamin B2": 0, 
            "vitamin B6": 2.0, 
            "vitamin C": 0, 
            "whey": 0
        }, 
        "bought from": "Netto Stuttgart", 
        "look": "Silver bottle with some real cheap label with a panther or something as a logo. This stuff looks real cheap, and well... it is, actually. Some people say it looks like a bottle for car oil...", 
        "name": "Black Cat Energy Drink", 
        "overall": "It tastes ok, it looks cheap and it definitly is some cheap stuff. The ingredients are what most of those discounter drinks are and it totally tastes like one.  In my oppinion, it is some fairly solid energy drink. Try it out, you will not regret it.", 
        "paid": 0.49, 
        "rating": 7.9, 
        "taste": "It is very sparkling at the tongue. The gummy taste is at first very strong, but fades fast. It is like most drinks very sweet. It is totally drinkable.", 
        "url": "Netto Marken-Discount AG, 93142 Maxhuetten-Haidorf -901390-", 
        "volume": 500.0
    }, 
    "blitz_energy": {
        "CO2": true, 
        "Nutritions": {
            "caffein": 30, 
            "energy": 46, 
            "niacin": 7.2, 
            "panthenol acid": 2, 
            "sodium": 0, 
            "sugar": 10.5, 
            "taurine": 400, 
            "vitamin B12": 0.4, 
            "vitamin B6": 0.8
        }, 
        "bought from": "Unes Maxi, Milano, Via E.De Marchi", 
        "look": "isilver with hurricane on it TODO", 
        "name": "Blitz! Energy Drink", 
        "overall": "cheap and solid, probably tastes better chilled.", 
        "paid": 0.7, 
        "rating": 6.7, 
        "taste": "really sweet which tastes a lot like the standard gummy bear flavour. Not much CO2.(haven't drunk chilled though)", 
        "url": "www.atlantesrl.it", 
        "volume": 250
    }, 
    "blitz_start": {
        "CO2": false, 
        "Nutritions": {
            "biotin": 50, 
            "caffein": 416, 
            "calcium": 480, 
            "energy": 276, 
            "guarana": 800, 
            "magnesium": 224, 
            "niacin": 16, 
            "others": "Mateextract(200mg)", 
            "panthenol acid": 6, 
            "sodium": 0, 
            "sugar": 40, 
            "taurine": 0, 
            "vitamin B1": 1.12, 
            "vitamin B2": 1.4, 
            "vitamin B6": 1.4
        }, 
        "bought from": "", 
        "look": "Small red bottle or vial with Michael Schumacher on it.  Looks similar to other shots like Red Bull Shot.", 
        "name": "Blitz Start", 
        "overall": "Well what can i say, this was my first SHOT and i cannot really say i liked the taste. It contains a vast amount of added vitamins and stuff, so it has to be good. The vial is very small and perfect to-go for the quick energy shot. It costs a lot less like the Red Bull Shots here. At least try it once.", 
        "paid": 1.25, 
        "rating": 6.7, 
        "taste": "Smells really intense like multi vitamin drinks.First sip is extremely sour, i guess you have to drink it at once.Oh my god it tastes so weird... Like very soure syrup or something. I dont know", 
        "url": "www.schneekoppe.de", 
        "volume": 25
    }, 
    "blue_bastard": {
        "CO2": true, 
        "Nutritions": {
            "biotin": 0, 
            "caffein": 32.0, 
            "calcium": 0, 
            "coenzym Q10": 0, 
            "energy": 46.0, 
            "guarana": 0, 
            "isomaltose": 0, 
            "magnesium": 0, 
            "niacin": 7.92, 
            "others": "", 
            "panthenol acid": 1.98, 
            "sodium": 0.1, 
            "sugar": 10.5, 
            "taurine": 400.0, 
            "vitamin B1": 0, 
            "vitamin B12": 0.4, 
            "vitamin B2": 0, 
            "vitamin B6": 0.8, 
            "vitamin C": 0, 
            "whey": 0
        }, 
        "bought from": "TODO", 
        "look": "This drinks comes right from Holland, therefore most texts are dutch. It comes in a black bottle with a \"blue bastard\" dog at the cover. The can says it got \"an awfully 'cool' taste\" but i am not quite convinced yet. At first sight i haven't spotted the text it got CO2 but i hope for the best. O.k lets give it a shot", 
        "name": "Blue Bastard Energy Drink", 
        "overall": "All in all, this drink tastes pretty good. In respect to the price, it is really neat. I probably won't have the chance to drink it again, but if you live in Holland, you might be lucky to find it in your local supermarket.", 
        "paid": 0.35, 
        "rating": 8.1, 
        "taste": "It is a bit sour and got very few CO2 inside. Still, it does not taste too bad. The drink is sweet, but not too sweet and it is quite drinkable. This taste is relevant to my interest.", 
        "url": "Blue Bastard Postbus 80, 4153 ZH BEESD", 
        "volume": 250.0
    }, 
    "booster_edeka": {
        "CO2": true, 
        "Nutritions": {
            "biotin": 0, 
            "caffein": 32.0, 
            "calcium": 0, 
            "coenzym Q10": 0, 
            "energy": 44.0, 
            "guarana": 0, 
            "isomaltose": 0, 
            "magnesium": 0, 
            "niacin": 8.0, 
            "panthenol acid": 2.0, 
            "sodium": 0.07, 
            "sugar": 10.4, 
            "taurine": 400.0, 
            "vitamin B1": 0, 
            "vitamin B12": 2.0, 
            "vitamin B2": 0, 
            "vitamin B6": 2.0, 
            "vitamin C": 0, 
            "whey": 0
        }, 
        "bought from": "Edeka Berlin Alexanderplatz(Alexa)", 
        "look": "Silver can with Blue BOOSTER at the front. Looks pretty cheap to me.", 
        "name": "Booster Energy Drink", 
        "overall": "It is incredibly cheap so at least give it a try. The taste is weird and i o not really like it much, it just feels wrong. Maybe it is just today where i triedit.. Maybe it is just me.", 
        "paid": 0.49, 
        "rating": 6.2, 
        "taste": "It actually does not have a strong gummy bear taste, more like something else.. chemical. I do not really know what it is but it definitly tastes different. Of curse again it is very sweet and all but it is different. It is a really weird feelin when i gulp it and my head starts to feel weird. A sour aftertaste enhances this feling.", 
        "url": "EUCO GmbH, D-22291 Hamburg, 5150683", 
        "volume": 330.0
    }, 
    "bullit": {
        "CO2": true, 
        "Nutritions": {
            "biotin": 0, 
            "caffein": 32.0, 
            "calcium": 0, 
            "coenzym Q10": 0, 
            "energy": 47.3, 
            "guarana": 0, 
            "isomaltose": 0, 
            "magnesium": 0, 
            "niacin": 6.0, 
            "others": "folacin(66.6ug)", 
            "panthenol acid": 2.0, 
            "sodium": 0.005, 
            "sugar": 11.1, 
            "taurine": 30.0, 
            "vitamin B1": 0, 
            "vitamin B12": 0, 
            "vitamin B2": 0, 
            "vitamin B6": 0.666, 
            "vitamin C": 20.0, 
            "whey": 0
        }, 
        "bought from": "Penny Hamburg", 
        "look": "It looks like magic man bottle only with blue instead of purple. It even got the davinci Man on the front. The Name is different though.", 
        "name": "Bullit Get It! Energydrink", 
        "overall": "It is 100 percent Magic Man. Period. This actually is the first drink where i am totally sure it is from the same producer. ", 
        "paid": 0.49, 
        "rating": 4.1, 
        "taste": "OH MY GOD, this totally tastes like Magic Man (which taste sucks balls). This IS Magic Man", 
        "url": "GEDIMA Erfrischungsgetraenke GmbH, D-41836 Hueckelhoven", 
        "volume": 500.0
    }, 
    "burn_energy": {
        "CO2": true, 
        "Nutritions": {
            "caffein": 32, 
            "energy": 57, 
            "glucuronolacton": 140, 
            "niacin": 6, 
            "others": "inositol(12mg)", 
            "panthenol acid": 1.7, 
            "sodium": 0.02, 
            "sugar": 13.3, 
            "taurine": 400, 
            "vitamin B12": 0.3, 
            "vitamin B6": 0.7
        }, 
        "bought from": "Supermarked PAM, Milano, Viale Olona", 
        "look": "Black can with a flame at the front. Does more look like chili drink than energy drink.", 
        "name": "Burn Energy Drink", 
        "overall": "It is from the Coca Cola Company, and they did everything right when mixing this drink. It is one of my favorite energy drinks, even though i only have drank it once in Milan. Only downer is the pretty costy price tag.", 
        "paid": 0.99, 
        "rating": 8.9, 
        "taste": "It tastes like every energydrink very sweet. Instead of having an overwhelming gummy bear taste, this stuff is more like a berry drink. It is somewhat sour, has lots of CO2 and is very sparking, which is, in this case, a good thing. I really like it, this can be considered a `premium` energy drink! I really like the berry aftertaste.", 
        "url": "www.burnenergydrink.it", 
        "volume": 250
    }, 
    "denner_e-zero": {
        "CO2": true, 
        "Nutritions": {
            "biotin": 0, 
            "caffein": 32.0, 
            "calcium": 0, 
            "coenzym Q10": 0, 
            "energy": 3.0, 
            "guarana": 0, 
            "isomaltose": 0, 
            "magnesium": 0, 
            "niacin": 8.0, 
            "others": "Glucoronolacton(240mg)", 
            "panthenol acid": 2.0, 
            "sodium": 0.0, 
            "sugar": 0.0, 
            "taurine": 380.0, 
            "vitamin B1": 0, 
            "vitamin B12": 2.0, 
            "vitamin B2": 0, 
            "vitamin B6": 2.0, 
            "vitamin C": 0, 
            "whey": 0
        }, 
        "bought from": "Denner Swizerland", 
        "date": "2010-12-10", 
        "look": "The drink comes in a all-silver can with the red e-zero logo at the front. The can looks kinda cheap but not nearly as cheap as the last drink i had from swizerland (M Budget). In fact, the can looks pretty cool and minimalistic.", 
        "name": "Denner E-ZERO energy-taste", 
        "overall": "This is one of the drinks from swizerland, again sugar-free and from a super market chain (Denner). Still this drinks sucks less than the one from M Budget. Again it not really helps the drink has no sugar (taste-wise) but it is not too bad either. It is actually produced in the Netherlands, where a lot of energy drinks come from. Seems the people there have it with stuff to stimulate body and mind. It surely is not the greatest energy drink i ever had, but i am pretty optimistic it helps me over my after lunch grogginess.", 
        "paid": 0.69, 
        "rating": 7.3, 
        "taste": "OK, lets give it shot. Based on the label i prepare myself for another shitty zero-sugar drink. The smell is like an ordinary energy drink. Wow the first sip was not nearly as bad as i expected a low-cal energy drink. In fact i kinda like the taste. It is a bit sweeter than the \"average\" energy drink and the taste is something between gummy bears and chewing gum. The after taste is a bit bitter but it does not necessarily suck like most of these drinks.", 
        "tribute": "Thanks goes to Thorsten Schoog. You are awesome!", 
        "url": "www.denner.ch", 
        "volume": 250.0
    }, 
    "ed_hardy": {
        "CO2": true, 
        "Nutritions": {
            "caffein": 34, 
            "energy": 45, 
            "niacin": 8, 
            "others": "", 
            "panthenol acid": 2, 
            "sodium": 0, 
            "sugar": 10.7, 
            "taurine": 400, 
            "vitamin B12": 2, 
            "vitamin B6": 2
        }, 
        "bought from": "Netto Bohnsdorf", 
        "look": "It is a black can with a drawn tiger on the front (most likely a well known tattoo by ed hardy). For me it looks somewhat stupid. I do not like the style of these tattoos at all.", 
        "name": "Ed Hardy Energy Drink", 
        "overall": "It is not my taste and i do not really like the style.  The price is above average, but it surely packs a punch with all the added stuff in it. My guess is you pay a lot for the name, not the good taste.", 
        "paid": 0.99, 
        "rating": 4, 
        "taste": "It tastes a lot like some very sweet berry juice.  The taste is very intense, it actually is too sweet in my opinion.  It got a below average CO2 contents or maybe it is because it fell down when i bought it.", 
        "url": "www.edhardyenergydrink.eu", 
        "volume": 250
    }, 
    "effect": {
        "CO2": true, 
        "Nutritions": {
            "biotin": 0, 
            "caffein": 32.0, 
            "calcium": 0, 
            "coenzym Q10": 0, 
            "energy": 45.0, 
            "guarana": 0, 
            "isomaltose": 0, 
            "magnesium": 0, 
            "niacin": 7.0, 
            "others": "inositol(20mg)", 
            "panthenol acid": 2.0, 
            "sodium": 0.07, 
            "sugar": 11.0, 
            "taurine": 400.0, 
            "vitamin B1": 0, 
            "vitamin B12": 2.0, 
            "vitamin B2": 0.6, 
            "vitamin B6": 2.0, 
            "vitamin C": 0, 
            "whey": 0
        }, 
        "bought from": "Rewe Berlin Bohnsdorf", 
        "look": "It is a white and siver can with red dots. They seem to go for simplicity. I kinda like the look though.", 
        "name": "effect", 
        "overall": "I like the look, the taste and the price. This is one rock solid energy drink, one of my favorites. Do not hesistate to buy it when you see it. Sure there quite some other energy drinks which are a lot cheaper, but this stuff surely tastes good.", 
        "paid": 0.99, 
        "rating": 8.9, 
        "taste": "It really tastes like a great energy drink. It is not too sour or sweet, well actually it is really sweet but that is fine for me. The gummy bear taste is not really strong which is a good thing. That is the stuff i really like to drink. I really would consider it premium (they actually tasted it before selling it).", 
        "url": "www.effect-energy.com", 
        "volume": 330.0
    }, 
    "ener_g": {
        "CO2": true, 
        "Nutritions": {
            "caffein": 24, 
            "energy": 50.2, 
            "niacin": 6, 
            "others": "", 
            "panthenol acid": 2, 
            "sodium": 0.1, 
            "sugar": 12.1, 
            "taurine": 30, 
            "vitamin B6": 0.66, 
            "vitamin C": 35
        }, 
        "bought from": "Edeka Berlin Alexanderplatz(Alexa)", 
        "look": "Has a pretty standard, oldschool looking red can with blue and silver typeface", 
        "name": "Ener-G", 
        "overall": "It tastes better than the ener-g black stuff but not too much. It simply is not my taste. The price and the can is cool though. Can also be found in NP-Market Berlin", 
        "paid": 0.69, 
        "rating": 6.6, 
        "taste": "Really sweet, with a very similar after taste to the ener-g black stuff. Gummy bear taste is pretty dominant. Also tastes a bit like berry but without the cola taste. In my oppinion it tastes better than the ener-g black.", 
        "url": "GEDIMA Erfrischungsgetraenke GMBH", 
        "volume": 250
    }, 
    "ener_g_black": {
        "CO2": true, 
        "Nutritions": {
            "caffein": 25.6, 
            "energy": 44, 
            "niacin": 5.04, 
            "others": "", 
            "panthenol acid": 1.68, 
            "sodium": 0.02, 
            "sugar": 10.6, 
            "taurine": 26, 
            "vitamin B6": 0.56, 
            "vitamin C": 16.8
        }, 
        "bought from": "Edeka Berlin Alexanderplatz(Alexa)", 
        "look": "Black Can with red and bronze face. It says High energy and Cola Drink at the front.", 
        "name": "Ener-G Black", 
        "overall": "Besides being too frickin sweet for my taste it is not really bad. It has a below average caffein content and far below average taurine content. It is not really my taste, check it out anyway if you get the chance, because the price is actually really cheap.", 
        "paid": 0.69, 
        "rating": 5.5, 
        "taste": "At first, it is really really sweet. It should taste like Cola but it sure tastes like everything BUT cola. The taste is something between berry juice,citrus and Gummy bear taste. It somewhat reminds me of the Coke of Red bull, which does not taste good either.", 
        "url": "GEDIMA Erfrischungsgetraenke GMBH", 
        "volume": 250
    }, 
    "energy_boost": {
        "CO2": true, 
        "Nutritions": {
            "caffein": 32, 
            "energy": 52, 
            "niacin": 7.92, 
            "others": "", 
            "panthenol acid": 1.98, 
            "sodium": 0.1, 
            "sugar": 11.8, 
            "taurine": 400, 
            "vitamin B12": 2, 
            "vitamin B6": 2
        }, 
        "bought from": "Lombardini Discont Milano", 
        "look": "A silver and white can with a red bulldog as cover.  Actually looks really cheap.", 
        "name": "Energy Boost Power Drink", 
        "overall": "IMHO this is one of the below average cheap energy drink you stumble upon in different Super Markets. No difference here as i bought it in LD Market which is kinda like the ALDI market here in Germany. It does not really hits my taste, but it is actually really cheap. I am sure this is similar stuff to other cheap supermarket energt drinks and most likely the same stuff from the same producer", 
        "paid": 0.59, 
        "rating": 6.6, 
        "taste": "It is really really sweet and the typical gummy bear taste is very dominant. For my taste there is not enough CO2 in it. The first taste is somewhat sour but not in a good way.", 
        "url": "Lockwoods Italiana(pfanner italia),MD Getraenke GmbH", 
        "volume": 250
    }, 
    "energy_rocket": {
        "CO2": true, 
        "Nutritions": {
            "biotin": 0, 
            "caffein": 32.0, 
            "calcium": 0, 
            "coenzym Q10": 0, 
            "energy": 44.0, 
            "guarana": 0, 
            "isomaltose": 0, 
            "magnesium": 0, 
            "niacin": 7.92, 
            "panthenol acid": 1.92, 
            "sodium": 0.1, 
            "sugar": 10.0, 
            "taurine": 380.0, 
            "vitamin B1": 0, 
            "vitamin B12": 2.0, 
            "vitamin B2": 0, 
            "vitamin B6": 2.0, 
            "vitamin C": 0, 
            "whey": 0
        }, 
        "bought from": "Kaufland Stuttgart", 
        "look": "Blue bottle with silver label and red-blue emblem", 
        "name": "Energy Rocket", 
        "others": "", 
        "overall": "TODO", 
        "paid": 0.5, 
        "rating": 8.0, 
        "taste": "TODO", 
        "url": "Radlberger Getraenke A-3105 Unterradlberg", 
        "volume": 500.0
    }, 
    "energy_slammers": {
        "CO2": true, 
        "Nutritions": {
            "biotin": 0, 
            "caffein": 32, 
            "calcium": 0, 
            "coenzym Q10": 0, 
            "energy": 0, 
            "guarana": 0, 
            "isomaltose": 0, 
            "magnesium": 0, 
            "niacin": 7.92, 
            "others": "", 
            "panthenol acid": 1.98, 
            "sodium": 0.08, 
            "sugar": 11.4, 
            "taurine": 0, 
            "vitamin B1": 0, 
            "vitamin B12": 0.5, 
            "vitamin B2": 0.6, 
            "vitamin B6": 1, 
            "vitamin C": 0, 
            "whey": 0
        }, 
        "bought from": "Somewhere in the Netherlands (TODO)", 
        "look": "It comes in a silver can with red and black printing. The full text at the front is \"Energy Slammers refreshing powerdrink with the 'unique energy taste'. Well, lets see how unique it is. The can does not look too expensive (well it isn't :P ). But i must admit, it really looks like an average energy drink.", 
        "name": "Energy Slammers Refreshing Powerdrink", 
        "overall": "This is another energy drink from the Netherlands. It promotes its 'unique' taste and i must say the taste is somewhat unique, but not really in a good way. Most of the time breweries try out new tastes for their energy drinks they fail, this time it is not really the case. It is O.K. but surely not the best drink i ever drank. Give it a shot, you might like it. P.S. i was a bit ill the time, so i might not have described the taste 100 percent accurate.", 
        "paid": 0.79, 
        "rating": 6.3, 
        "taste": "The first sip was like... mh it tastes like nothing (i thought it is because of the cold i had), but the after taste is ... \"unique\", really. It tastes like hubba bubba chewing gum. It is incredibly sweet and i really do not like this after taste. It does not have too much CO2 inside though, it is quite drinkable in this way.", 
        "url": "Slammers Postbus 80 4153 ZH BEESD Nederland", 
        "volume": 250
    }, 
    "flying_power": {
        "CO2": true, 
        "Nutritions": {
            "biotin": 0, 
            "caffein": 32.0, 
            "calcium": 0, 
            "coenzym Q10": 0, 
            "energy": 48.0, 
            "guarana": 0, 
            "isomaltose": 0, 
            "magnesium": 0, 
            "niacin": 8.0, 
            "panthenol acid": 2.0, 
            "sodium": 0.06, 
            "sugar": 11.0, 
            "taurine": 400.0, 
            "vitamin B1": 0, 
            "vitamin B12": 2.0, 
            "vitamin B2": 0, 
            "vitamin B6": 2.0, 
            "vitamin C": 0, 
            "whey": 0
        }, 
        "bought from": "Aldi Sued Stuttgart Zuffenhausen", 
        "look": "A brown see-through bottle with a silver and red label. The label has an eagle at the front.", 
        "name": "Flying Power Energy Drink", 
        "others": "Inositol", 
        "overall": "I am a bit disappointed by the drink because it provides not the usual quality expected from Aldi. Its incredibly cheap though.At least give it a try if you see it. It has a too intense taste and not enough CO2 for what i like.", 
        "paid": 0.34, 
        "rating": 5.2, 
        "taste": "Smells really intense. Very few CO2, and a very strong gummy bear taste. It also is very sweet. After taste is somewhat sour.", 
        "url": "S.Spitz GmbH A-4800 Attnang-Puchheim, Austria (powered by topstar)", 
        "volume": 330.0
    }, 
    "fritz-kaffee": {
        "CO2": true, 
        "Nutritions": {
            "caffein": 25, 
            "energy": 43, 
            "others": "", 
            "sodium": 0.002, 
            "sugar": 10.6
        }, 
        "bought from": "Kaisers Berlin Potsdamer Platz", 
        "look": "Same as fritz cola, it has a simplified bottle with a now brown etiquette.", 
        "name": "fritz Kola-Kaffee-Brause", 
        "overall": "Weird and somewhat funny stuff. Just try it when you see it.", 
        "paid": 0.79, 
        "rating": 7.3, 
        "taste": "It tastes like cola and ... well coffee. It is a really weird taste but i kinda like it. You have to try it out", 
        "url": "fritz-kola.de", 
        "volume": 330
    }, 
    "fritz_cola": {
        "CO2": true, 
        "Nutritions": {
            "caffein": 25, 
            "energy": 42, 
            "others": "", 
            "sodium": 0.002, 
            "sugar": 10.5
        }, 
        "bought from": "Kaufland Berlin Schöneweide", 
        "look": "It is a pretty simple bottle with a black sticker with two heads on it. I kinda like the look, it makes the Coke _cool_.", 
        "name": "fritz-cola", 
        "overall": "Even though at first i did not thought it is a real ENERGY DRINK but when i looked at the caffein contents my mind changed. The taste is really nice and smooth and got 25mg of the good stuff. For me it is a real go-go, check it out. I mean it.", 
        "paid": 0.75, 
        "rating": 8.4, 
        "taste": "It tastes like normal coke with a tiny bit of citrus. It is really refreshening and is really similar to stuff like Vita Cola. In addition it got LOTS of caffein in it.", 
        "url": "fritz-kola.de", 
        "volume": 330
    }, 
    "gipsy_energy_cola": {
        "CO2": true, 
        "Nutritions": {
            "caffein": 28, 
            "energy": 51, 
            "niacin": 8, 
            "others": "", 
            "panthenol acid": 2, 
            "sodium": 0.05, 
            "sugar": 12.7, 
            "taurine": 10, 
            "vitamin B12": 2, 
            "vitamin B6": 2
        }, 
        "bought from": "Lombardini Discont Milano", 
        "look": "A silver and red can with the Gipsy energy cola logo on it. It really looks cheap to me. But one cannot imagine that some can like that tastes like shit!", 
        "name": "Gipsy Energy Cola", 
        "overall": "This is the WORST! Never try it, just trust me. Never EVER buy this stuff. Even though it costs onl 59 cent, you will regret it!", 
        "paid": 0.59, 
        "rating": 1.0, 
        "taste": "The first sip is like... mh ... 1 second later UAAARGHHHH!!!! Wtf seriously? what were they thinking? This is BY far the worst cola stuff i ever drank. It tastes so much like some weird chemical experiment. Thats how i would imagine toilet cleaner tastes like. Have they ever tasted it before?", 
        "url": "Lockwoods Italiana", 
        "volume": 250
    }, 
    "kee_pex": {
        "CO2": true, 
        "Nutritions": {
            "caffein": 32, 
            "energy": 48, 
            "niacin": 6.12, 
            "others": "Maca", 
            "panthenol acid": 2, 
            "sodium": 0.02, 
            "sugar": 11, 
            "taurine": 400, 
            "vitamin B6": 0.68
        }, 
        "bought from": "Hit Discounter Berlin Zoo", 
        "look": "It is a red can with a bird in the front. I think it should be an eagle or something in front of three pyramids but it looks more like an angry seagul to me (which is even worse!). It says Energy Drink Maca Power, stating that they included something extraordinary into the drink.  The drink itself is pink, which was kinda surprising only knowing either ordinary energy drinks with this yellow-greenish color or the berry offsprings being pink.", 
        "name": "Kee Pex", 
        "overall": "This stuff is actually not bad, even though i do not really like the bubble gum taste in my energy drink. Be sure to check this one out if you get the chance. I mean it contains Maca and stuff!", 
        "paid": 0.99, 
        "rating": 6.7, 
        "taste": "Given the fact Maca is in this stuff it does not really taste any different from all the other energy drinks. It somewhat tastes more like bubble gum (like HubbaBubba) than Gummy bears and it is, like most of these drinks, very sweet. It does not taste bad or anything, but i expected more of Maca(whatever this stuff is anyway).", 
        "url": "www.kee-pex.de", 
        "volume": 250
    }, 
    "leetmate": {
        "CO2": true, 
        "Nutritions": {
            "biotin": 0, 
            "caffein": 18.0, 
            "calcium": 0, 
            "coenzym Q10": 0, 
            "energy": 0, 
            "guarana": 0, 
            "isomaltose": 0, 
            "magnesium": 0, 
            "niacin": 0, 
            "others": "mate-extract(0.40g)", 
            "panthenol acid": 0, 
            "sodium": 0, 
            "sugar": 0, 
            "taurine": 0, 
            "vitamin B1": 0, 
            "vitamin B12": 0, 
            "vitamin B2": 0, 
            "vitamin B6": 0, 
            "whey": 0
        }, 
        "bought from": "leetmate.de", 
        "look": "It is a small see-through bottle with a printed black and green label. They got a ASCII-happy smiley in the front. At the inside of the label they got a QR-Code and \"1337 is awesome\".", 
        "name": "1337mate", 
        "overall": "This scene drink is driven under the concept of CC-BY-NC-SA. The guys behind 1337mate aim to be the open alternative to club mate. The drink as is tastes somewhat good, much more like mate tea.", 
        "paid": 1.5, 
        "rating": 8.4, 
        "taste": "It tastes like Mate-tea with CO2 and sugar. There is another drink, well known in the hacker scene, Club Mate. It tastes much more like the original Mate tea, much more aromatic and tangy. It got few CO2 but tastes pretty good.", 
        "url": "www.leetmate.de", 
        "volume": 330
    }, 
    "lions": {
        "CO2": true, 
        "Nutritions": {
            "caffein": 31.5, 
            "energy": 48.8, 
            "niacin": 7.92, 
            "others": "", 
            "panthenol acid": 1.98, 
            "sodium": 0.1, 
            "sugar": 11.3, 
            "taurine": 380, 
            "vitamin B12": 2, 
            "vitamin B6": 2
        }, 
        "bought from": "Getränke Hoffmann Bohnsdorf", 
        "look": "It comes in a somewhat cheap looking can with a female lion on it(wtf).The can is silver with red graphics on it.", 
        "name": "Lions Energizer", 
        "overall": "I can highly recommend it for its taste AND its price.  This is really really nice stuff which gives you lots of energy for the day or the night.", 
        "paid": 0.49, 
        "rating": 9.1, 
        "taste": "I really like the taste of this stuff. It is not incredible sweet and the gummy bear taste is not too intrusive.", 
        "url": "www.lions-energizer.de", 
        "volume": 250
    }, 
    "m_budget_energy": {
        "CO2": true, 
        "Nutritions": {
            "biotin": 0, 
            "caffein": 32.0, 
            "calcium": 0, 
            "coenzym Q10": 0, 
            "energy": 45.0, 
            "guarana": 0, 
            "isomaltose": 0, 
            "magnesium": 0, 
            "niacin": 8.0, 
            "others": "", 
            "panthenol acid": 2.0, 
            "sodium": 0, 
            "sugar": 11.0, 
            "taurine": 400.0, 
            "vitamin B1": 0, 
            "vitamin B12": 2.0, 
            "vitamin B2": 0, 
            "vitamin B6": 2.0, 
            "vitamin C": 0, 
            "whey": 0
        }, 
        "bought from": "Migros Swizerland", 
        "date": "2010-12-11", 
        "look": "It comes in a cheap looking green can. The can is the same as the sugar free variant of this energy drink, just without the sugarfree label. You would not expect this drink to appear in some clubs, but that is no problem for me.", 
        "name": "M Budget Energy Drink", 
        "overall": "This is some pretty good drink for its price. You may want to drink this one with your friends. The price is really really good for swizerland and o.k. for a drink here in Germany. If you have the chance and you are thirsty for ENERGY, be sure to check it out at least.", 
        "paid": 0.66, 
        "rating": 8.2, 
        "taste": "Well, actually this drink does not really tastes too bad. It got the typical gummy bear taste, the after taste is a bit sour but quite ok. I would say this is the \"average\" energy drink. It does not taste like anything special. This is how you probably would expect an energy drink would taste like.", 
        "tribute": "Thanks goes to Thorsten Schoog. Thank you for this delicious drink!", 
        "url": "migros.ch", 
        "volume": 250.0
    }, 
    "m_budget_sugarfree": {
        "CO2": true, 
        "Nutritions": {
            "biotin": 0, 
            "caffein": 32.0, 
            "calcium": 0, 
            "coenzym Q10": 0, 
            "energy": 3.0, 
            "guarana": 0, 
            "isomaltose": 0, 
            "magnesium": 0, 
            "niacin": 8.0, 
            "others": "glucolacetone(240mg),Inositol", 
            "panthenol acid": 2.0, 
            "sodium": 0.0, 
            "sugar": 0.0, 
            "taurine": 400.0, 
            "vitamin B1": 0, 
            "vitamin B12": 2.0, 
            "vitamin B2": 0, 
            "vitamin B6": 2.0, 
            "vitamin C": 0, 
            "whey": 0
        }, 
        "bought from": "Migros Swizerland", 
        "date": "2010-12-09", 
        "look": "It comes in a very cheap looking white and green can with the word \"migros\" all over it. The \"sugarfree\" inferer badge is light blue to make it look more \"light\". It has the Budget M logo at the front and even has the price at the front (swiss Fr. 0.85).", 
        "name": "M Budget DRINK Sugarfree", 
        "overall": "The sugarfree (aka replacement sugar) taste really kills my mood. Without it the drink might even taste better (or simply more like an ordinary energy drink). Good news, there is the pure-sugar version still in my fridge waiting to be reviewed. Even though this drink is sugar free and does not have any calories, it is also lacking of the main ingredient necessary to provide you with the energy you actually expect. Considering it is bought in swizerland it is not really expensive,. Thats why my expectations weren't too high either. I hope the real sugar version tastes better.", 
        "paid": 65.0, 
        "rating": 6.5, 
        "taste": "Smells like every other energy drink. The inital taste is a lot like every drink, but the after taste is very bitter. At the end the replacement sugar taste tortures your taste buds. I really really hate that taste. Even though it will have no  calories, it really kills the joy of drinking. Without that it might tastes better (or more like every energy drink).", 
        "tribute": "Thanks goes to Thorsten Schoog who provided me with all these great (*cough* or not so great*cough*) energy drinks directly from Swizerland.", 
        "url": "www.migros.ch", 
        "volume": 250.0
    }, 
    "m_classic_energy_cola": {
        "CO2": true, 
        "Nutritions": {
            "biotin": 0, 
            "caffein": 26.0, 
            "calcium": 0, 
            "coenzym Q10": 0, 
            "energy": 44.0, 
            "guarana": 0, 
            "isomaltose": 0, 
            "magnesium": 0, 
            "niacin": 0, 
            "others": "", 
            "panthenol acid": 0, 
            "sodium": 0, 
            "sugar": 11.0, 
            "taurine": 400.0, 
            "vitamin B1": 0, 
            "vitamin B12": 0, 
            "vitamin B2": 0, 
            "vitamin B6": 0, 
            "vitamin C": 0, 
            "whey": 0
        }, 
        "bought from": "Migros Swizerland", 
        "date": "2010-12-11", 
        "look": "It comes in a silver can with red label and text. It is the same can as the other M Classic drinks just a different color. Again the can is slightly bigger than the normal cans, which is kinda cool in my opinion.", 
        "name": "M Classig Energy Cola", 
        "overall": "I am on the quest for the reasonably good tasting cola and energy drink. After this drink, i still am... How is it even possible to fuck up the taste that badly with every cola and energy drink? In the near future i will try it myself, to mix cola and energy. Maybe it is not even possible to mix these two without producing a bad taste? In my next cola/energy drink review i will write my results.", 
        "paid": 0.77, 
        "rating": 5.0, 
        "taste": "UARGH this smells so weird... EWWW, why do all energy cola mix drinks taste so bad??? It tastes like there are some weird \"spices\" in this drink, i do not really know why. The after taste is just plain BAD, like cola syrup and energy and spices. In addition, the drink does not have enough CO2, which really sucks.", 
        "tribute": "Tribute again goes to Thorsten Schoog!", 
        "url": "www.migros.ch", 
        "volume": 296.0
    }, 
    "m_classic_energy_fruity": {
        "CO2": true, 
        "Nutritions": {
            "biotin": 0, 
            "caffein": 32.0, 
            "calcium": 0, 
            "coenzym Q10": 0, 
            "energy": 61.0, 
            "guarana": 0, 
            "isomaltose": 0, 
            "magnesium": 0, 
            "niacin": 3.6, 
            "others": "Guarana Extract, Ginseng Extract, Inositol", 
            "panthenol acid": 1.2, 
            "sodium": 0.01, 
            "sugar": 14.0, 
            "taurine": 400.0, 
            "vitamin B1": 0, 
            "vitamin B12": 0.2, 
            "vitamin B2": 0, 
            "vitamin B6": 0.4, 
            "vitamin C": 0, 
            "whey": 0
        }, 
        "bought from": "Migros Swizerland", 
        "date": "2010-12-11", 
        "look": "The drink comes in a silver bottle with an orange Banner at the front. It got the Energy Fruity logo at the front, which is barely recognizable because the orange cannot be distinguished from the silver can. The can is slightly bigger than average, nearly 50 ml more inside.", 
        "name": "M Classic Energy Fruity", 
        "overall": "This is another of the drinks from the M Classic series out of swizerland. I actually like these jucy drinks, but most of the drinks fail at not putting too much sweetener inside. And so is this drink, sadly. Actually it has all kinds of fruit juices inside (like apple,pear,mango), but it really tastes nothing like any of these fruits.", 
        "paid": 0.77, 
        "rating": 7.0, 
        "taste": "Yet another drink which tastes so much like Monster Ripper. This one is so fickin' sweet my mouth nearly exploded. The after taste is just more sweet, which is NOT a good thing.. It really seems like most of these \"fruity\" drinks taste nearly the same, just more or less sweet. The smell is something between maracuya and pineapple. I mean it really would be great if it would not be so damn sweet. CURSE YOU ENERGY DRINK FACTORIES, why do you disappoint me so often???", 
        "tribute": "Thanks goes to Thorsten Schoog for all the drink i am currently reviewing.", 
        "url": "migros.ch", 
        "volume": 296.0
    }, 
    "mad_bat": {
        "CO2": false, 
        "Nutritions": {
            "biotin": 0, 
            "caffein": 32.0, 
            "calcium": 0, 
            "coenzym Q10": 0, 
            "energy": 48.0, 
            "guarana": 0, 
            "isomaltose": 0, 
            "magnesium": 0, 
            "niacin": 7.1, 
            "others": "", 
            "panthenol acid": 2.0, 
            "sodium": 0.07, 
            "sugar": 10.8, 
            "taurine": 400.0, 
            "vitamin B1": 0, 
            "vitamin B12": 0.5, 
            "vitamin B2": 0, 
            "vitamin B6": 1.4, 
            "vitamin C": 0, 
            "whey": 0
        }, 
        "bought from": "Edeka Supercenter Stuttgart Zuffenhausen", 
        "date": "2010-11-27", 
        "look": "It is a light-red and silver PAPER can with a small \"mb\" logo at the front. The can is made similar to the Tetra Pack packaging but in cylinder form. The opener is a small tin foil piece which you pull off to drink. On the can there is a \"since 1999\" and my only question is HOW did they survive for 11 years with such disgusting drink? But read more below.", 
        "name": "mad bat energy drink", 
        "overall": "I must say, this drink is really special. But special in a way you probably do not want your product be. This drink is, for now a really long time, the WORST energy drink i drank. Why, Mad Bat?  Why so disgusting?  The can says \"be awake\", well i am now awake but not because of the caffein but because of rage! Even if the drink would be free it would not be worth the price. My guess is that this drink is currently used for torture in afghanistan or korea. I HATE YOU bat beverages , i want my money AND the time back i needed to write this rant!", 
        "paid": 0.89, 
        "rating": "0.1", 
        "taste": "EWWWW... wtf seriously? This drink is just disgusting. It tastes something between gummy and plastic.  Has someone from the producer ever tasted it before selling? obviously NOT! It just tastes WRONG, probably something between toilet cleaner and dish soap.", 
        "url": "www.madbat.net", 
        "volume": 250.0
    }, 
    "magic_man": {
        "CO2": true, 
        "Nutritions": {
            "biotin": 0, 
            "caffein": 32.0, 
            "calcium": 0, 
            "coenzym Q10": 0, 
            "energy": 47.3, 
            "guarana": 0, 
            "isomaltose": 0, 
            "magnesium": 0, 
            "niacin": 6.0, 
            "others": "folacin(66.6ug)", 
            "panthenol acid": 2.0, 
            "sodium": 0.005, 
            "sugar": 11.1, 
            "taurine": 30.0, 
            "vitamin B1": 0, 
            "vitamin B12": 0, 
            "vitamin B2": 0, 
            "vitamin B6": 0.666, 
            "vitamin C": 20, 
            "whey": 0
        }, 
        "bought from": "Rewe Stuttgart", 
        "look": "It is a see-through plastic bottle with a silver/purple label and the Magic Man logo. The \"Magic Man\" is the drawing of men by Leonardo Da Vinci. It actually looks pretty cheap.", 
        "name": "Magic Man Energydrink", 
        "overall": "I bought this the first time because it was really cheap. Well, bad luck with that one. It tastes really bad. If you drink it anyway, don't say i haven't warened you!", 
        "paid": 0.49, 
        "rating": 4.1, 
        "taste": "It tastes incredibly sweet and has a very strong berry taste. It tastes somewhat different from the ordinary gummy taste. This tastes worse than most of the cheap energy drinks. It is drinkable when cold, don't drink it warm!", 
        "url": "GEDIMA Erfrischungsgetraenke GmbH, D-41836 Hueckelhoven", 
        "volume": 500.0
    }, 
    "mixxed_up": {
        "CO2": true, 
        "Nutritions": {
            "biotin": 0, 
            "caffein": 30.0, 
            "calcium": 0, 
            "coenzym Q10": 0, 
            "energy": 45.0, 
            "guarana": 0, 
            "isomaltose": 0, 
            "magnesium": 0, 
            "niacin": 7.92, 
            "others": "", 
            "panthenol acid": 1.98, 
            "sodium": 0.1, 
            "sugar": 10.4, 
            "taurine": 380.0, 
            "vitamin B1": 0, 
            "vitamin B12": 2.0, 
            "vitamin B2": 0, 
            "vitamin B6": 2.0, 
            "vitamin C": 0, 
            "whey": 0
        }, 
        "bought from": "Lidl Stuttgart", 
        "look": "It comes in a light-brown see-through bottle. The bottle has a green label with a light-green X at the front.", 
        "name": "mixxed up energy drink", 
        "overall": "The drink is downright average. The price is cheap here in germany, the bottle is small and the taste is somewhat average. There really are better ones out there but if you got no alternatives try it.", 
        "paid": 0.35, 
        "rating": 6.6, 
        "taste": "Mixxed up tastes like some ordinary energy drink. It is really sweet, got the ordinary gummy bear taste. But that is not necessarily a bad thing. ", 
        "url": "Mitteldeutsche Erfrischungsgetraenke GmbH & Co. KG Langendorfer Strasse 23 D-06667 Weissenfels, www.lidl.de", 
        "volume": 330.0
    }, 
    "monster_energy": {
        "CO2": true, 
        "Nutritions": {
            "caffein": 30, 
            "energy": 48, 
            "niacin": 8.54, 
            "others": "Ginseng (80mg),L-Carnitina(40mg)", 
            "sodium": 0.08, 
            "sugar": 12, 
            "taurine": 400, 
            "vitamin B12": 2.5, 
            "vitamin B2": 0.74, 
            "vitamin B6": 0.84
        }, 
        "bought from": "Supermarked PAM, Milano, Viale Olona. UPDATE: Edeka Supercenter Stuttgart", 
        "look": "black can, green M. One of the more common energy drinks", 
        "name": "Monster Energy", 
        "last_reviewed" : "17.12.2010",
        "overall": "drank this before in the US. enough for a long night.  Must drink chilled, otherwise it will taste really bad. UPDATE: I must say it does not taste too got even when it is cold.. After this Re-Review i must cut down the score by 0.8 (why you might ask 0.8? well i dunno really, i guess a bit arbitrariness cannot be wrong).", 
        "paid": 1.69, 
        "rating": 6.7, 
        "taste": "Its somewhat tastes like soap and flowers when warm.Besides that the drink really sweet (haven't drunk it chilled though).There is  not enough CO2 in it, which makes the drink not sour at all. When cold it tastes much better, more like lychie and not as sweet. Not the typical gummy bear taste... UPDATE: Today(17.12.2010) i tried the drink again and i must say, it still sucks. It still got this soapy after taste and is far too sweet.", 
        "url": "www.monsterenergy.com", 
        "volume": 500
    }, 
    "monster_ripper": {
        "CO2": true, 
        "Nutritions": {
            "biotin": 0, 
            "caffein": 30.0, 
            "calcium": 0, 
            "coenzym Q10": 0, 
            "energy": 47.0, 
            "guarana": 2.0, 
            "isomaltose": 0, 
            "magnesium": 0, 
            "niacin": 8.5, 
            "others": "L-Carnitin-l-Tartrat(4mg)", 
            "panthenol acid": 0, 
            "sodium": 0.009, 
            "sugar": 10.0, 
            "taurine": 400.0, 
            "vitamin B1": 0, 
            "vitamin B12": 2.5, 
            "vitamin B2": 0.7, 
            "vitamin B6": 0.8, 
            "vitamin C": 0, 
            "whey": 0
        }, 
        "bought from": "Edeka Center Stuttgart Zuffenhausen", 
        "look": "It comes in a black/grey can with a yellow M like the whole Monster series. The slogan is Energy+Saft.", 
        "name": "Monster Ripper Energy+Saft", 
        "overall": "This drink is a real disappointment for me. I hoped for something which really tastes like juice and energy but this stuff is just sweet as hell. I sure as hell can NOT recommend this stuff. Go buy something which tastes better AND is cheaper than this from your local discounter.", 
        "paid": 1.79, 
        "rating": 3.2, 
        "taste": "The first taste is like WTF? The second taste is BAAAAWWWHHH! I guess the taste should be something like pineapple but the after taste is incredibly intense. I cannot really describe what it tastes like, but it does NOT taste good. It is so sweet my jaw almost fell off. I hoped for something which reall", 
        "url": "www.monsterenergy.com", 
        "volume": 500
    }, 
    "naturell_energy_citrus": {
        "CO2": true, 
        "Nutritions": {
            "caffein": 32, 
            "energy": 45.9, 
            "others": "Guarana extract", 
            "sodium": 0.01, 
            "sugar": 11.1, 
            "taurine": 0
        }, 
        "bought from": "Kaufland Berlin Schoeneweide", 
        "look": "It is an all white can with green an silver pattern.This actually looks pretty cool. It looks kinda expensive to me.", 
        "name": "Naturell energy Citrus", 
        "overall": "This stuff is really great for the taste. Even though it does not have taurine in it, it gives you enough energy to move on on a lazy saturday. And for the price you at least have to try it once!", 
        "paid": 0.39, 
        "rating": 8, 
        "taste": "It tasts somewhat like citrus juice with lots of sugar.  Actually this is really good and tasts well. For me it killed my thirst ( which is something special with energy drinks). Does not have this gummy bear taste or at least not really intense.", 
        "url": "Taisentaler Getraenke GMBH", 
        "volume": 330
    }, 
    "nos": {
        "CO2": true, 
        "Nutritions": {
            "biotin": 0, 
            "caffein": 54.0, 
            "calcium": 0, 
            "coenzym Q10": 0, 
            "energy": 45.8, 
            "guarana": 0, 
            "isomaltose": 0, 
            "magnesium": 0, 
            "niacin": 0, 
            "others": "inositol (41mg) ,ginseng (20.8mg), L-Carnitine (83.3mg)", 
            "panthenol acid": 0, 
            "sodium": 0.054, 
            "sugar": 10.8, 
            "taurine": 422.0, 
            "vitamin B1": 0, 
            "vitamin B12": 2.5, 
            "vitamin B2": 0, 
            "vitamin B6": 83.0, 
            "vitamin C": 25.0, 
            "whey": 0
        }, 
        "bought from": "Safeways SF U.S.A.", 
        "date": "2010-12-05", 
        "look": "It comes in a blue can with the white NOS logo at the front. I do not know it exactly, but the can seems awfully similar to the \"Monster\" and \"Rockstar\" drinks. II once drank this drink in U.S. which came in a silver plastic bottle which actually looks like a NOS bottle, i will provide a picture of it.", 
        "name": "NOS", 
        "overall": "Because it is so similar to the monster ripper drink (besides tasting like shit) i would guess it comes from the same factory. It is not my favorite drink, but is not too bad. Because it does not have this typical gummy taste it surely is a good alternative energy provider. They added a huge amount of caffeine inside the drink, which makes it even greater.", 
        "paid": 2.0, 
        "rating": 7.7, 
        "taste": "Ihe taste is similar to the Monster Ripper drink only not that disgusting. The taste is something between artificial pineapple and artifical grapefruit. It does not have the disgusting after taste like monster ripper. It surely does not taste like every ordinary energy drink. It really is not too bad.", 
        "tribute": "A huge thanks goes to Moritz Bauer who brought this drink to Germany and sponsored me this can.", 
        "url": "www.drinknos.com", 
        "volume": 473.0
    }, 
    "power_point_juicy": {
        "CO2": true, 
        "Nutritions": {
            "biotin": 0, 
            "caffein": 32.0, 
            "calcium": 0, 
            "coenzym Q10": 0, 
            "energy": 41.0, 
            "guarana": 0, 
            "isomaltose": 0, 
            "magnesium": 0, 
            "niacin": 3.6, 
            "others": "Inosit,Guaranaextract", 
            "panthenol acid": 1.2, 
            "sodium": 0.1, 
            "sugar": 9.5, 
            "taurine": 400.0, 
            "vitamin B1": 0, 
            "vitamin B12": 0.2, 
            "vitamin B2": 0, 
            "vitamin B6": 0.4, 
            "vitamin C": 0, 
            "whey": 51.0
        }, 
        "bought from": "Edeka Supercenter Stuttgart Zuffenhausen", 
        "look": "It is an orange and black can with the powerpoint logo at the front. It looks kinda stylish.", 
        "name": "powerpoint euphoric energy Juicy", 
        "overall": "This is some great energy drink with 25 percent fruit content. I really like the taste and the price is really ok, too. Overall a great juicy energy drink without can desposit here in Germany. I really can recommend it.", 
        "paid": 0.69, 
        "rating": 9.4, 
        "taste": "It somewhat does not taste any like an ordinary energy drink, more like a multi vitamin drink with CO2. It is a bit sour, but very juicy. I really like the taste.", 
        "url": "www.powerpoint-energy.de", 
        "volume": 250.0
    }, 
    "power_up": {
        "CO2": true, 
        "Nutritions": {
            "caffein": 30, 
            "energy": 47, 
            "niacin": 8, 
            "others": "", 
            "panthenol acid": 2, 
            "sodium": 0.1, 
            "sugar": 10.8, 
            "taurine": 380, 
            "vitamin B12": 2, 
            "vitamin B6": 2
        }, 
        "bought from": "Real Berlin Neukölln", 
        "look": "A silver can with the Power up logo on it.Really looks somewhat cheap.", 
        "name": "Power Up Energy Drink", 
        "overall": "A Cheap, mediocre tasting drink.", 
        "paid": 0.49, 
        "rating": 7.1, 
        "taste": "It tastes really sweet with a very strong gummy taste. It surely is not the best E-drink i drank until now.", 
        "url": "SIG-Import GmbH", 
        "volume": 250
    }, 
    "redbull": {
        "CO2": true, 
        "Nutritions": {
            "caffein": 32, 
            "energy": 45, 
            "niacin": 8, 
            "others": "", 
            "panthenol acid": 2, 
            "sodium": 0, 
            "sugar": 11, 
            "taurine": 400, 
            "vitamin B12": 2, 
            "vitamin B6": 2
        }, 
        "bought from": "Kaufland Berlin Schöneweide", 
        "look": "Blue and silver Can with two bulls in the middle fighting against eachother. Most people know it.", 
        "name": "Red Bull Energy Drink", 
        "overall": "This drink can be concidered THE energydrink period.  You can buy it everywhere, its in the commercials. Anyway this does not mean it tastes incredibly awesome or packs a real punch, but the Public Relation Department did a great job pushing this drink.  For me it surely does not taste like the `best` drink and i think it is really overpriced but you can buy it nearly everywhere. I got mine really cheap from Kaufland as a special offer, otherwise i would not have bought it.It surely defines for most people what a energy drink is, anyway not for me as i can tell from its taste and from drinking quite a few energy drinks in my life. On my quest for drinking all the energy drinks in the world i will try to find which drinks are the same but have a different packaging.Reference will be this drink because i am really sure they sell their stuff under different names.", 
        "paid": 1.49, 
        "rating": 7.2, 
        "taste": "It got that energy-type gummy bear taste, is pretty sweet and comes with quite a lot of CO2. For me it really is too sweet and the gummy taste is too intense. The after-taste is somewhat sour.It tastes ok but it surely is not GREAT.", 
        "url": "www.redbull.de", 
        "volume": 250
    }, 
    "relentless": {
        "CO2": true, 
        "Nutritions": {
            "caffein": 32, 
            "energy": 46, 
            "niacin": 3.6, 
            "others": "", 
            "panthenol acid": 1.2, 
            "sodium": 0.05, 
            "sugar": 10.4, 
            "taurine": 400, 
            "vitamin B12": 0.2, 
            "vitamin B6": 0.4
        }, 
        "bought from": "Kaisers Berlin Gropiuspassagen", 
        "look": "The can looks really cool with its black front and its white/bronze text. At the bottom it says KEINE HALBEN SACHEN (no things done by halve) but actually is resealable. It is not really simple to drink from this, but the cap holds really tight! ", 
        "name": "Relentless Origin", 
        "overall": "I must say this is one of my favorite energy drinks.  It tastes not incredibly sweet. Got average taurine and caffein contents and comes in a big bottle. The only downside for me is the resealable cap, which is somewhat hard to drink from and the above average price.", 
        "paid": 1.59, 
        "rating": 8.5, 
        "taste": "The taste is really smooth and not too sweet. It does not taste much like gummy bears, which is, at least for me, a good thing. I really like it. When drinking it you really feal empowered.", 
        "url": "www.relentlessenergy.de", 
        "volume": 485
    }, 
    "relentless_shot": {
        "CO2": false, 
        "Nutritions": {
            "biotin": 0, 
            "caffein": 160.0, 
            "calcium": 0, 
            "coenzym Q10": 0, 
            "energy": 48.0, 
            "guarana": 0, 
            "isomaltose": 0, 
            "magnesium": 0, 
            "niacin": 18.0, 
            "others": "Glucuronolacton(70mg),Inositol(12mg)", 
            "panthenol acid": 6.0, 
            "sodium": 0, 
            "sugar": 11.0, 
            "taurine": 400.0, 
            "vitamin B1": 0, 
            "vitamin B12": 1.0, 
            "vitamin B2": 0, 
            "vitamin B6": 2.0, 
            "vitamin C": 0, 
            "whey": 0
        }, 
        "bought from": "Widirent Olgastr.", 
        "look": "The Shot comes in a all-black small bottle with a big R on the front. Coca Cola uses their new old-school energy drink brand for this shot.", 
        "name": "Relentless Energy Shot", 
        "overall": "This is one of those \"shot\" drinks. They probably thought no one will ever drink it for the taste. Well that is at least what i think. As most of the shot drinks, it is pretty expensive for what you get, both the nutritions and the overall volume. It might work for a longer night, but thats about it. Drink some real denergy drink instead of these shots because it tastes much better and kicks in more.", 
        "paid": 2.0, 
        "rating": 5.0, 
        "taste": "It smells like some sweet syrup. The first sip is somewhat sour and becomes sweet after a second. The after taste is somewhat weirdly sour. The drink itself tastes a lot like Blitz Start and it got the same consistency (thick).", 
        "tribute": "A big Thanks goes to Phil for donating this energy drink to me and the energy drink database", 
        "url": "www.relentlessenergy.de", 
        "volume": 50.0
    }, 
    "rhinos": {
        "CO2": true, 
        "Nutritions": {
            "biotin": 0, 
            "caffein": 31.5, 
            "calcium": 0, 
            "coenzym Q10": 0, 
            "energy": 48.7, 
            "guarana": 0, 
            "isomaltose": 0, 
            "magnesium": 0, 
            "niacin": 7.92, 
            "others": "", 
            "panthenol acid": 1.9, 
            "sodium": 0.1, 
            "sugar": 11.3, 
            "taurine": 380.0, 
            "vitamin B1": 0, 
            "vitamin B12": 2.0, 
            "vitamin B2": 0, 
            "vitamin B6": 2.0, 
            "vitamin C": 0, 
            "whey": 0
        }, 
        "bought from": "Rewe Stuttgart Zuffenhausen", 
        "look": "It is a silver and dark green can with an outlined rhinoceros at the front, presumably the logo of this energy drink. The new cans have all kinds of labels and stuff on it. The older cans had no such labels on it and therefore seemed more pure to me.", 
        "name": "rhino's energy drink", 
        "overall": "When i started with searching for good energy drinks, this was one of the first drinks i really thought of \"Wow, this actually tastes really really good!\". Too bad the price above average and with 4 euro per liter pretty expensive. Still i buy this drink when it comes in the ads with a capaign price of 66 cents per can. One of my favorites still.", 
        "paid": 0.99, 
        "rating": 8.6, 
        "taste": "Rhino's energy drink is really delicious. It is not so sweet and the gummy bear taste is not strong. It got medium CO2 and is very drinkable. I really like it!", 
        "url": "www.rhinos-energy.com", 
        "volume": 250.0
    }, 
    "rockstar_apple": {
        "CO2": true, 
        "Nutritions": {
            "biotin": 0, 
            "caffein": 32.0, 
            "calcium": 0, 
            "coenzym Q10": 0, 
            "energy": 58.0, 
            "guarana": 10.0, 
            "isomaltose": 0, 
            "magnesium": 0, 
            "niacin": 3.6, 
            "others": "Ginseng(10mg)", 
            "panthenol acid": 1.2, 
            "sodium": 0.004, 
            "sugar": 13.7, 
            "taurine": 400.0, 
            "vitamin B1": 0, 
            "vitamin B12": 0.2, 
            "vitamin B2": 0, 
            "vitamin B6": 0.4, 
            "vitamin C": 0, 
            "whey": 0
        }, 
        "bought from": "E-Center Stuttgart Zuffenhausen", 
        "look": "It comes in a black and green can with the rock\"star\" on the front. The black can looks really cool to me.", 
        "name": "Rockstar Punched Energy+Apple", 
        "overall": "It is definitly one of the better rockstar drinks. Still it is not really that great. ", 
        "paid": 1.79, 
        "rating": 6.4, 
        "taste": "If you know these sour apple gummies, this is how rockstar apple tastes like! It is bottled gummy. This also means it is incredibly sweet.", 
        "url": "www.rockstarenergy.de", 
        "volume": 500.0
    }, 
    "rockstar_energy": {
        "CO2": true, 
        "Nutritions": {
            "caffein": 32, 
            "coenzym Q10": 0, 
            "energy": 60, 
            "glucuronolacton": 0, 
            "niacin": 3.6, 
            "others": "", 
            "panthenol acid": 1.2, 
            "sodium": 0.054, 
            "sugar": 13.1, 
            "taurine": 400, 
            "vitamin B12": 0, 
            "vitamin B6": 0, 
            "vitamin C": 0
        }, 
        "bought from": "Real Berlin Neukölln", 
        "look": "Black can with golden star at the front. It actually looks pretty cool.", 
        "name": "Rockstar Energy Drink", 
        "overall": "This tastes no other than cheap energy drinks, has typical tastes and overall does not taste like anything special. There are better drinks out there. I just saw at the website that they have like a dozen other tastes, so there might be the chance one of them is really good.", 
        "paid": 1.79, 
        "rating": 7.3, 
        "taste": "When taking the first sip it is very sparkling, then becomes a bit sour and starts the taste very sweet. The gummy bear taste starts far behind in the palate. The aftertaste is typically very sweet. ", 
        "url": "www.rockstarenergy.com", 
        "volume": 500
    }, 
    "rockstar_guava": {
        "CO2": true, 
        "Nutritions": {
            "biotin": 0, 
            "caffein": 32.0, 
            "calcium": 0, 
            "coenzym Q10": 0, 
            "energy": 63.0, 
            "guarana": 0, 
            "isomaltose": 0, 
            "magnesium": 0, 
            "niacin": 3.6, 
            "others": "Ginseng Extract(1g)", 
            "panthenol acid": 1.2, 
            "sodium": 0.1, 
            "sugar": 15.0, 
            "taurine": 400.0, 
            "vitamin B1": 0, 
            "vitamin B12": 0.2, 
            "vitamin B2": 0, 
            "vitamin B6": 0.4, 
            "vitamin C": 0, 
            "whey": 0
        }, 
        "bought from": "E-Center Stuttgart Zuffenhausen", 
        "look": "Like all Rockstar drinks it comes in a half liter can with a big golden star at the front. I really like this style. This can is purple with a golden top. Maybe because it should look somewhat tropical (thats at least what the name suggests).", 
        "name": "Rockstar Punched Energy+Guava", 
        "overall": "I like it much better than most of the Rockstar Energy Drinks because it is only sweet, not OMGWTF sweet.I can recommend this drink, even though it is not 100 percent my taste. Check it out.", 
        "paid": 1.79, 
        "rating": 7.6, 
        "taste": "The taste is similar to the Monster Ripper, but it is both barely as sweet and disgusting as that drink. It tastes somewhat like pineapple but i am actually not really sure what it \"should\" be. I guess it is guava, but i never actually ate or drank this fruit. The taste is really not too sweet for my taste. I am really sure it is only drinkable when it is cold, otherwise the taste may fall over to MAXIMUM sweetness.", 
        "url": "www.rockstarenergy.de", 
        "volume": 500.0
    }, 
    "rockstar_juice": {
        "CO2": true, 
        "Nutritions": {
            "biotin": 0, 
            "caffein": 32.0, 
            "calcium": 0, 
            "coenzym Q10": 0, 
            "energy": 65.0, 
            "guarana": 10.0, 
            "isomaltose": 0, 
            "magnesium": 0, 
            "niacin": 3.6, 
            "others": "", 
            "panthenol acid": 1.2, 
            "sodium": 0.1, 
            "sugar": 15.4, 
            "taurine": 400.0, 
            "vitamin B1": 0, 
            "vitamin B12": 0.2, 
            "vitamin B2": 0, 
            "vitamin B6": 0.4, 
            "vitamin C": 0, 
            "whey": 0
        }, 
        "bought from": "E-Center Stuttgart Zuffenhausen", 
        "look": "This time it is an orange can with a golden star at the front. I guess they wanted to make it look extra juicy by taking bright colors. The front says it got the taste \"mango, orange, passion fruit\" but in the ingredients 9.4 percent out of the 10 percent juice is from apple and nowhere passion fruit is mentioned... ", 
        "name": "Rockstar Juiced Energy+Juice", 
        "overall": "This drink falls under the category \"FOR SCIENCE\" with it's taste. It really is ok for a juice drink and it got enough caffein to keep you awake. It really is worth a try.", 
        "paid": 1.79, 
        "rating": 7.0, 
        "taste": "It really is incredible what the producer of those drinks can do with 9.4 percent of apple concentrate and some \"flavor\". Only the aftertaste is somewhat apple'y but at first it really tastes like orange and a little bit mango. Well, it is more like when you never ate orange and mango, how you THINK it might taste like. Because i never  ever tried passion fruit before, i cannot tell if it got any passion fruit flavor at all.Anyway this one is not too bad, i mean, it is sweet as shit, but just a bit sweeter than most energy drinks.", 
        "url": "www.rockstarenergy.de", 
        "volume": 500.0
    }, 
    "russian_power": {
        "CO2": true, 
        "Nutritions": {
            "caffein": 32, 
            "energy": 45, 
            "niacin": 7.92, 
            "others": "", 
            "panthenol acid": 1.98, 
            "sodium": 0.1, 
            "sugar": 11.3, 
            "taurine": 380, 
            "vitamin B12": 2.0, 
            "vitamin B6": 2.0, 
            "whey": 51
        }, 
        "bought from": "Aljonka Russische Spezialitaeten Alexanderplatz", 
        "look": "It's a black can with the russian flag and a warrior with a huge sword at the front. It really looks kinda cool, even though i am pretty sure this energy drink is not actually from Russia", 
        "name": "Russian Power", 
        "overall": "A great energy drink with no can disposit but an average price. I drank this one after the ANGEL Natural stuff and i felt much better afterwards.A small downer only is what i paid for it.", 
        "paid": 1.29, 
        "rating": 8.5, 
        "taste": "This energy drink tasts really good. Its not too sweet, got this characteristic gummy bear taste and well, you really feel empowered! The whey in it does not have any taste, but that is really no problem,at least there is no can disposit for this here in germany.", 
        "url": "www.russianpower.org", 
        "volume": 250
    }, 
    "schwarze_dose": {
        "CO2": true, 
        "Nutritions": {
            "caffein": 32, 
            "coenzym Q10": 3, 
            "energy": 58, 
            "guarana": 100, 
            "isomaltose": 5, 
            "niacin": 7.9, 
            "panthenol acid": 2, 
            "sodium": 0.001, 
            "sugar": 14.4, 
            "taurine": 0, 
            "vitamin B12": 2, 
            "vitamin B6": 2, 
            "vitamin C": 24
        }, 
        "bought from": "Real Berlin Neukölln", 
        "look": "Black Can with golden phoenix.TODO", 
        "name": "Schwarze Dose 28", 
        "overall": "TODO", 
        "paid": 1.49, 
        "rating": 8.0, 
        "taste": "Can writing says 'Acai taste'TODO", 
        "url": "www.schwarzedose.de", 
        "volume": 250
    }, 
    "sexergy": {
        "CO2": true, 
        "Nutritions": {
            "biotin": 0, 
            "caffein": 30.0, 
            "calcium": 0, 
            "coenzym Q10": 0, 
            "energy": 47.4, 
            "guarana": 0, 
            "isomaltose": 0, 
            "magnesium": 0, 
            "niacin": 3.94, 
            "others": "guarana-extract", 
            "panthenol acid": 0.99, 
            "sodium": 0.02, 
            "sugar": 11.1, 
            "taurine": 380.0, 
            "vitamin B1": 0, 
            "vitamin B12": 1.0, 
            "vitamin B2": 0, 
            "vitamin B6": 1.0, 
            "vitamin C": 0, 
            "whey": 0
        }, 
        "bought from": "Rewe Stuttgart", 
        "look": "It is a black can with the silver and red sexergy logo on it. They call it \"premium energy drink\" with cherry taste.", 
        "name": "sexergy premium energy drink", 
        "overall": "It sure is drinkable but it does not really taste \"premium\". It got a different taste than other drinks but this is not necessarily a good thing. Due to the intense cherry-syrup taste i cannot really enjoy this drink. In my oppinion it is not worth the pretty hefty price tag.", 
        "paid": 1.59, 
        "rating": 5.6, 
        "taste": "It sure does taste like cherry. The taste is similar to the cheap 8 percent cherry drinks you can buy at the Doener Imbiss, just with added CO2. The cherry flavor is extremly dominant and it sure does not taste like an ordinary energy drink.", 
        "url": "www.sexergy-energy.com", 
        "volume": 250.0
    }, 
    "she_energy": {
        "CO2": true, 
        "Nutritions": {
            "biotin": 0, 
            "caffein": 30, 
            "calcium": 0, 
            "coenzym Q10": 0, 
            "energy": 0, 
            "guarana": 0, 
            "isomaltose": 0, 
            "magnesium": 0, 
            "niacin": 1.6, 
            "others": "", 
            "panthenol acid": 0.8, 
            "sodium": 0.02, 
            "sugar": 0, 
            "taurine": 0, 
            "vitamin B1": 0, 
            "vitamin B12": 0.9, 
            "vitamin B2": 0, 
            "vitamin B6": 4, 
            "vitamin C": 25, 
            "whey": 0
        }, 
        "bought from": "Netherlands (TODO)", 
        "look": "It comes in a pink can with a she-superman logo (or diamond) with a devils tail. As this is an netherland energy drink, everything text on the can is dutch language, which is a pain in the ass to decypher.", 
        "name": "She Super Energy Drink", 
        "overall": "I do not know if this really is a womens drink, maybe it tastes better when you are a girl. It tastes ... well different i guess. If you like incredibly sour drinks, this one is for you. If you ever tried center shock and liked it (or you like giving it to other people) this drink is a must. Check it out, it even has no sugar and calories, e.g. you do not get fat.", 
        "paid": 0.99, 
        "rating": 6.5, 
        "taste": "It somewhat smells like synthetic peach at the first smell. When you drink it, the first sip is like... mhh this really smells like peach or something. Then you swallow it down, it tastes like apple or something, THEN it is like a punch in the face by SOUR. If you ever tried Center Shock chewing gum, this is the opposite of them, first somewhat delicious and then incredibly sour(painful). I never thought this is ever possible with an energy drink. Everything inside your mouth feels tingly, probably not made by human.", 
        "url": "she-energydrink.com", 
        "volume": 250
    }, 
    "steinberg": {
        "CO2": true, 
        "Nutritions": {
            "biotin": 30, 
            "caffein": 32, 
            "energy": 48, 
            "others": "", 
            "panthenol acid": 1.2, 
            "sodium": 0.04, 
            "sugar": 11.0, 
            "taurine": 30, 
            "vitamin B6": 0.4, 
            "whey": 51
        }, 
        "bought from": "IFA Berlin at UNIMALL promition booth", 
        "look": "Black can with some musician or something on it, very graphical", 
        "name": "Power by Steinberg and Unimall", 
        "overall": "I got this one from the IFA Berlin at the UNIMALL promotion booth, for that i had a small chatter what they do and stuff.In the end i got this delicios energy drink.This is the kind of energy drink i really like to drink. Tastes almost the same as the Russian Power stuff, at least check this stuff out or send unimall.de a mail you want one of these drinks. It was free for me, that definitly is a plus.", 
        "paid": 0, 
        "rating": 9.1, 
        "taste": "I really really like this stuff with whey. It tastes not too soure, average CO2, not too sweet gummy bear taste. I like it", 
        "url": "unimall.de(promo),suesswarenversand.de", 
        "volume": 250
    }, 
    "taurine_force": {
        "CO2": true, 
        "Nutritions": {
            "caffein": 32, 
            "energy": 46.5, 
            "glucuronolacton": 240, 
            "niacin": 0, 
            "others": "", 
            "panthenol acid": 0, 
            "sodium": 0.04, 
            "sugar": 11, 
            "taurine": 400, 
            "vitamin B12": 2, 
            "vitamin B2": 0.6, 
            "vitamin B3": 8.7, 
            "vitamin B5": 2, 
            "vitamin B6": 2
        }, 
        "bought from": "Carrefour Milan", 
        "look": "Somewhat cheap looking blue can with silver backdrop. In the front there is a exploding core or maybe a brain cell or i don't know.", 
        "name": "Carrefour Taurine Force Energy Drink", 
        "overall": "Tastes like an ordinary energy drink. Nothing special but rock solid. It also was not really expensive. Produced for Carrefour which is orginally located in France but i found that one in italy,milano", 
        "paid": 0.69, 
        "rating": 8, 
        "taste": "Tastes actually really good. Typical Energy Drink taste, not too much CO2, really sweet.", 
        "url": "carrefour supermarket", 
        "volume": 250
    }, 
    "taurus_berry": {
        "CO2": true, 
        "Nutritions": {
            "biotin": 0, 
            "caffein": 30.0, 
            "calcium": 0, 
            "coenzym Q10": 0, 
            "energy": 49.4, 
            "guarana": 0, 
            "isomaltose": 0, 
            "magnesium": 0, 
            "niacin": 0, 
            "others": "", 
            "panthenol acid": 0, 
            "sodium": 0.1, 
            "sugar": 12.1, 
            "taurine": 30.0, 
            "vitamin B1": 0, 
            "vitamin B12": 0, 
            "vitamin B2": 0, 
            "vitamin B6": 0, 
            "vitamin C": 0, 
            "whey": 0
        }, 
        "bought from": "E-Center Stuttgart Zuffenhausen", 
        "look": "This time is not a can, but a see-through bottle with a silver-colored cap. The label has a bull with muscle arms(wtf?) and lightning on a red and black background. The drink itself is something between red and purple.", 
        "name": "Taurus Energy Drink Berry", 
        "overall": "It looks cheap, it tastes cheap, but the overall price is average. It is way too sweet to be enjoyable. It might not even be worth a try, but when you are a collector like me, it is still a must-drink :P.", 
        "paid": 0.99, 
        "rating": 5.0, 
        "taste": "Oh my god, this is so... berry'... It smells so strong like these berry gummy bears. This is so sweet... geez. This that  same artificial berry taste you might know. It is just waaay too strong, i do not really like it.", 
        "url": "taurusenergy.de", 
        "volume": 500.0
    }, 
    "trojka_energy": {
        "CO2": true, 
        "Nutritions": {
            "biotin": 0, 
            "caffein": 32.0, 
            "calcium": 0, 
            "coenzym Q10": 0, 
            "energy": 50.0, 
            "guarana": 0, 
            "isomaltose": 0, 
            "magnesium": 0, 
            "niacin": 7.92, 
            "others": "", 
            "panthenol acid": 1.98, 
            "sodium": 0.0, 
            "sugar": 11.3, 
            "taurine": 400.0, 
            "vitamin B1": 0, 
            "vitamin B12": 2.0, 
            "vitamin B2": 0, 
            "vitamin B6": 2.0, 
            "vitamin C": 0, 
            "whey": 0
        }, 
        "bought from": "TODO somewhere in Swizerland", 
        "date": "2010-12-05", 
        "look": "It comes in a blue and red can with a red and white star in the middle. It somewhat looks like what i think russian beer should look like. I drank the \"big can\" version with 440 ml, not that big after all.", 
        "name": "Trojka energy", 
        "overall": "As \"The Star of Energy\" its pretty mediocre. I mean it tastes O.K. but it is definitly not the greatest drink i ever drank in my life. As this is the first swiss energy drink i drank (8 more to come) i have high hopes for the remaining ones.", 
        "paid": 1.35, 
        "rating": 7.1, 
        "taste": "When opened it smells like every other energy drink. Well, it actually tastes like most energy drinks, with more chewing gum and less gummy bear taste. The taste while drinking is actually pretty good, not too sweet. The after taste is really sweet, like most drinks. I kinda like it.", 
        "tribute": "Thanks to Thorsten Schoog for this drink. You are awesome!", 
        "url": "www.trojkaenergy.com", 
        "volume": 440.0
    }, 
    "v_energy": {
        "CO2": true, 
        "Nutritions": {
            "biotin": 0, 
            "caffein": 31.0, 
            "calcium": 0, 
            "coenzym Q10": 0, 
            "energy": 44.0, 
            "guarana": 120.0, 
            "isomaltose": 0, 
            "magnesium": 0, 
            "niacin": 1.1, 
            "others": "", 
            "panthenol acid": 0.36, 
            "sodium": 1.3, 
            "sugar": 11.0, 
            "taurine": 0.0, 
            "vitamin B1": 0, 
            "vitamin B12": 0, 
            "vitamin B2": 0, 
            "vitamin B6": 1.12, 
            "vitamin C": 0, 
            "whey": 0
        }, 
        "bought from": "somewhere in NL (TODO)", 
        "look": "It comes in a green can with the black \"V\" logo at the front. The V looks like the atom symbol. It looks kinda cool though.", 
        "name": "V the afternoon wake-up call", 
        "overall": "It was nice to have a really different taste from ordinary drink, but \"special\" does not always mean \"better\". Therefore i cannot really recommend it. The after taste is just weird.", 
        "paid": 0.75, 
        "rating": 5.8, 
        "taste": "Tastes really... weird. It got a somewhat 'smokey', bitter after taste. I cannot really say i like it. There is not much CO2 in the drink, which, for me is definitly a minus. There is definitly not too much prickling on my tongue. It does not have the typical gummy bear taste like most energy drinks, this is probably because it does not contain any taurine.", 
        "url": "Winters, Maarheeze NL", 
        "volume": 250.0
    }
}
